{
  "title": "245491 - Data Scientist Intern/Co-op - May 2025",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Data Scientist Intern/Co-op - May 2025"
    },
    {
      "key": "Job Location:",
      "value": "North Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$65,000.00 To $75,000.00 Annually"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Opportunity\n\nOlympic Industries ULC is currently searching for a highly motivated and innovative Data Scientist Intern to join our team for a 4-month contract beginning May 2025!\n\nThe Data Scientist Intern will be responsible for developing and maintaining data pipelines, optimizing infrastructure, assisting in backend development, and implementing machine learning models to support the company's business objectives and operations.\n\nResponsibilities\n\nReporting to the Data Scientist, the Data Scientist Intern is responsible for the following as well as other related duties as assigned to support the business objectives and purpose of the company:\n\nDevelop, construct, test, and maintain optimal data pipeline architecture.\nIdentify, design, and implement internal process improvements including re-designing infrastructure for greater scalability, optimizing data delivery, and automating manual processes.\nDevelop and manage well-functioning databases and applications.\nAssist in code optimization in data science and trading projects.\nTroubleshoot and debug automation and scraping program code.\nAssist Full-Stack Data Developer with backend development.\nDevelop, test, and implement machine learning models using Python and other relevant tools and technologies.\nWork closely with our data engineering team to ensure that our data pipelines are optimized for machine learning applications.\n\nWho We Are\n\nOlympic Industries ULC is a leading international forest products trading company with our annual revenue exceeding $500 million. Our expertise includes the trading, importing/exporting, and manufacturing of forest products from the comfort of our office located in the heart of the vibrant and breathtaking Lonsdale Quay in North Vancouver, BC. With over 25 active Commodity Traders in house, we are proud to have a corporate culture that rewards hard work, entrepreneurship, and team collaboration.\n\nWhat We Offer\n\nSmall Company with Big Perks\n\nOlympic is a mid-sized company with an open door/open concept layout where anybody you may need is easily accessible. This layout not only helps to support individuals in their career growth and development but also encourages individuals to interact and be curious about how different departments support each other in their roles.\n\nGreat Central Location\n\nLocated in the Lonsdale Quay, Olympic is transit accessible from any location in the lower mainland. There are many great shops, restaurants, and parks within a walking distance and the mountains are just a 10-minute drive away.\n\nAdditional Details\n\nSalary range: $65,000-$75,000 per annum.\nThis position is hybrid, working Monday through Thursday in our office located in Lower Lonsdale, North Vancouver.\nEmployee-only in-office gym & show facilities.\nNespresso coffee & tea bar.\nWeekly Wednesday morning breakfast!\n\nApply Now!\n\nFor more information on Olympic Industries, please visit our website.\n\nWe thank all applicants for their interest! However, only those selected for an interview will be contacted. At Olympic Industries, we embrace diversity and are committed to building a team that represents a variety of backgrounds, cultures, perspectives skills, and experiences. As an equal opportunity employer, we encourage applications from all qualified individuals."
    },
    {
      "key": "Qualifications:",
      "value": "Position Requirements\n\nTo be successful as a Data Scientist Intern, an individual must be committed to developing, maintaining, and demonstrating the following:\n\nEducation and Experience\n\nAn academic background in Computer Science, Software/Computer Engineering, or a related technical field.\nExperience in writing complex SQL queries and working with databases, such as MSSQL, MySQL, PostgreSQL, and MongoDB.\nExperience in machine learning and data mining including libraries such as TensorFlow, Scikit-learn, and XGBoost.\nExtremely strong programming skills in Python and data science libraries such as Pandas, NumPy, Seaborn, and Matplotlib.\nWorking knowledge of data structures and algorithm designs.\nWorking knowledge of machine learning models and deep learning algorithms.\nBasic understanding of statistical analysis and probability theory.\nFamiliarity with pulling data from API's and ETL processing\nKnowledge or experience in working with REST API and Web Socket to extract, manipulate, and automate data considered an asset."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}