{
  "title": "244727 - Summer 2025 Technical Co-op Opportunities with BC Hydro",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "CHECK INDIVIDUAL JOB POSTINGS\nPlease be sure to:\n\nCheck the employer's site for the actual application deadline date. It may not be the same date used in this posting.\nCheck the employer's site for the actual location of the position. It may not be in the same city as used for this posting.\nCheck the work duration of the position. Work terms may be offered for 4, 8, 12, or 16 months.\n\n\nWORK DURATION: 4, 8, 12, or 16 MONTHS (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms , and a 16-month employment period is registered as 4 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 4, 8, 12, and/or 16 months.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section \"Co-operative Education Travel Awards for Work Terms outside Victoria\"."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4, 8, 12, or 16 months"
    },
    {
      "key": "Job Title:",
      "value": "Summer 2025 Technical Co-op Opportunities with BC Hydro"
    },
    {
      "key": "Job Location:",
      "value": "Various BC Locations"
    },
    {
      "key": "Region:",
      "value": "Various"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "10"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "A workplace powered by you\n\nKeeping the lights on for over 4 million people across the province takes a lot of talented people doing many different jobs. From working deep in a generating station, atop a power pole, or behind a desk, whatever it is that makes you tick we offer challenging careers to help you reach your potential.\n\nWe're investing more than $2 billion per year in major capital infrastructure projects to help meet the growing demand for safe, reliable power. We're upgrading transmission lines, building new substations, and investing in our hydroelectric generation facilities.\n\nWe aim to provide meaningful and challenging work, opportunities for growth and a healthy work/life balance. We've been recognized for excellence and been named one of B.C.'s Top Employers and one of Canada's Best Diversity Employers for four years in a row.\n\nIt's our vision to be the most trusted, innovative utility company in North America by being smart about power in all we do\n\nPlease apply to positions directly using the links provided below:\nKeep checking back at the BC Hydro Career Opportunities Page as more positions are added."
    },
    {
      "key": "Qualifications:",
      "value": "Please see the individual links provided\n\nJob Title and Link\tLocation\tWork Type\tPositions Available\nCo-op Student - Electrical Engineering - May/Summer 2025\tVancouver, Burnaby, or Fraser Valley\tHybrid\t8\nCo-op Student - Electrical Engineering - May Summer 2025 (Victoria, BC)\tVictoria\tHybrid\t1\nCo-op Student - Mechanical Engineer - May/Summer 2025\tVancouver, Burnaby, or Fraser Valley\tHybrid\t2\nCo-op Student - Construction / Project Engineering - May Summer 2025\tBurnaby\tHybrid\t2\nCo-op Student - CADD Drafter (Mechanical, Electrical, Civil, P&C, Telecom and Municipal) - May/Summer 2025\tBurnaby\tHybrid\t4\nCo-op Student - Computer/Electrical Engineer - May/Summer 2025\tBurnaby\tHybrid\t9\nCo-op Student - IT Cybersecurity Infrastructure and Platforms - May Summer 2025\tVancouver, Burnaby, or Fraser Valley\tHybrid\t3\nCo-op Student - DevOps\tBurnaby\tHybrid\t1\nCo-op Student - IT Computer, Data and Analytics - May Summer 2025\tBurnaby\tHybrid\t1"
    },
    {
      "key": "Job Title and Link",
      "value": "Location"
    },
    {
      "key": "Co-op Student - Electrical Engineering - May/Summer 2025",
      "value": "Vancouver, Burnaby, or Fraser Valley"
    },
    {
      "key": "Co-op Student - Electrical Engineering - May Summer 2025 (Victoria, BC)",
      "value": "Victoria"
    },
    {
      "key": "Co-op Student - Mechanical Engineer - May/Summer 2025",
      "value": "Vancouver, Burnaby, or Fraser Valley"
    },
    {
      "key": "Co-op Student - Construction / Project Engineering - May Summer 2025",
      "value": "Burnaby"
    },
    {
      "key": "Co-op Student - CADD Drafter (Mechanical, Electrical, Civil, P&C, Telecom and Municipal) - May/Summer 2025",
      "value": "Burnaby"
    },
    {
      "key": "Co-op Student - Computer/Electrical Engineer - May/Summer 2025",
      "value": "Burnaby"
    },
    {
      "key": "Co-op Student - IT Cybersecurity Infrastructure and Platforms - May Summer 2025",
      "value": "Vancouver, Burnaby, or Fraser Valley"
    },
    {
      "key": "Co-op Student - DevOps",
      "value": "Burnaby"
    },
    {
      "key": "Co-op Student - IT Computer, Data and Analytics - May Summer 2025",
      "value": "Burnaby"
    },
    {
      "key": "",
      "value": ""
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}