{
  "title": "245042 - Software QA Analyst - Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Software QA Analyst - Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$20.80 - $23.92 per Hour"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Who we are:\nReliable Controls is dedicated to reducing the carbon footprint of buildings around the world. Our team specializes in the design, development, and assembly of building automation controls and software programs.\n\nWe align ourselves with the right people and empower them in the right ways. An established company based in Victoria, BC, we nurture a strong culture of communication, trust, and collaboration. Embracing a work-life balance, promoting continuous learning, and celebrating our achievements are a few of the ways we show our enduring commitment to employees. Let's combine our passions for building a greener future!\n\nYour mission:\n\nTo ensure quality is ingrained in our software products from the very start. You will work alongside our software QA department to perform various tests of our hardware and software products.\n\nWhat we offer:\n\nFree parking at both of our Victoria locations,\n\nGreen Transportation Incentive - bus, bike or walk to work and earn extra money for it!\n\nSocial Committee Events - games nights, cabin trips, bowling, camping and more,\n\n…and most importantly, a genuinely great culture fostered by the senior management team and sustained by fantastic people!\n\nWhat we hope to create:\n\nSolutions for building operators to enable the vision of Net-Zero Emissions by 2050. Help us get there.\n\nIn this role you will:\n\nExecute test plans for our hardware, and software products\n\nRecord test results and issues found using our testing and bug tracking software\n\nTroubleshoot to verify and diagnose cause of issues\n\nVerify functional requirements\n\nVerify resolved bugs\n\nYou'll have access to:\n\nAn onboarding package to get you up to speed\n\nOnline training courses\n\nA mentor"
    },
    {
      "key": "Qualifications:",
      "value": "This role might be right for you if you have/are:\n\nA Computer Science, Software or Computer Engineering degree\n\nTesting experience with embedded products and software\n\nFamiliar with test management and documentation systems (TMS)\n\nHands-on experience with electrical devices and measurement instruments\n\nFamiliarity with serial and Ethernet communication protocols\n\nExcellent general computer and IT skills;\n\nQuality-driven personality\n\nGreat attention to detail\n\nStrong desire to be part of a team that produces high-quality applications\n\nExcellent communication and interpersonal skills.\n\nYou'll be successful in this position if you:\n\nAre an enthusiastic, innovative individual who cares about sustainability\n\nLook for ways to have a meaningful impact on your team's work\n\nAre interested in using devices to control the physical environment, and you're willing to learn our products and industry\n\nLike a challenge and want to grow professionally\n\nAre patient and diligent; quality may take longer, but you know it's worth it\n\nValue a healthy work-life balance; we don't expect you to work overtime or weekends\n\nLet's connect!\n\nAt Reliable Controls it's not only experience and skills we are seeking; alignment with our values is of the utmost importance to us. Continuous improvement is vital to our organization, and we are prepared to invest in our team's future, not just their current abilities. Let's connect. We would love to hear from you!"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}