{
  "title": "245119 - Software Developer Co-op (May 2025 - Dec 2025)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "WORK DURATION: 8 MONTHS (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four.\n\nNEED HELP TO RELOCATE? If you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section \"Co-operative Education Travel Awards for Work Terms outside Victoria\"."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Software Developer Co-op (May 2025 - Dec 2025)"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$3,600 - $4,500 per month"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Visier is the leader in people analytics and we believe in a 'people-first' approach to business strategy. Our innovative technology transforms the way that organisations make decisions, allowing them to elevate their employees and drive better business outcomes. Embarking on an exciting new chapter in our growth story, we are looking for talented individuals who can help both Visier and our customers grow, evolve and win!\n\nOur co-op experience is unique and designed to prepare you for professional success as you work on real, impactful work from the beginning...not features that may be mothballed after 8 months of hard work! Our ultimate goal is to give you the mentorship, training, and work experience you need to start your career. A number of our students return to us after they graduate and start developing their professional career at Visier!\n\nAnd we use state-of-the-art technology to build our innovative full-stack software solution that helps people see the truth and drives organizations to perform their best. We use a variety of frontend technologies including Angular, NgRx, Play Framework, TypeScript, Less, and others. We deal with large volumes of data every day. And in our backend areas we work with technologies like Scala, Kafka, Consul, Cassandra DB, Docker, AWS, etc. So, you'll be developing knowledge and skills that are transferable anywhere.\n\nWhat you'll be doing..\n\nWriting production-level code that will directly impact customers\n\nImplementing cool new features\n\nFixing complex bugs\n\nCollaborating with people in all stages of the software development cycle"
    },
    {
      "key": "Qualifications:",
      "value": "What you'll bring to the table…\n\nCoding skills in relevant programming languages (for example, like Java, JavaScript, Typescript, Scala or other similar languages)\n\nCoding skills in writing functional tests (eg using Selenium and ScalaTest)\n\nKnowledge of data structures and algorithms\n\nAttention to detail, tendency to spot mistakes and identify potential improvements\n\nKnowledge of web technologies (REST, HTML/CSS, JSON, Angular) is an advantage\n\nKnowledge of relational and non-relational databases and SQL language\n\nThe base pay range for this position in Canada is $3,600 - $4,500 per month.\n\nSee the #VisierLife in action\n\nInstagram - @visierlife\n\nLinkedin - https://www.linkedin.com/company/visier-analytics/\n\nVisier Candidate Privacy Notice and Recruiter Policy"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}