{
  "title": "245051 - Energy Management Engineer, Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "4 OR 8 MONTH WORK TERM\n\nWork Duration: 4 or 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 4 and/or 8 months.\n\nNote for Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months or 8 Months"
    },
    {
      "key": "Job Title:",
      "value": "Energy Management Engineer, Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$27.50 - $30.61"
    },
    {
      "key": "Hours per Week:",
      "value": "35"
    },
    {
      "key": "Start Date:",
      "value": "05/01/2025"
    },
    {
      "key": "End Date:",
      "value": "08/29/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "ENERGY MANAGEMENT ENGINEER, CO-OP\n\n4 to 8 Months - Victoria\n\nThe Opportunity\n\nBC Ferries is seeking a candidate to support the Environmental Sustainability team to deliver the Company's Strategic Energy Management Plan (SEMP). The candidate will lead on a mutually agreed to initiative to demonstrate continuous improvement for a performance measure in the Company's energy management program. The candidate will carry out project proposal, project planning, data collection, data analysis and reporting, and strategic energy management initiatives in partnership with BC Hydro. This position mostly involves office and limited field work at the Company's shipyard, terminals and vessels. The position will be 4-8 months and will be based out of the Atrium in Victoria, BC.\n\nThe Role\n\nContribute to the Company's Strategic Energy Management Plan (SEMP). Tasks include, but are not limited, to the following:\nData analysis\nEngineering analysis and review\nEnergy audits\nPromoting energy management awareness within the Company, including written contributions and/or oral presentations\nEmployee engagement initiatives\nQuarterly reporting\nProject development and cost benefit analysis for detailed business cases\nContribute to a Company assigned project with a focus on energy management.\nDevelop and lead the project and complete the required tasks of data collection, analysis and reporting\nProject opportunities include the following:\nAdvance the development of a Standard Operating Procedure for shore side HVAC Purchasing Policy\nShore side asset replacement road map to forward the goal of 'Net Zero' terminal operations\nDevelopment of internal data analysis tools for reporting energy metrics\nSupport the Company's operational groups to conform to energy management best practices.\n\nWhat you bring to the team\n\nSuccessful candidate must be a 3rd or 4th year student at one of the BC Universities offering a co-op program\n\nAbility to work collaboratively in a team environment while exercising judgment and a high level of professionalism\nStrong work ethic and self-starter, able to effectively manage multiple priorities, and adapt to change\nExcellent written and verbal communication skills with the ability to communicate effectively and in a friendly and professional manner\nMust have a valid British Columbia Class 5 driver's license\n\nJoin us!\n\n.\"We connect communities and customers to people and places important in their lives\"\n\nAt BC Ferries, our employees are our most important assets in delivering our commitment to customer safety, service and satisfaction. We support employment equity and diversity in the workplace and we encourage applications from all qualified individuals including women, visible minorities, Indigenous Peoples, persons with disabilities, persons of diverse sexual orientation, gender identity or expression (LGBTQ2S+), and others who reflect our ever-changing workplace.\n\nWe appreciate the interest of all applicants; however only those selected for an interview will be contacted."
    },
    {
      "key": "Qualifications:",
      "value": "What you bring to the team\n\nSuccessful candidate must be a 3rd or 4th year student at one of the BC Universities offering a co-op program\n\nAbility to work collaboratively in a team environment while exercising judgment and a high level of professionalism\nStrong work ethic and self-starter, able to effectively manage multiple priorities, and adapt to change\nExcellent written and verbal communication skills with the ability to communicate effectively and in a friendly and professional manner\nMust have a valid British Columbia Class 5 driver's license"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "3"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}