{
  "title": "245331 - Quality Assurance Analyst Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Quality Assurance Analyst Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$3400.00/month"
    },
    {
      "key": "Hours per Week:",
      "value": "40"
    },
    {
      "key": "Number of Positions:",
      "value": "2"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "SUMMARY\n\nThe Quality Assurance Analyst Co-op is responsible for testing the ACD product line using Black Box testing processes. Working with other members of the Quality Assurance Department, the Co-op Software Tester will help develop test plans, test strategies and test cases, which meet the needs of the high-quality standards set at ACD Systems.\n\n\nKEY COMPETENCIES\n\nTechnical Expertise: the ability to demonstrate depth of knowledge and skill in computer science.\nInitiative: identifying what needs to be done and doing it before being asked or before the situation requires it.\nFostering Innovation: the ability to develop, sponsor, or support the introduction of new and improved method, products, procedures, or technologies.\nResults Orientation: the ability to focus on the desired result of one's own or one's unit's work, setting challenging goals, focusing effort on the goals, and meeting or exceeding them.\nOral and Written Communication: the ability to express oneself clearly in writing and conversations.\n\n\nESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned.\n\nTests software by comparing operation to documentation.\nIdentifies, analyzes, and documents defects, questionable functions, and inconsistencies in software.\nRecommends modifications and additions to features of software being tested.\nWorks with Engineering to establish and verify benchmarks for program efficiency in operating and response times.\nReviews hardware, operating systems, networking environments, and competitor software.\nIdentifies and builds applicable hardware and software test environments.\n\n\nWork Term Duration: 8-month Co-op work term\nSalary: $3400.00/month based on 40 hours/week\nLocation: 203 - 1662 McKenzie Ave, Victoria, BC"
    },
    {
      "key": "Qualifications:",
      "value": "KNOWLEDGE, SKILLS, AND ABILITIES\n\nGood technical knowledge of digital imaging software as well as hardware products.\nGood technical knowledge of PC, Mac OS, networking and operating systems.\nGood organizational skills with an ability to balance multiple priorities in a fast-paced, dynamic work environment.\nGood business communication skills in both written and verbal form.\nAbility to work effectively independently and as part of a team.\nSolid analytical and investigative skills.\nRefined problem-solving skills.\nStrong administrative skills with careful attention to detail.\n\nNOTES AND REQUIREMENTS\n\nOnly applicants who are available for the full work term (8 months) will be considered. Unfortunately, we cannot accept applicants who are only available for 4 months.\nThis is an in-person position, and applicants will be expected to work in our Tuscany Village office. Remote or hybrid work is not possible for this position.\nAt this time, we can only accept applicants who are Canadian citizens, permanent residents, or refugee status in Canada."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}