{
  "title": "244849 - Co-op Student (Engineering)",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Co-op Student (Engineering)"
    },
    {
      "key": "Job Location:",
      "value": "City of Langford"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$25.00 hr"
    },
    {
      "key": "Hours per Week:",
      "value": "35"
    },
    {
      "key": "Start Date:",
      "value": "04/14/2025"
    },
    {
      "key": "End Date:",
      "value": "07/14/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "2"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Would you like to be part of a dynamic, fast paced, award winning local government organization? A team that prides itself on providing cost effective local government services for local residents? Do you have the right attitude, qualifications, and superior people skills for the job? If so, the City of Langford invites you to apply for a Co-op position in our Engineering and Public Works department! We currently have two temporary full-time positions available.\n\nThe City of Langford Engineering & Public Works department has two openings for a 4-month work term starting approximately mid-April 2025 (exact start date is negotiable), to assist the City in our annual inspections and inventory of all City assets including but not limited to roads, sidewalks, driveways, culverts, creeks, signs, streetlights, and more. In this position you will also be responsible for researching and recording elements from as-built drawings and field notes, collecting field data with a handheld GPS unit, and downloading this information at the office to appropriate electronic filing locations.\n\nThe successful candidate must:\n\nHave an eye for detail and be proficient in MS Excel\n\nHave a valid BC Driver's license\n\nBe comfortable working outside in all weather conditions\n\nExperience in reading and interpreting engineering drawings as they relate to civil infrastructure, and with the use of GIS, AutoCAD, and GPS equipment is considered an asset.\n\nThe salary is $25.00 per hour plus 13% in lieu of benefits, and hours of work are typically Monday to Friday from 8:30 a.m. to 4:30 p.m.\n\nThere are two positions currently available to external applicants. To apply, please submit your resume and cover letter by email to careers@langford.ca (identify the position you are applying for in the subject line of your e-mail). Applications will be accepted until noon on January 22, 2025. Please do not include our school transcripts in your applications, these are not considered.\n\nWe thank all applicants for their interest, however only those selected for an interview will be contacted."
    },
    {
      "key": "Qualifications:",
      "value": "The successful candidate must:\n\nHave an eye for detail and be proficient in MS Excel\n\nHave a valid BC Driver's license\n\nBe comfortable working outside in all weather conditions\n\nExperience in reading and interpreting engineering drawings as they relate to civil infrastructure, and with the use of GIS, AutoCAD, and GPS equipment is considered an asset."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "1"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}