{
  "title": "245102 - Tier 2 Escalation and Software Developer",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Tier 2 Escalation and Software Developer"
    },
    {
      "key": "Job Location:",
      "value": "6548 Hastings Street, Burnaby, British Columbia, V5B 1S2, Canada"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, fully remote"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$22 - $24/hour"
    },
    {
      "key": "Hours per Week:",
      "value": "40"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "About Us\nIf you are interested in growing your software development skills to improve healthcare, learning fast, and holding lots of responsibility on a cross-functional team, let's chat! We are a team who are at the forefront of upgrading medical systems in measurable ways. We offer state-of-the-art software solutions paired with consulting services to ensure impactful results. Patients should be able to seamlessly meet with their family doctor online without waiting and frustration. We are looking for a student interested in gaining further software development experience through the balance of 2025, and possibly joining us longer term in future years!\n\nResponsibilities:\nYou will work on our customer success and product team, and with health professionals to improve medical clinic operations using our software products. This may involve distributed system design, managing infrastructure, troubleshooting, and debugging."
    },
    {
      "key": "Qualifications:",
      "value": "Requirements:\n? Implementation Project Management: Collaborate with cross-functional teams to guarantee client satisfaction from sale to implementation and measure the outcomes\n? Compliance & Security: Ensure alignment with IT security standards, report incidents, and participate in cybersecurity training.\n? Have excellent and engaging written English skills, to help with clarity in communications\n? Be able to work remotely\n? Be a continuous, self-motivated learner, and always push to improve the environment for yourself and your team members\n? Be able to investigate problems with experiment with troubleshooting techniques yourself, but know when to ask your team for help\n? Voice disagreements rather than keeping them to yourself. We need all opinions to be on the table to make the best decisions.\n? Be able to uncover, and focus on, what's really important in a complex environment with many distractions\nSoftware Developer\n? Web development experience\n? Experience with some Python, Django web framework, JavaScript, HTML, CSS\n? Experience with Docker and/or Linux\n? Care about code quality and system maintainability, balanced with the immediate needs of your team and users. It takes creativity, experience, and effort to balance these competing constraints.\nTier 2 escalation\n? Reproduce escalated issues and identify the root cause by reviewing error logs effectively and efficiently\n? Coordinate with team members to determine how to improve the product and process to prevent the issue from happening\n? Provide product recommendations, configurations, and technical expertise to align with healthcare infrastructure through participation in Onboarding, Business Review, and User Training\n? Client Relations: Lead projects by understanding client needs, aligning teams, and ensuring successful implementation and delivery\n\n\nAlso an asset:\nWhile not required, these skills are considered an asset.\n? Previous experience in an Agile/Scrum project environment.\n? Other DevOps experience is a bonus\n? Experience in project management or implementation consulting within a healthcare or IT sector\n? Direct experience in translating business needs into technological solutions\n? Familiarity with server/network design and its interdependencies\n? Proficiency in report writing and presentations\n? Willingness to travel for client meetings\n? PMP (Project Management Professional) and/or Scrum Certification would be advantageous"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}