{
  "title": "245420 - Multiple Positions - BASF International Internships",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NOTE:\n\nThis is an international co-op work term. It is your responsibility to ensure that you are legally entitled to work in the work term country, and to make the necessary travel and housing arrangements for the work term. Unless the posting indicates otherwise, you are responsible for arranging for and covering the costs of travel, housing, and insurance.\n\nPlease note: before applying for an international co-op opportunity, you are strongly advised to meet with the International Co-op and Career Coordinator, Sarah McQuillan. You can book a meeting with Sarah through the portal (under the 'International Opportunities' tab) or email Sarah at intlcoopcoord@uvic.ca.\n\nIF YOU SECURE AN INTERNATIONAL WORK TERM:\n\nOnce you secure an international co-op work term, you'll be required to complete this pre-departure checklist, which includes:\n\nTravel insurance coverage\n\nEmergency preparation\n\nYou'll also need to visit the Global Affairs Canada website to learn more about your destination and related travel advisories. Please contact Sarah McQuillan, the UVic Co-op & Career International Coordinator, for additional information or questions.\n\nBe sure to confirm your start and end dates with your employer. Do not book your flights until your dates have been confirmed and you have received your visa and/or work permit.\n\nFUNDING:\n\nYou are strongly encouraged to explore funding opportunities that could subsidize your international work term costs. The following are examples of funding opportunities available to students, depending on travel region, employer type, and other eligibility criteria. Please use the links below to learn more and determine if you qualify:\n\nGraham Branton Co-op Endowment Fund: Students who are registered for an international co-op work term are eligible for up to $1,000 in funding to support the placement.\n\nPresident's Asia Partners Fund: If you are undertaking a co-op work term or internship in the Asia-Pacific region, you can apply for up to $3,125 in funding."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Multiple Positions - BASF International Internships"
    },
    {
      "key": "Job Location:",
      "value": "Various Locations"
    },
    {
      "key": "Region:",
      "value": "N/A"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Hours per Week:",
      "value": "Full Time"
    },
    {
      "key": "Number of Positions:",
      "value": "15"
    },
    {
      "key": "Work Abroad:",
      "value": "Yes"
    },
    {
      "key": "Job Description:",
      "value": "Organization Overview\n\nWe combine economic success with environmental protection and social responsibility. Around 112,000 employees in the BASF Group contribute to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio comprises six segments: Chemicals, Materials, Industrial Solutions, Surface Technologies, Nutrition & Care and Agricultural Solutions.\n\nPlease note that postings that do not list an application deadline can close at any time, so please apply early. Application instructions for each position are listed on the Disney Internship job board.\n\n**Please be sure to click \"I intend to apply for this position\" after you have sent your application to the employer. This will allow you to maintain access to the posting after it closes and to track the status of the recruitment process.\n\nJob Opportunities\n\nFor a full list of internship opportunities, please visit the BASF job board. There are various locations across the world that you can apply for, such as Berlin, Rome, Shanghai, Lethbridge, Freeport, and more.\n\nOpportunities can be filtered by location, type, duration, etc. New opportunities are added to the Disney Internship board daily, so please check back often!\n\nExamples of opportunities include:\n\nInternship - Supply Chain\n\nInternship HR Global Travel Management\n\nLab Intern\n\n2025 Summer Internship - Electrical Engineering"
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications vary by position. Please be sure to check the postings for specifics"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}