{
  "title": "245130 - Co-op Data Analyst",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Co-op Data Analyst"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "we are seeking a CO-OP DATA ANALYST\n\nWE BUILD SOLUTIONS THAT HELP SAVE LIVES\n\nZetron, a Codan company, is a trusted provider of communication products and solutions that help our customers protect, inform, and save lives. Whether they are conducting a search and rescue, containing a fire, maintaining safety, or providing security at a profile event, Zetron makes sure the customer can be heard over the mountain, throughout the city, or across the globe. We invite you to join our mission at our Canadian Head Office located near beautiful downtown Victoria in the newly restored Press Building with modern office space built for collaboration!\n\nABOUT THE ROLE:\n\nThis is a minimum 4-month co-op based in Victoria, BC, with the strong likelihood for extension to 8 months.\n\nAt Zetron, we hire co-op students not only because we want to invest in you, but also because it is an investment in our business. Did you know that 40% of our Engineering staff are UVic alumni?\n\nWe are recruiting for a Data Analyst (Co-op) to help us improve tools for managing and reporting on the delivery of critical communication solutions to our customers, as well as the work of our product development teams.\n\nAs a member of Zetron, you will work as part of a team. You will have the opportunity to work with colleagues across the business, from Project Management, Systems Delivery, Finance, Engineering, IT, Sales and more. Your work will support teams located around the world in our Canadian, US, UK and Australian offices. Throughout the course of your co-op term, you will:\n\nLearn elements of Zetron's project management, systems delivery, and product development processes.\nWork with members of Zetron's global team to synthesize existing processes and artifacts into data models.\nBuild tools for data entry, data aggregation, and automated model-driven reporting.\nDevelop documentation and training materials to ensure the tools you build can be maintained in the future."
    },
    {
      "key": "Qualifications:",
      "value": "ABOUT YOU:\n\nWe are looking for an ambitious individual, excited to engage with people and learn new things. You will:\n\nHave a strong knowledge of automation, data modelling and reporting in an Office 365 environment.\nHave experience building data modelling and presentation solutions with Power Query, Power BI or similar tools.\nUse strong written and verbal communication and collaboration skills.\nLove to help others derive insights from complex data sets.\nHave proven organizational, time management and prioritizing skills.\nBe eager to learn, grow, and be challenged.\nGet bonus points for having a working knowledge of Project Management, Business Administration, or Accounting.\n\nPlease apply with a resume, cover letter, and transcript by e-mailing Jennifer.Beasley@zetron.com, and make sure not to include links, plain text is fine, to any websites when sending in your application. Only successful applicants will be contacted for interviews. Thank you!"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}