{
  "title": "245370 - Java Software Engineer",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "This position is located in Victoria, but remote/hybrid work may take place.\n\n\nWork Duration: 4 or 8 months but 8 months preferred (An 8 month employment period is registered as 2 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 4 and/or 8 months.\n\nNote for Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months or 8 Months, but 8 Months Preferred"
    },
    {
      "key": "Job Title:",
      "value": "Java Software Engineer"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "No"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$20 to $25 per hour"
    },
    {
      "key": "Hours per Week:",
      "value": "40"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "The Company:\nAt impact.com our culture is our soul. We are passionate about our people, our technology, and obsessed with customer success. Working together enables us to grow rapidly, win, and serve the largest brands in the world. We use cutting edge technology to solve real-world problems for our clients and continue to pull ahead of the pack as the leading SaaS platform for businesses to automate their partnerships and grow their revenue like never before. We have an entrepreneurial spirit and a culture where ambition and curiosity is rewarded. If you are looking to join a team where your opinion is valued, your contributions are noticed, and enjoy working with fun and talented people from all over the world, then this is the place for you\nimpact.com, the world's leading partnership management platform, is transforming the way businesses manage and optimize all types of partnerships-including traditional rewards affiliates, influencers, commerce content publishers, B2B, and more. The company's powerful, purpose-built platform makes it easy for businesses to create, manage, and scale an ecosystem of partnerships with the brands and communities that customers trust to make purchases, get information, and entertain themselves at home, at work, or on the go. To learn more about how impact.com's technology platform and partnerships marketplace is driving revenue growth for global enterprise brands such as Walmart, Uber, Shopify, Lenovo, L'Oréal, Fanatics and Levi's, visit www.impact.com.\n\nWhat you will be doing:\nAs a Software Engineer at impact.com, you will create and support features on our platform which are used by many of the world's top brands to grow their businesses. You will become proficient in the latest in Spring, Temporal, Unit Testing, and TDD while mastering our platform and code base."
    },
    {
      "key": "Qualifications:",
      "value": "Required Skills and Experience:\n\nCompleted 2nd year\nDetail oriented. You'll ship to production,\nProgramming experience. Ideally work experience, but open source side projects can be better experience in our standards.\nExcellent communication and teamwork skills.\n\n\nNice to Have Skills and Experience:\n\nJava\nSpring, Spring Boot\nSQL, MySQL, or another RDBMS\nREST API\nJDBC\nShell commands\nClient-side debugging (Chrome / Firefox devtools)\nGit and Github"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "1"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}