{
  "title": "244858 - Network Analyst Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "WORK DURATION: 8 MONTHS (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four.\n\nNEED HELP TO RELOCATE? If you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section \"Co-operative Education Travel Awards for Work Terms outside Victoria\"."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Network Analyst Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$3900 - $4900 / Month"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "For this exciting position, we are specifically targeting students who have a background in Business or Computer Science with a knowledge of business analysis applied to applications. This outstanding individual will have the opportunity to learn and gain hands-on experience eliciting and analyzing requirements, documenting business processes, supporting project coordination, and much more! Depending on the needs and location of the team, you will need to work PDT or MDT or relocate to a specific office (site-based). You must also currently be a student enrolled in a Canadian post-secondary institution and will be enrolled throughout the duration of the co-op term (you will also be returning back to the post-secondary institution once the co-op term is completed). Proof of a valid work permit will also be required, if applicable.\n\nDon't miss out on this exciting opportunity to be part of one of Canada's leading mining companies and join our team!\n\nWhy consider Teck Resources Limited for your Co-op Placement?\n\nAt Teck, we offer more than just a job - we provide a comprehensive student experience comprised of relevant, hands-on work, vibrant social activities, extensive networking opportunities, and rich professional development. With captivating projects set against stunning backdrops, a culture of inclusivity and collaboration, and boundless opportunities to learn, grow, and have fun, joining us means embracing a fulfilling and dynamic co-op adventure.\n\nIn addition to excellent compensation, Teck co-ops receive a variety of advantages including but not limited to:\n\nFinancial assistance to help with travel costs and co-op fees\nOpportunity to develop technical skills and gain practical experience while applying academic knowledge to real-world mining operations and projects\nEnjoy mentorship and guidance from experienced specialists in their respective fields\nReceive primary consideration for professional positions upon graduation\n\nHeadquartered in Vancouver, British Columbia, Teck Resources Limited is one of Canada's leading mining companies committed to innovation and continuous improvement, while ensuring everyone goes home safe and healthy every day. We work with a sense of personal responsibility and genuine care for the people, communities and lands which we are entrusted. We all share a strong sense of purpose at Teck, and each day we are guided by our values in how we operate and conduct ourselves.\n\nLocated in the heart of Downtown, Vancouver, and nestled between the mountains and Pacific Ocean, you will find globally-inspired cuisines and world famous natural wonders in one of Canada's most culturally diverse cities. Don't miss out on this opportunity to work (and adventure) in one of the most sustainable cities in the world!\n\nSalary Range: $3900 - $4900 / Month\n\nSalary is commensurate with the number of academic semesters and prior co-op experiences completed.\n\nResponsibilities\n\nBe a courageous safety leader, adhere to and sponsor safety and environmental rules and procedures\nUtilize network monitoring tools to conduct basic network equipment configuration\nAssist with wireless survey\nOversee ticketing log watch and assignment\nAssist the team in project execution on site\nCreate automated KPI reports from monitoring tool applications\nOpportunity for site engagement one to three days per week\nEngage with technology such as LTE, 5G, Wi-Fi 6, DWDM and other new technologies"
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications\n\nCurrently enrolled in Network/ Computer Science / Computer/Electrical Engineering or a related field\nAwareness of Cisco networking fundamentals\nAble to integrate with the team and driven to learn\nGood interpersonal skills, with the ability to efficiently connect with diverse team members\nAbility to learn and utilize various tools\nCapacity to work efficiently independently as well as part of the team\nProven ability to learn innovative technologies and platforms quickly, accurately, and efficiently\nAbility to communicate with precision in a technical environment\nAble to articulate complex concepts clearly and in a way a diverse audience would understand\nBasic knowledge of coding language (server admin, SQL, python, Power BI) is an asset\nFamiliarity with Cisco CCNA, CCNP is an asset\nThe ability to speak Spanish is an asset\n\nAbout Teck\n\nTeck is a leading Canadian resource company focused on responsibly providing the metals essential for global development and the energy transition while caring for the people, communities and land that we love.\n\nTeck's two regional business units, North America and Latin America, are responsible for Teck's assets through all phases of safe, sustainable development, operation and closure. The business units are supported by enterprise-wide functions that set strategic direction, establish standards and provide governance, as well as supporting the business through shared services, centres of excellence and business partnering.\n\nJoin Teck, a leader in the mining industry, where we hire over 150 students each year across our operations. Our commitment to fostering young talent has earned us recognition as one of Canada's Top Employers for Young People and as one of Canada's Top 100 Employers. We are also proud to be named one of the Global 100 Most Sustainable Corporations by Corporate Knights. At Teck, you'll gain valuable experience, contribute to meaningful projects, and be part of a company dedicated to sustainability and innovation. Start your career journey with us!"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}