{
  "title": "245211 - Bioinformatics BioApplications Co-op Position",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Please note all jobs at the GSC are based onsite in Vancouver, British Columbia, Canada. Flexible work options may be available for this position (currently at 3 days per week onsite) upon request and is subject to change in accordance with GSC's operational needs and PHSA's Flexible Work Options Policy.\n\n\nLOCATION IS NOT IN VICTORIA\n\nRELOCATION REQUIRED - Please address your ability to relocate in your application. Do not apply unless you can move for this job.\nMOVING COSTS - You can apply to the SF-ELF travel fund to help offset moving costs: https://www.uvic.ca/coop/work-and-learn/what-is-co-op/funding/index.php#ipn-co-op-funding-opportunities"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months or 8 Months"
    },
    {
      "key": "Job Title:",
      "value": "Bioinformatics BioApplications Co-op Position"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Yes"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$19.14 per hour or $2,110.25 monthly plus 8.6% in lieu of benefits"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Canada's Michael Smith Genome Sciences Centre at BC Cancer\n\nBioinformatics BioApplications Co-op Position\n\nThe Genome Sciences Centre (GSC) is a leading international organization for genomics and bioinformatics research. Our mandate is to advance knowledge in those areas, and to realize the social and economic benefits of genomics research. The BioApps group at the GSC is looking for co-op students to join us in this endeavor to help develop some new features to aid in bioinformatics tracking. This position will include web application development as well as database development.\n\nPrior experience in a bioinformatics setting is an asset, but not required.\nThe position is available for a 4-month term with the possibility of extension to 8 months.\n\nWork Term: May 5, 2025 to December 31, 2025\n\nSalary: $19.14 per hour or $2,110.25 monthly plus 8.6% in lieu of benefits\n\nWork Hours: 37.5 hours per week\n\nWork Location: Echelon site, 570 West 7th Ave., Vancouver, BC V5Z 4S6\n\nSupervisor: Tina Wong - Assistant Bioinformatics Coordinator\n\nTeam: BioApplications Team\n\nConditions: Applicant must have a valid work permit.\n\nEDI Statement: We believe that equity, diversity and inclusivity are essential for the advancement of human knowledge and science."
    },
    {
      "key": "Qualifications:",
      "value": "We are looking for:\n\nProgramming experience with Python\nExperience in a Linux environment\nExperience with web or API development\nExperience with MySQL or Postgres would be an asset\nKnowledge of database queries and design\nKnowledge of metadata tracking in the database and file system\nKnowledge of biology (genome, DNA, RNA, central dogma of molecular biology)\nStrong verbal communication skills and willingness to work in a team\nAbility to think critically and troubleshoot complex problems\nEnthusiasm for designing user interfaces and visual displays\n\nPrior experience in a bioinformatics setting is an asset, but not required.\n\nConditions: Applicant must have a valid work permit.\n\nEDI Statement: We believe that equity, diversity and inclusivity are essential for the advancement of human knowledge and science.\n\nPlease note all jobs at the GSC are based onsite in Vancouver, British Columbia, Canada. Flexible work options may be available for this position (currently at 3 days per week onsite) upon request and is subject to change in accordance with GSC's operational needs and PHSA's Flexible Work Options Policy.\nWe welcome all applicants and provide all employees with equal opportunity for advancement, regardless of race, colour, ancestry, place of origin, political belief, religion, marital status, family status, physical or mental disability, sex, sexual orientation, gender identity or expression, age, conviction of a criminal or summary conviction offence unrelated to their employment."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}