{
  "title": "245107 - Software Engineering Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Software Engineering Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$21.63 - $28.85 per Hour"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Do you have a passion for fostering innovation and sustainability in glass technology? If so, we want to hear from you!\n\nMiru is a clean-technology start-up of 50+ employees developing electrochromic windows to reduce greenhouse emissions, increase sustainability and improve energy efficiency. Miru operates a state-of-the-art pilot production facility in Vancouver and is in the midst of constructing a demonstration plant to scale up production of our electrochromic window technology for our architectural and automotive clients. We focus on technical excellence and delivering a high-quality product.\n\nOur eight-month Software Engineering Co-op opportunity has a focus on contributing to the development of backend data infrastructure and proprietary software tools that helps scientists to visualize and access essential data for groundbreaking research. Your work will fuel cutting-edge research and contribute to groundbreaking solutions.\n\nWe believe diversity drives innovation which guides our values and success which is why we hire enthusiastic students and technologists based on their aptitude for the job, not just their background. Experience in software development along with UX/UI design or backend systems is preferred, but if you feel you are a strong candidate for this position for other reasons, you will also be considered.\n\nThis work term is ideal for a curious individual who is a problem solver that can work proactively. We value innovative thinking, a strong sense of teamwork and individuals who are self-starters, demonstrate close attention to detail, and an ability to work independently within a strict deadline schedule.\n\nKEY RESPONSIBILITIES:\n\nAs a co-op student at Miru, you will work directly with more senior staff on a variety of projects. Tasks and responsibilities for this role may include:\nDeveloping a Lab Information Management System (LIMS) to support the collection and management of scientific data.\nCreating backend infrastructure to automate data collection, processing, and storage workflows.\nCollaborating with scientists to gather and translate user requirements into effective data processing functions.\nReviewing and maintaining code, debugging issues and implementing new features to improve system functionality.\nWriting clean, efficient, and maintainable code that adheres to industry best practices.\nManaging tasks independently using tools like Jira, and document technical processes to ensure clarity and consistency."
    },
    {
      "key": "Qualifications:",
      "value": "REQUIREMENTS:\n\nGood familiarity with Python, JavaScript, or similar;\nFamiliarity with Git, Linux, Pandas, and databases is preferred;\nBackend development, data modelling, data systems design skills preferred;\nUI/UX design experience, and/or experience interacting with users preferred;\nBasic understanding of the software development lifecycle;\nExceptional organization, cross-discipline collaboration, and communication skills (both written and verbal);\nAbility to learn new skills such as scripting languages and scientific terminology\n\nCAREER DEVELOPMENT AND TRAINING:\n\nOur goal is to cultivate the next generation of leading scientists and engineers in the electrochromic field. We provide unique learning opportunities that will allow you to:\nGain practical experience in developing and contributing to data systems, learning how to manage and visualize scientific data for research purposes.\nDesign and implement backend systems that automate data collection, processing, and storage, honing their skills in backend development and infrastructure design.\nDevelop a deeper understanding of how to design software solutions that meet the needs of non-technical users.\nRefine your programming skills by reviewing and maintaining code, debugging issues, and implementing new features in a collaborative development environment.\nLearn industry best practices for writing clean, efficient, and maintainable code, and how to ensure software quality through testing and documentation.\nImprove your ability to work independently, manage your tasks using time-management software (such as Jira), and deliver results while meeting deadlines, developing valuable project management skills in an agile environment.\nDevelop a high proficiency in Google Workspace ; and\nAcquire experience in a sector dedicated to sustainability, energy efficiency, and smart building solutions.\n\nPerks and Benefits: Aside from all of the learning opportunities listed above, here are a few other great reasons to join us for your work term:\n\nCasual dress\nSocial and wellness activities such as rooftop BBQs and curling\nPersonal days together with sick and vacation days\nGreat location! Easy access to transit, close to seawall, loads of wonderful coffee shops, breweries, restaurants and ice cream/gelato spots within easy walking distance\nAmple bike parking within our facility"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}