{
  "title": "245534 - Coordinator, Construction Services (Student)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Applicants must be able to obtain `Reliability' security clearance status:\n\nTypically to be eligible for a \"Reliability\" clearance, you must have resided in Canada for the last five (5) years.\nThe process usually involves reference inquiries, verification of qualifications, criminal record checks, credit checks (as required) and may require digital fingerprints. For more information about obtaining a security clearance, please visit: http://www.tbs-sct.gc.ca/pol/doc-eng.aspx?id=28115"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Coordinator, Construction Services (Student)"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$20.29 - $27.37"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Defence Construction Canada (DCC) delivers contracting, contract management, environmental and other services in support of the defence of Canada. DCC procures and manages construction, environmental and other infrastructure projects for the Department of National Defence (DND) and Canadian Armed Forces (CAF), including building and maintaining airports, shipyards, medical clinics, specialty warehousing, schools, offices, roads, utilities and laboratories. DCC has openings across Canada for co-op students in engineering, architecture, construction, and applied science programs. Working with DCC is an opportunity to gain experience in a wide range of fields, including construction, environmental sciences, procurement, project management and facilities management.\n\nCo-op students work with a team at a DCC site office that provides high-quality, timely, efficient and effective services to support the long-term development and management of DND/CAF infrastructure. Successful candidates work in a support role for more senior DCC employees, with the following duties and responsibilities, as required:\n\nMonitoring tasks related to the inspection and control of materials, and the quality of contracts completed, and reporting deviations\nMonitoring site safety and applying occupational health and safety principles\nChecking compliance with contractual requirements and reporting deviations\nMaintaining records, schedules and documents, and preparing standard reports\nSupporting various projects from housing renovations to complex renovation contracts, minor and major new construction projects\nSupporting various administrative and procurement tasks\nParticipating in the tendering phases of construction contracts by reviewing plans and specifications for bid-ability and build ability\nCoordinating the input of third-party contributors to contracts (e.g. soil testing, drillers, consultants)\nProviding drafting support"
    },
    {
      "key": "Qualifications:",
      "value": "Program of Study: Currently enrolled in engineering, architecture, applied science, or environmental studies, or related program at an accredited college (CEGEP) or university.\n\nTechnical skills/Experience in field:\nTechnical and applied knowledge related to infrastructure design, environment, civil engineering construction and consultant operations (facility maintenance, facilities management, construction contract management, design management)\n\nStrong communication and interpersonal skills, with solid writing skills\nProficiency in computer software programs\nGood judgement, positive attitude and flexible nature\nAttention to detail\nField experience in construction a definite asset\n\nValid Driver's BC Licence:\n\nSuccessful candidates must maintain a valid driver's licence and have access to a vehicle for carrying out their duties over the course of their employment with DCC."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}