{
  "title": "245516 - IT Service Desk, Tier 1",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria\n\n\n8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "IT Service Desk, Tier 1"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Yes"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$20/hr"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5hrs/week"
    },
    {
      "key": "Start Date:",
      "value": "05/01/2025"
    },
    {
      "key": "End Date:",
      "value": "12/24/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Key Accountabilities:\n\nOrganizes IT Service Desk incident inquiries by creating, updating, and closing request tickets.\nPerforms preliminary prioritization of incidents and requests.\nActs as a primary point of contact for end-users to assist with the resolution of network, hardware, software, and other IT-related problems, as well to provide information which end-users are authorized to receive.\nActs as a primary point of contact for Tier 2 and Tier 3 support technicians when they request additional information from end-users for troubleshooting.\nProvides technical support by guiding end-users through troubleshooting and correction actions via email and telephone and/or performing such actions via remote assistance/control tools or in person as required.\nResponds to automated system, network and other events to proactively resolve incidents within their scope of responsibility and/or escalate them to Tier 2 and Tier 3 technicians.\nInstalls, configures, modifies, repairs and tests computer hardware such as workstations, printers, telephones and other peripheral equipment.\nLiaises with hardware and software vendors to communicate incidents and perform actions as per their recommendations.\nPerforms preventative maintenance of end-user computer equipment and software.\nInstalls, tests, upgrades, and updates software, OS, and hardware.\nEscalates unresolved incidents to Tier 2 technicians.\nParticipates in the development of technical support procedures within their scope of responsibility and improves the overall quality of service by providing feedback to IT management personnel.\nParticipates in other IT projects by providing input and recommendations from the perspective of the IT Service desk.\nPerforms other duties as assigned."
    },
    {
      "key": "Qualifications:",
      "value": "Knowledge of technical skills, including experience with networking, hardware, and software systems\nGood communication skills (written/verbal) in English\nProblem-solving and decision-making skills\nAbility to manage multiple priorities and meet deadlines\nAbility to work effectively in a team environment and individually\nAttention to detail in following documentation, including Technician Training/Service Manuals"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}