{
  "title": "244755 - Mining Systems Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Work Duration: 8 or 12 months (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 8 and/or 12 months.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 or 12 Months"
    },
    {
      "key": "Job Title:",
      "value": "Mining Systems Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Calgary"
    },
    {
      "key": "Region:",
      "value": "AB-Calgary"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Elk Valley Resources (EVR) operates four steelmaking coal mines that employ over 5,000 people in the Elk Valley of British Columbia. We are committed to responsible resource development, environmental performance and building strong partnerships with communities and Indigenous Peoples.\n\nEVR is proud to be part of the Glencore Group, joining a portfolio of operations around the world and a history that dates back more than 100 years in Canada.\n\nStart Date: May 2025\n\nDuration: 8 or 12 months\n\nWhat we offer:\n\nAt EVR, we're dedicated to supporting our workforce on their unique career journeys.\n\nEVR recognizes our employees' skills, competencies, and performance and offers opportunities with competitive compensation and benefits. We also aim to promote employee health and wellness and provide opportunities for professional development.\n\nWe believe in the power of diversity and strive each day to create a workplace where each individual is valued and respected for their contributions.\n\nWe also believe that our employees are the reason we are accomplishing great things and are committed to supporting them through our many different programs.\n\nJoin us in the breathtaking Elk Valley of British Columbia. Here you will find outdoor adventure at your fingertips. Whether it's biking and skiing, or the laid-back atmosphere of fishing and hiking, there is something for everyone! Come experience what work life balance is all about!\n\nIn this role, you will:\n\nParticipate in and adhere to health and safety programs and policies\nBe responsible for Hardware and software development and troubleshooting\nDevelop reports and Key Performance Indicators in data analytic tools such as PowerBI\nParticipate in proof of concepts deploying new and innovative software\nParticipate in Regular Mine Site visits to troubleshoot systems, install systems and coordinate activities\nCreate and evaluate innovative ideas and technologies to help improve the way we do business"
    },
    {
      "key": "Qualifications:",
      "value": "Requirements:\n\nWorking towards an Undergraduate degree in Electrical Engineering, Computer Engineering, Computer Sciences or related fields\nInterested and willing to get experience in an industrial environment\nComfortable working in a multifaceted work environment\nMotivated self-starter with the ability to manage numerous projects simultaneously\nStrong written, verbal and interpersonal communication skills with a capability to communicate technical ideas to all levels\nPrevious experience in Database SQL, Networking or IT networking knowledge is an asset\nBasic knowledge with C# and .Net, Python\nCisco or Microsoft Certification would be beneficial\nProven ability to learn new technologies and platforms quickly, accurately, and efficiently\nAble to articulate sophisticated concepts clearly and in a way a diverse audience would understand\n\nBenefits:\n\nReceive financial assistance for travel expenses and co-op fees\nAcquire hands-on experience applying academic knowledge to real-world mining operations, fostering the development of technical skills\nBenefit from mentorship and guidance offered by seasoned specialists in their respective fields\nGain a competitive edge, securing primary consideration for professional positions upon graduation\n\n$3,942 - $5,883 a month\n\nSalary is commensurate with the number of academic semesters and prior co-op experiences completed.\n\nApplication Deadline: January 31, 2025\n\nTo all applicants, your interest and effort are sincerely appreciated. While we thank everyone for their application, only those selected for an interview will be contacted. Successful candidates must be willing to satisfy the pre-employment requirements of a pre-employment drug screen and references.\n\nAbout EVR\n\nEVR is a Canadian steelmaking coal producer. We take our responsibilities to our people, to society and to the environment seriously. The high-quality steelmaking coal EVR produces is an essential input for steel that can be used for constructing products such as wind turbines and critical infrastructure including rail, bridges, hospitals and schools."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}