{
  "title": "244981 - JR101533 - Theoretical Nuclear Physics Student Research Assistant (On-site)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "***Apply to the online website and be sure to click 'I intend to apply' in LIM so that you can maintain access to the posting.***\n\nEMPLOYER MAY USE ATS - Please run your application through VMOCK before you apply\nAPPLY DIRECT - Click \"I intend to apply\" to save the job description\nRELOCATION REQUIRED - Please address your ability to relocate in your application. Do not apply unless you can move for this job.\nMOVING COSTS - You can apply to the SF-ELF travel fund to help offset moving costs: https://www.uvic.ca/coopandcareer/co-op/funding/index.php#acc-co-operative-education-travel-award\n\nSalary is commensurate with academic progress and previous relevant work experience, and ranges from $2642 to $4051 per month including 4% vacation pay. TRIUMF offers help with travel costs for students outside the Vancouver and surrounding area."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "JR101533 - Theoretical Nuclear Physics Student Research Assistant (On-site)"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$2642 to $4051 per month including 4% vacation pay"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Discover TRIUMF, Canada's particle accelerator centre, and one of the world's leading laboratories for particle and nuclear physics and accelerator-based science. TRIUMF's diverse community of nearly 600 multidisciplinary researchers, engineers, technicians, tradespeople, staff, and students create a unique incubator for Canadian excellence, as well as a portal to premier global collaborations. Fueling innovation and improving lives, we are committed to accelerating discovery and shaping a better world.\n\nEquity, diversity, and inclusion are integral to excellence and enhance our ability to create knowledge and opportunity for all. Together, we are committed to building an inclusive culture that encourages, supports, and celebrates the voices of our employees, students, partners, and the people and communities we serve.\n\nTRIUMF's student program typically hires ~40 students each term from across all disciplines who hang together socially and professionally during the term, and beyond. Our program offers young minds a chance to gather, learn, make new friends, and have fun doing so during their time at TRIUMF. We hold weekly ProD sessions for students which include different activities such as conflict resolution, emotional intelligence, critical thinking, and active listening. Additionally, we hold weekly seminars about the different experiments at TRIUMF, and these talks specifically cater to students. Located on the UBC campus makes it easier for students to make friends, create memories, and explore Vancouver all while working at TRIUMF.\n\nTRIUMF's student program is more than just a place to work, its learning, memories, friendships, exploration, and development all clubbed into one.\n\nCome join us to see how we are working to unlock the mysteries of the universe and shape the future. Apply now and be part of our extraordinary journey.\n\nLearn more about the amazing research and work we do at TRIUMF.\n\nhttps://www.discoverourlab.triumf.ca\n\nhttp://www.rarestdrug.com\n\nAb initio calculations of structure and reactions of light nuclei\n\nThe goal of this project is to develop a predictive ab initio theory of nuclear structure and nuclear reactions for light nuclei. Such a theory is needed for understanding of nuclear reactions important for astrophysics, for tests of fundamental symmetries involving atomic nuclei, for understanding of fusion reactions important for the future energy generation, as well as for understanding of exotic nuclei investigated at rare isotope facilities like ISAC at TRIUMF.\n\nStudent's work will focus on testing of modern nucleon-nucleon forces in calculations of electromagnetic and weak transitions, energy levels, phase shifts and other observables in light atomic nuclei.\n\nDuties:\n\nThe student will learn computational techniques applied in theoretical nuclear physics and perform calculations using existing codes on parallel computers. They will also develop, implement and test additional features to supplement and generalize existing codes.\n\nSkills Learned During This Work Experience:\n\nMicroscopic nuclear theory and its link to the underlying quantum chromodynamics. Parallel programming in Fortran90, MPI, OpenMP."
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications:\n\nKnowledge of quantum mechanics. Computer programming in Python and a high-level language.\n\nSkills required:\n\nAb Initio Calculations, Nuclear Physics, Parallel Computing, Python (Programming Language), Quantum Mechanics\n\nTRIUMF is an equal opportunity employer committed to diversity in the workplace, and we welcome applications from all qualified undergraduate students as defined below:\n\nCanadian undergraduate students or Canadian Permanent Resident undergraduate students enrolled in an accredited post secondary institution in Canada (or outside Canada) who are studying in a vocational or professional training program that leads to a degree, diploma or certificate.\nForeign full-time undergraduate students currently enrolled at a designated learning institution at the post-secondary level, and who are studying in an academic, vocational or professional training program that leads to a degree, diploma or certificate that is at least six months in duration, and who have a valid Canadian study permit which allows for employment off-campus, and who have applied for a Social Insurance Number\nForeign undergraduate students enrolled in a recognized undergraduate program of study abroad who have accepted, or are in the process of accepting, an \"Invitation to Apply\" for a work permit under the International Experience Canada (IEC) program http://www.canada.ca/en/immigration-refugees-citizenship/services/work-canada/iec/apply-work-permit.html."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}