{
  "title": "245473 - Junior Unreal Engine Developer - DigiBC Work Placement",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Restrictions to Eligibility (DigiBC):\nThis position is part of DigiBC's Work Placement Pilot Program, which supports post-secondary students by providing experiential learning opportunities in animation, video, games, visual effects, and XR. As a part of this program, participating students will benefit from customized orientation workshops, e-learning resources, mentoring support, and the opportunity to start building their own professional network in the creative technology industry. This position is open to students who are Canadian Citizens, Permanent Residents, or Protected Person as defined by the Immigration and Refugee Protection Act.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Junior Unreal Engine Developer - DigiBC Work Placement"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$30/hr"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Company Overview:\n\nAt A Shell In The Pit, we're on a mission to create good jobs working on great experiences. While we are known for our audio work on 60+ titles including Pacific Drive, Untitled Goose Game, Five Nights at Freddy's and many more, we are also seeking assistance for our flagship title, Fish Game, the most comprehensive home aquarium simulator ever made.\n\nPosition Overview:\n\nWe are looking for a proactive and eager-to-learn Junior Unreal Engine Developer Co-Op to support our team in experimental systems development in our game Fish Game. This is an exciting opportunity for students who want to gain hands-on experience within the Unreal Engine 4 on a well-reviewed game that is already on the market.\n\nKey Responsibilities:\n\nCollaborate with the current team to revise existing systems, ideally converting blueprints to native C++ systems for improved optimization\nAssist in the creation and execution of test plans and test cases for the game\nPerform manual testing to identify and report bugs and issues to ensure a smooth gameplay experience including bug tracking\nWrite clean, efficient and well-documented code\nParticipate in reviews, feedback sessions, and contribute ideas to improve testing processes and workflows"
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications:\n\nCurrently enrolled in a Computer Science, Software Engineering, Game Development or a related program\nComfortable writing C++\nExperience/knowledge of developing in Unreal Engine 4\nExperience in QA and/or the ability to thoroughly check one's own work\nProficient in using GitHub for version control and collaboration\nAbility to think critically and work through issues with both users and software functionality\nComfortable collaborating with other developers, designers, and stakeholders in a team-oriented environment\nAbility to document work clearly and communicate effectively with both technical and non-technical team members\n\nNice to Have:\n\nEnthusiasm for biology, especially fish\nExperience keeping aquariums\n\nHow to Apply:\n\nPlease submit your resume and a portfolio consisting of examples of your work and/or codebases relevant to the role. If you have any GitHub links, or personal projects that demonstrate your skills, feel free to include them! Applications without portfolios will not be considered.\n\nThis position is part of DigiBC's Work Placement Pilot Program, which supports post-secondary students by providing experiential learning opportunities in animation, video, games, visual effects, and XR. As a part of this program, participating students will benefit from customized orientation workshops, e-learning resources, mentoring support, and the opportunity to start building their own professional network in the creative technology industry. This position is open to students who are Canadian Citizens, Permanent Residents, or Protected Person as defined by the Immigration and Refugee Protection Act."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}