{
  "title": "245017 - Data Governance Analyst Co-op/Intern (Summer & Fall 2025)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Data Governance Analyst Co-op/Intern (Summer & Fall 2025)"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Converge your business, analytics, data, and technical skills to make a difference and build your career. The British Columbia Investment Management Corporation (BCI) is currently seeking a co-op student/intern to support projects and initiatives being implemented as part of our Data and Analytics strategy for the Summer and Fall 2025 work terms (May to December).\n\nWHAT YOU NEED TO KNOW\n\nBCI manages a globally diversified portfolio of assets valued at $250.4 billion and is one of Canada's largest institutional investors. We invest globally to support pension and other funds for more than 30 clients based in British Columbia. We are proud to have been chosen as one of Canada's Top 100 Employers and BC's Top Employers. These national and provincial competitions recognize employers who offer exceptional workplaces for their employees.\n\nThe co-op/intern will work within our Corporate Data & Operations department as part of the Data and Analytics team. This is a great opportunity for you to learn and apply your knowledge to support the implementation of strategy, projects, and services to the corporation. As part of your work, you will help to support change management activities related to these initiatives.\n\nWHO YOU WILL WORK WITH\n\nThe Corporate Data & Operations team delivers centralized, corporate business services that require partnership and integration across BCI departments. This role will work in the Data and Analytics team, which delivers analytics solutions (e.g. reports and dashboards), curated re-usable datasets, data science, data platforms, and data governance.\n\nWHAT YOU WILL BE DOING\n\nSupport the development, documentation and maintenance of data dictionaries, data catalogs, and other data governance artifacts\n\nAssist in the design and implementation of data quality and data validation rules, ensuring that data is of high quality\n\nParticipate in data governance meetings and workshops, contributing to discussions and providing insights on data-related issues and challenges\n\nHelp conduct data governance training and awareness programs for employees\n\nGathering requirements for low to medium complexity projects\n\nWork closely with data stewards across the business to understand their scope of data\n\nWHAT WE OFFER\n\nExcellent career development and training by contributing to a strategic program with high visibility\n\nWork with a dynamic team in a fast-paced environment\n\nThe development of real-world skills at one of the largest institutional investors in Canada\n\nExposure to some of the most talented, approachable, and inspiring people in the industry\n\nThe ability to opt-in for access to Dialogue, a user-friendly app that offers virtual primary care, employee and family services, and mental health supports\n\nTime to connect with co-op students & interns at BCI - build your network and shared learning\n\n2 paid days per year for volunteering\n\nCompetitive pay: Mid / Back Office: $2,260.00 gross bi-weekly or $2,090.00 gross bi-weekly + vacation leave paid based on 6% of salary ($2,260.00 gross biweekly for those with (or working towards) a graduate degree or joining the Investment Strategy & Risk department and $2,090.00 gross biweekly for those with (or working towards) an undergraduate degree, diploma, or certificate)\n\nTravel: if coming to Victoria for this work term, BCI will provide a fixed-rate travel allowance based on your location\n\nTHE DETAILS\n\nWork term: Summer and Fall 2025 (May to December)\n\nDepartment: Corporate Data & Operations\n\nOffice Location: 750 Pandora Avenue, Victoria, BC\n\nSpend your off hours exploring beautiful Victoria and Vancouver Island\n\nAll co-ops/internships will need to be completed in person at our Victoria office with the option to work one day per week from home. Please note, some positions are not eligible for hybrid work."
    },
    {
      "key": "Qualifications:",
      "value": "THE IDEAL STUDENT\n\nHas a keen interest in the business aspects of data and analytics and making sense of data\n\nIs an effective communicator and good listener\n\nFocuses on value driven innovation\n\nReady to learn more about the investment management industry and how data drives it\n\nREQUIRED SKILLS\n\nExhibit a high level of professionalism and excellent interpersonal skills\n\nAbility to meet deadlines while maintaining accuracy, excellent product quality, and attention to detail\n\nHas an interest in data, a dedication to hard work, commitment to the highest ethical standards, and an eagerness to learn\n\nAbility to use Excel, PowerPoint, Word and Outlook\n\nFamiliarity using Microsoft 365 tools such as One Drive, SharePoint Online, and MS Teams would be an asset\n\nAbility to read and write basic code scripts in SQL\n\nFamiliarity with data governance tools would be beneficial (not required)\n\nA foundation in relevant technical skills, such as SQL, data modeling, and data visualization tools, will help you succeed in this role"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}