{
  "title": "245264 - Co-op Summer 2025 - End User Services - 8 Months",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Work Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Co-op Summer 2025 - End User Services - 8 Months"
    },
    {
      "key": "Job Location:",
      "value": "Ottawa"
    },
    {
      "key": "Region:",
      "value": "ON-National Capital Region"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Company Description\n\nAt General Dynamics Mission Systems-Canada, co-op positions mean hands-on impact. Join an inclusive team that engineers high technology solutions, products, and services that have a real-world impact.\n\nRealize your Impact: Our work enables customers to successfully execute missions across diverse domains of operation. Your fresh perspectives and ideas have the power to shape real solutions, influence projects and drive meaningful change.\n\nKick-start your Career: Immerse yourself in various industry facets, gaining insights that span from cutting-edge technology to project management. Elevate your resume with a distinguished company to set the stage for a rewarding career, while paving the way for future full-time opportunities within General Dynamics.\n\nGrow your Network: Work side by side with seasoned professionals who are excited to share their experience and develop your skills. Have meaningful interactions, ask questions, and build relationships that can lead to lasting industry connections.\n\nBalance your Life: Our flexible environment is designed for you to thrive. With options to work from home or under a compressed nine-day fortnight schedule, we champion work-life balance, ensuring you have time for personal endeavors and your professional aspirations.\n\nOur success is fueled by our people and the wide variety of backgrounds, perspectives, and skills they bring to the business - learn more about our commitment to diversity, inclusion, and belonging here. We will work with you around any workplace accommodation required during our application process. If you require accommodation or have questions, please contact Human Resources via recruitment@gd-ms.ca.\n\nJob Description\n\nID: REF552F\n\nWe are looking for a Co-Op student to join our End User Services team; the face of Information Technology at GDMS-C. You will work in a fast paced, friendly and collaborative environment to help run, maintain, and use our IT ticketing system, and to support quick and accurate resolution of IT issues. You will work alongside experience professionals who are eager to share their knowledge and experience.\n\nResponsibilities\n\nThis position will be responsible for a variety of tasks including:\n\nGathering requirements for application improvements\nAutomate workflows using scripting and other toolsets\nTesting and evaluating scripts, workflows and enhancements\nDocument processes, instructions, and knowledge articles\nAssist with day-to-day IT activities and support"
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications\n\nEssential Skills\nExperience with JavaScript, PowerShell, or other scripting languages\nFlowchart and workflow design with Visio or other tools\nHigh level of proficiency with the MS Office suite\nFundamental understanding of Server and Desktop operations systems\nAbility to work with minimal supervision\nExcellent verbal and written communication skills\n\nAssets\n\nExperience with ServiceNow\nExperience with databases and large datasets\nExperience designing and documenting processes and workflows\nCustomer service background\nAdditional Information\n\nSecurity\n\nMust be able to obtain and maintain Canadian Security Clearance and a positive Controlled Goods Assessment. Eligibility to work in Canada either as a Canadian Citizen or Permanent Resident.\nApplicants may be required to meet additional security requirements in order to gain access to technical data, classified areas or information that is subject to international regulations."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}