{
  "title": "245260 - Data Analyst, Co-op",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Data Analyst, Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Suite 400-13450 102nd Avenue, Surrey, BC V3T 0H1"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$21 - $23/hr"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5"
    },
    {
      "key": "Number of Positions:",
      "value": "2"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "If you are passionate about turning data into actionable insights, and motivated to find a role where you can truly make a difference to the quality of healthcare delivery and patient care, this opportunity is for you.\n\nMain responsibilities include:\n\n• Perform complex data mining across multiple electronic health systems and data sources, analyze and interpret results to provide evidence-based insights on service utilization, health interventions, technology assessments and performance reviews,\n\n• Plan and develop dynamic business intelligence (BI) reports for CAADSI clients through clinical, financial, human resource, and operational data,\n\n• Apply knowledge in performance measurement and benchmarking methodologies to develop automated data products,\n\n• Support the creation of strategic business cases and supporting documentation, data dictionaries, briefing papers, and reports across multiple clinical areas and portfolios,\n\n• Prepare data and reports for Fraser Health Executive Team, Board of Directors and other stakeholders, and\n\n• Work collaboratively with colleagues, senior management, and staff of various organizational units both internal and external to the Fraser Health organization."
    },
    {
      "key": "Qualifications:",
      "value": "The ideal candidate will be either a 3rd or 4th-year student pursuing a bachelor's degree, or a student pursuing a Master's degree in Healthcare Analytics, Data Science or other related discipline. Candidates should be expert with T-SQL, have a proficiency with mainstream BI development tools (e.g., PowerBI, Tableau, or MicroStrategy), and have a working knowledge of a programming language such as Python, R, or VBA."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}