{
  "title": "245417 - Surveillance Systems Coop Student/Engineer",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "ELIGIBILITY REQUIREMENTS:\n\nProof of Canadian Citizenship;\nThe Co-op student must be able to obtain reliability status security clearance and maintain it for the duration of the co-op term;\nIf the student has listed a permanent address in a foreign country in the last five years, the student will need to obtain a document from that foreign police department stating that no infractions were committed throughout the duration of their stay."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Surveillance Systems Coop Student/Engineer"
    },
    {
      "key": "Job Location:",
      "value": "Esquimalt"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Yes"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5hrs/wk"
    },
    {
      "key": "Start Date:",
      "value": "05/08/2025"
    },
    {
      "key": "End Date:",
      "value": "08/26/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "2"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "FMF Cape Breton (FMF CB) is the West Coast Royal Canadian Navy (RCN) maintenance facility, servicing all West Coast RCN ships and submarines.\n\nFMF CB has an engineering section (ENG), providing engineering support in the repair, maintenance, and operation of RCN units both in home-port and wherever they are deployed throughout the world.\n\nWithin FMF CB ENG there is a Combat Systems Engineering (CSE) section that deals with communications, command and control, weapons and sensor systems (both above and underwater).\n\nAs an integral member of the CSE team, you will assist in various aspects of engineering/engineering management in the field of Combat Systems Engineering. Specifically this co-op position deals with surveillance systems - radars, electronic warfare, command and control, and data link.\n\nTypical activities in which you will participate include:\n\nAssist in development of a troubleshooting manuals for various shipborne combat systems interface/systems.\nAssist Surveillance Systems staff with the conduct of radar, electronic warfare, command and control and data link systems trials\nalongside/in harbour\nResearch, Catalogue and review the Combat Systems Trials Requirements Database\n\nYou will be working with various sections within the unit, including personnel from the Business, Production, other Engineering Departments and/or other units within CFB Esquimalt.\n\nYou will be required to present your work term report to members of the FMF CAPE BRETON senior management team."
    },
    {
      "key": "Qualifications:",
      "value": "Essential Qualifications:\n\n1st or 2nd year Mechanical, Software or Electrical Engineering Student;\nInitiative;\nDependability;\nKnowledge of the MS Office Suit, MATLAB and VISIO;\nAbility to organize and manage multiple projects;\nAbility to carry out projects independently;\nEffective communication skills;\nTechnical report writing;\n\nAsset Qualifications:\n\nDND/Navy familiarity;\nSupervisory experience;\nProject management experience;\n\nELIGIBILITY REQUIREMENTS:\n\nProof of Canadian Citizenship;\nThe Co-op student must be able to obtain reliability status security clearance and maintain it for the duration of the co-op term;\nIf the student has listed a permanent address in a foreign country in the last five years, the student will need to obtain a document from that foreign police department stating that no infractions were committed throughout the duration of their stay."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}