{
  "title": "245391 - Student, Cyber Security Analyst - Summer 2025",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "RESTRICTION TO ELIGIBILITY (CONTROLLED GOODS PROGRAM)\n\nThis opportunity is posted by a company subject to Canada's CGP (Controlled Goods Program). Security screening is required for employees, which includes the following:\n\nProof of citizenship\nProof of residence\nCriminal records check (Canada)\nCertificate of good conduct from each country where the individual has resided for six consecutive months or more\n\nWORK DURATION: 8 or 12 MONTHS (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 8 and/or 12 months.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four.\n\nNEED HELP TO RELOCATE? If you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section \"Co-operative Education Travel Awards for Work Terms outside Victoria\"."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 or 12 Months"
    },
    {
      "key": "Job Title:",
      "value": "Student, Cyber Security Analyst - Summer 2025"
    },
    {
      "key": "Job Location:",
      "value": "Richmond, BC; Brampton, ON; Sainte-Anne-de-Bellevue, QC"
    },
    {
      "key": "Region:",
      "value": "Various"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$20.00 - $23.00/hour"
    },
    {
      "key": "Number of Positions:",
      "value": "3"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Student, Cyber Security Analyst - Summer 2025\n\nJob category: Information Technology\n\nRequisition number: STUDE008288\n\nDescription\n\nBuilding the space between proven and possible, MDA Space (TSX:MDA) is a trusted mission partner to the global space industry. A robotics, satellite systems and geointelligence pioneer with a 55-year+ story of world firsts and more than 450 missions, MDA Space is a global leader in communications satellites, Earth and space observation, and space exploration and infrastructure.\n\nThe MDA Space team of more than 3,000 space experts in Canada, the US and the UK has the knowledge and know-how to turn an audacious customer vision into an achievable mission - bringing to bear a one-of-a-kind mix of experience, engineering excellence and wide-eyed wonder that's been in our DNA since day one. For those who dream big and push boundaries on the ground and in the stars to change the world for the better, we'll take you there.\n\nAre you ready to launch the next stage of your career in the new space economy? We would love to hear from you!\n\nWe're on the hunt for a Cybersecurity Analyst - Co-Op on our team at our Brampton, Montreal or Richmond offices. This is an 8 to 12 months term starting in May 2025.\n\nSupporting all of MDA's three business areas in Geointelligence, Robotics & Space Operations, and Satellite Systems, our Corporate team knows from experience that working in a hands-on learning environment enables us to collaborate across disciplines and get the job done. From HR and Finance to IT and Communications, we are all committed to reaching new heights and advancing humanity's place in the universe and here on Earth.\n\nThis role is key in the identification of risks and threats, protection of information and assets, detection and monitoring of events and anomalies, and response to and recovery from, cyber events. The successful candidate will also play a role in shaping the planning and design of security architecture.\n\nResponsibilities:\n\nMonitor computer networks for security events or threats\nInvestigate security breaches and other cyber security incidents.\nInstall security measures and operate software to protect systems and information infrastructure, including firewalls and data encryption programs.\nDocument security breaches and assess the damage they cause.\nWork with security team to perform tests and uncover network vulnerabilities.\nFix detected vulnerabilities to maintain a high-security standard.\nStay current on IT security trends and news.\nDevelop company-wide best practices for IT security.\nPerform penetration testing.\nHelp colleagues install security software and understand information security management.\nResearch security enhancements and make recommendations to management.\nStay up-to-date on information technology trends and security standards."
    },
    {
      "key": "Qualifications:",
      "value": "Requirements:\n\nEnrolled in a college or university program in information security, computer science or related field\nKnowledge of security standards and frameworks such as ISO27001, NIST\nStrong problem solving and thinking skills\nKnowledge of computer network penetration testing and techniques.\nUnderstanding of firewalls, proxies, SIEM, antivirus, and IDPS concepts.\nMust be able to work both independently and in team environments\nHigh degree of maturity and excellent communication skills\nMust be eligible for Reliability level clearance\n\nDesired Qualifications:\n\nStrong analytical and problem-solving skills\nExperience with ethical hacking and/or penetration testing\nBackground in software development or programming\nUnderstanding of social engineering\n\nSuccessful candidates must obtain and hold security clearance at the reliability status level, and pass security assessment for the Controlled Goods Program (CGP).\n\nMDA Ltd. is proud to provide accommodation(s) during the recruitment process. Should you require any accommodations, please indicate this on your application/cover letter and we will work with you to meet your accessibility needs.\n\nThe compensation range for this position is $20 - $23 hourly. The specific compensation offered will be based on the qualifications and experience of the successful candidate."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}