{
  "title": "244778 - Lidar Test Engineer",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Spring"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Lidar Test Engineer"
    },
    {
      "key": "Job Location:",
      "value": "Burnaby"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$2500 - $4500 per month"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Company Description\n\nLumotive's revolutionary programmable optical semiconductors enhance perception, boost computing power, and ensure robust high-speed communication across various markets.\n\nThe award-winning, highly patented Light Control Metasurface (LCM™) chip is the first commercially available software-defined photonic beamforming solid-state technology addressing critical gaps in multiple industries, from 3D sensing to AI computing.\n\nOur LCM™ chip has already secured multiple design wins in our initial market, positioning it at the forefront of the 3D sensing evolution. By merging lidar and ToF camera technologies, it caters to a wide range of markets, including consumer electronics, robotics, industrial, and automotive sectors.\n\nLumotive was named Fast Company's Next Big Thing in Tech and won two CES Innovation Awards. Headquartered in Redmond, WA, with offices in San Jose, CA, and Vancouver, Canada, Lumotive is backed by notable investors, including Gates Frontier, MetaVC Partners, Quan Funds, Samsung Ventures, and Uniquest.\n\nJob Description\n\nLumotive is seeking a motivated and detail-oriented Lidar Testing Engineer for an Intern/co-op (4 to 8 months) to join our Engineering team here in Burnaby, B.C. Canada. As an intern, you will play a key role in testing and validating our next-generation lidar sensors. This is a hands-on opportunity to gain valuable experience in the lidar and optics industry, working alongside engineers to ensure the quality and performance of our cutting-edge products.\n\nResponsibilities:\n\nAssist in setting up and conducting tests to validate the performance of Lumotive's lidar sensors, including range, resolution, accuracy, and beam-steering capabilities.\n\nCollaborate with the engineering team to design and execute test plans for various lidar applications and use cases.\n\nPerform data collection, analysis, and reporting to assess sensor performance in different environmental conditions.\n\nHelp develop and maintain test setups, including hardware and software tools for automated testing and data logging.\n\nIdentify issues or anomalies during testing and assist in troubleshooting to improve sensor performance.\n\nContribute to the documentation of test results, performance metrics, and recommendations for design improvements.\n\nSupport cross-functional teams with testing related to product development, calibration, and product release.\n\nAdditional Information\n\nPay is $2500 to $4500 per month in CAD.\n\nLumotive is an equal opportunity employer - All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, or any other legally protected status.\n\nAll your information will be kept confidential."
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications\n\nCurrently pursuing a degree in Electrical Engineering, Optical Engineering, Robotics, Computer Science, or a related field.\n\nEligibility as a co-op student with your post-secondary institution.\n\nEvidence of a strong interest in lidar technology, optics, and sensor systems.\n\nExperience with laboratory testing equipment, data analysis, and scripting (e.g., Python, MATLAB) is a plus.\n\nFamiliarity with optical testing principles, lidar principles, and signal processing concepts is beneficial.\n\nStrong analytical skills, attention to detail, and ability to work independently."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}