{
  "title": "244824 - Summer 2025 | Lumentum Engineering and Computer Science Co-op | Look inside for Multiple Jobs",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "CHECK INDIVIDUAL JOB POSTINGS\nPlease be sure to:\n\nCheck the employer's site for the actual application deadline date. It may not be the same date used in this posting.\nCheck the employer's site for the actual location of the position. It may not be in the same city as used for this posting.\nCheck the work duration of the position. Work terms may be offered for 4, 8, 12, or 16 months.\nKEEP A COPY: It is also recommended that you keep copies of any postings that you apply to as they may be removed from the employer's site once the job closes.\n\n4, 8, 12 OR 16 MONTH WORK TERM\n\nWork Duration: 4, 8, 12, or 16 months (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms , and a 16-month employment period is registered as 4 separate, consecutive work terms). Please see each individual posting, as positions listed have differing durations.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads - If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria\n\nResources for living and working in Ottawa:\n\nTourism\nStatistics\nReviews\nTransportation\nAccommodation - Rentals\nThings to do"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4, 8, 12, or 16 months"
    },
    {
      "key": "Job Title:",
      "value": "Summer 2025 | Lumentum Engineering and Computer Science Co-op | Look inside for Multiple Jobs"
    },
    {
      "key": "Job Location:",
      "value": "Ottawa"
    },
    {
      "key": "Region:",
      "value": "ON-National Capital Region"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "20"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Company Overview:\n\nBrilliance happens here\n\nLumentum is an industry leader in photonics technology, with a global footprint of approximately 7,500 employees around the world. Our solutions are everywhere, weaved into the fabric of our modern lives.\n\nOur business focuses on two major markets: Cloud and Networking and Industrial Tech. From biometric security in mobile devices, to laser vision in autonomous vehicles, to connecting the world at ever-faster data speeds, Lumentum is the company working behind the scenes to shape the way the world connects, creates, and interacts.\n\nAt the center of all our photonic innovation is the power of light. You see can this in our products, our culture, our purpose, and even in our company name, \"Lumentum\" - a blend of the words \"lumen,\" meaning light and enlightenment, and \"momentum,\" meaning power and drive.\n\nThese two core elements are central to what we do at Lumentum-confidently designing and developing next-generation technologies, while harnessing all that light is capable of. Our talented teams achieve this with our unique combination of deep technical insight, global manufacturing scale, and savvy business acumen.\n\nWe seek individuals who will bring their energy, expertise, and fresh perspectives to Lumentum, as we continue on our journey to create a brighter future for the world we live in. If you aspire to excellence and are ready to tackle challenging yet rewarding projects that will make a significant impact, please explore our open opportunities.\n\nWhat sets Lumentum's student program apart? We're awesome because…\n\nOur student program offers opportunities to work on real projects that have meaningful impact in an environment that supports diverse perspectives, inclusivity and fosters a sense of belonging. We offer flexible working schedules, continuous learning, mentorship programs, and employee resource groups\n\nLumentum awards DIB scholarships to Canadian Co-ops and Interns. To be considered for the scholarship, you must complete a fall, winter, or summer work term with Lumentum.\n\nYou might be interested to know:\n\nWe are a humble but passionate team who loves our work and is improving with each day;\nOur team has a long history (15 years and counting) of employing co-ops/interns and we truly value the contributions our students make to our team. In fact, several students have been hired upon graduation;\nOur building offers many perks including a small gym with showers; on site yoga and boot camp classes, a cafeteria with subsidized meals and free coffee & tea; a prayer room; a games room; and plenty of free parking, or a conveniently located public transit stop in front of the building.\n\nPlease see individual links for each posting in the table below:\n\nPOSITION (And Links):\tWork Term Length:\tJob ID#:\nOpto-Mechanical Design Engineer (Co-op Student)\t4 - 8 months\t20241303\nOptical Verification Engineer (Co-op Student)\t8 - 12 months\t20241269\nProcess Engineer (Co-op Student/Intern)\t4 - 8 months\t20241268\nSoftware Automation Test Engineer (Co-op/Intern)\t8 - 12 months\t20241270\nCalibration and Test Software Engineer (Co-op Student)\t4 - 8 months\t20241309\nEmbedded Software Engineer (Co-op Student)\t4 - 8 months\t20241263\nEmbedded Software Engineer (Co-op Student)\t\t20241358\nFPGA Verification Co-op/Intern\t8 - 12 months\t20241613\nLCoS R&D Coop\t8 months\t20241308\nMEMS Engineer Co-op/Intern\t\t20241372\nMetrology System Coop\t8 months\t20241306\nOptical Device Development Engineer- Cloud Networks Co-op/Intern\t4 - 8 months\t20241311\nOptical Engineering Co-op\t12 - 16 months\t20241293\nPrecision High Speed 3D Camera Lab and Data Analyst Co-op/Intern\t8, 12 or 16 months\t20241258\nPrecision High Speed 3D Camera Process Automation Engineer (Coop)\t8, 12 or 16 months\t20241259\nProcess Quality Engineer (Co-op Student)\t\t20241275\nSoftware Automation Engineer Co-op/Intern\t4 - 8 months\t20241264\n3D Camera Software Developer Co-op/Intern\t8 - 12 months\t20241276\n3D Camera Software Developer Co-op/Intern\t8, 12 or 16 months\t2024729\nProject Manager Analyst (Co-op/Intern)\t16 months\t2024751"
    },
    {
      "key": "POSITION (And Links):",
      "value": "Work Term Length:"
    },
    {
      "key": "Opto-Mechanical Design Engineer (Co-op Student)",
      "value": "4 - 8 months"
    },
    {
      "key": "Optical Verification Engineer (Co-op Student)",
      "value": "8 - 12 months"
    },
    {
      "key": "Process Engineer (Co-op Student/Intern)",
      "value": "4 - 8 months"
    },
    {
      "key": "Software Automation Test Engineer (Co-op/Intern)",
      "value": "8 - 12 months"
    },
    {
      "key": "Calibration and Test Software Engineer (Co-op Student)",
      "value": "4 - 8 months"
    },
    {
      "key": "Embedded Software Engineer (Co-op Student)",
      "value": "4 - 8 months"
    },
    {
      "key": "Embedded Software Engineer (Co-op Student)",
      "value": ""
    },
    {
      "key": "FPGA Verification Co-op/Intern",
      "value": "8 - 12 months"
    },
    {
      "key": "LCoS R&D Coop",
      "value": "8 months"
    },
    {
      "key": "MEMS Engineer Co-op/Intern",
      "value": ""
    },
    {
      "key": "Metrology System Coop",
      "value": "8 months"
    },
    {
      "key": "Optical Device Development Engineer- Cloud Networks Co-op/Intern",
      "value": "4 - 8 months"
    },
    {
      "key": "Optical Engineering Co-op",
      "value": "12 - 16 months"
    },
    {
      "key": "Precision High Speed 3D Camera Lab and Data Analyst Co-op/Intern",
      "value": "8, 12 or 16 months"
    },
    {
      "key": "Precision High Speed 3D Camera Process Automation Engineer (Coop)",
      "value": "8, 12 or 16 months"
    },
    {
      "key": "Process Quality Engineer (Co-op Student)",
      "value": ""
    },
    {
      "key": "Software Automation Engineer Co-op/Intern",
      "value": "4 - 8 months"
    },
    {
      "key": "3D Camera Software Developer Co-op/Intern",
      "value": "8 - 12 months"
    },
    {
      "key": "3D Camera Software Developer Co-op/Intern",
      "value": "8, 12 or 16 months"
    },
    {
      "key": "Project Manager Analyst (Co-op/Intern)",
      "value": "16 months"
    },
    {
      "key": "Qualifications:",
      "value": "Please see each individual posting linked in the table above for required qualifications for each job."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}