{
  "title": "244945 - Quality Assurance Analyst",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Quality Assurance Analyst"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "No"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$3000/month - $3600/month"
    },
    {
      "key": "Hours per Week:",
      "value": "40"
    },
    {
      "key": "Number of Positions:",
      "value": "2"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "The Company\n\nIn this role, you will be a member of the VertiGIS team that is primarily responsible for the development of VertiGIS Studio technology and offering its related services. Over 1400 organizations around the world rely on VertiGIS Studio software to design, develop, and maintain web-based mapping applications. We believe geographic information can empower people to make better decisions about their lives, society, and the world around us. You can help us make a difference.\n\nThe Position\n\nWe are searching for a motivated and enthusiastic individual to help us ensure the ongoing quality of our web and mobile-based mapping solutions. You will work within our development teams and provide your expertise on issues surrounding quality assurance and control.\n\nWe are a strong supporter of the UVic co-op program. Many of our co-op students stay on full-time and kick start their careers at VertiGIS. A number of our top employees started with us as co-op students.\n\nResponsibilities, depending on ability and experience, may include:\n\nTest new features in VertiGIS Studio software products from user and functionality viewpoints\nReport bugs, track defects, and resolve issues with the developers\nWork in an Agile framework with frequent releases\nDesign manual test suites and create automated functional tests\nApply quality assurance and quality control procedures and best practices\nProvide guidance and knowledge to other stakeholders within the company\n\n\nOur Perks\n\nTeam / Career Growth\n\nAn opportunity to kick-start your career at a dynamic, growing company\nTop-notch colleagues that like and respect one another\nWe listen to peoples' ideas-and act on them\nA supportive environment with opportunity for training, professional development, and advancement\nChallenging, interesting work\nCutting edge technology that improves the world around us\nBottomless book budget\nCompany summer and winter parties (that are fun to attend)\n\nReputation\n\nWe're recognized experts in our field; people around the world seek us out\nOur clients like us\n\nOffice\n\nA hybrid working model allowing employees to split time between the office and home\nA central downtown location overlooking Victoria's Inner Harbour\nAn amazing rooftop patio\nSecure bike storage and showers\nLunchtime yoga on Tuesdays and Thursdays\nGood coffee (we know how important this is)\n\nLearn more about working with us!"
    },
    {
      "key": "Qualifications:",
      "value": "Excellent communication skills, both written and verbal.\nStrong analytical and problem solving skills.\nPost-secondary background in computer science or related field.\nExperience programming in Typescript or .NET is ideal.\nStrong organizational skills and a keen eye for detail.\nEnthusiasm and a passion for technology."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}