{
  "title": "244781 - Software Engineer Co-Op (200937)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Software Engineer Co-Op (200937)"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "65,000 - $70,000/year"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Description & Requirements\n\nWe are a global team of creators, storytellers, technologists, experience originators, innovators and so much more. We believe amazing games and experiences start with teams as diverse as the players and communities we serve. At Electronic Arts, the only limit is your imagination.\n\nElectronic Arts is looking for students to join our world-class internship experience. For more information about our Next-Gen Program, visit https://www.ea.com/careers/interns-and-university-graduates\n\nOur teams build meaningful relationships with hundreds of millions of players around the world who love our games. We aim to be the best at meeting players where they are and supporting them throughout their journey with EA. Our teams develop the strategic vision of our products, run outstanding multi-channel campaigns, build global engagement across all touch points, develop global insights, and propel sales and global publishing. We understand the dynamic global landscape so we can bring relevant content, promotions, and help to players anywhere.\n\nWhat You'll Do:\n\nAt Electronic Arts, we exist to inspire the world to play. We have many examples of players creating their own content, whether it be a skateboard park in Skate or fantastical mansions in the Sims 4. As a Software Engineering Intern at EA, you will work with a team of Software Engineers to develop applications that help players create their own unique gaming experiences. You are a problem solver, comfortable in backend coding, who is always up for new challenges. Note that this is not a game studio design role\n\nResponsibilities:\n\nDevelop readable, testable, clean code that integrates well within a larger system.\nWork within the Agile Development Methodology and participate in Scrum ceremonies.\nGet to know how our requirements become technical designs, which become usable software.\nParticipate in sharing and receive constructive feedback through code reviews.\nWork with partner engineers and designers to understand iteratively adding features and APIs.\nContribute to a creative, supportive culture for the entire team."
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications:\n\nYou are pursuing a Bachelor's degree in a related field\nYou have basic knowledge of the software development lifecycle\nYou have a working knowledge of a JVM language (Kotlin (preferred), Java, Scala, Groovy)\nYou understand basic data structures and algorithms\nYou have experience with at least one public cloud provider (AWS, GCP, Azure)\n\nYou must be available for a full-time paid internship in the summer of 2025. We are only considering students who will be enrolled in an accredited degree program in the summer of 2025, slated to graduate no earlier than May 2026. You must be legally authorized to work in Canada on a full-time basis during the 16-week internship. Visa sponsorship is not available for this position.\n\nBC COMPENSATION AND BENEFITS\nThe base salary ranges listed below are for the defined geographic market pay zones in these states. If you reside outside of these locations, a recruiter will advise on the base salary range and benefits for your specific"
    }
  ]
}