{
  "title": "245291 - Electronics Prototype Engineer Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "THIS POSITION IS SUBJECT TO FUNDING\nThis position is offered subject to funding being approved through the federal Student Work Placement Program. Funding approval depends on several factors, including student eligibility.\n\nTo be eligible for this funding program you must be:\n\nRegistered in a Canadian post secondary education institution\nCanadian citizen, permanent resident or person with refugee protection given under the law; and\nLegally able to work in Canada according to the laws and regulations of the province or territory where you live\nHired as an employee, not as an independent contractor.\n\n8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Electronics Prototype Engineer Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, fully remote"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Electronics Prototype Engineer Co-op\nPosition: Electronics Prototype Engineer Co-op\nOrganization: Salyx\nDuration: 8 months\nStart date: Being a Canadian Citizen, Permanent Resident or have refugee status is required as this position is grant-funded by the Canadian Government.\nLocation: Victoria, BC\nCompensation: 3,020 gross monthly for working 40 hours per week\n\nCompany Description\nSalyx is a MedTech company that develops innovative e-health IoT devices that connect to cloud services and mobile apps. Our ecosystem is part of a new Smart Monitoring Solution. The Salyx Health Device monitors more than five key health vital signals and warns the user of abnormal levels. Unlike other trackers in the industry, the Salyx Tracker requires minimal user intervention and brings the logging functionality of hospital technology right to your home.\n\nOur company website\n\nJob Description\nWe are looking for an Electronics Prototype Engineer to join our Hardware Development team. We are looking for an independent and self-driven Engineer who wants to see his contributions and knowledge have a significant impact on the product. You will work autonomously under the guidance of an experienced supervisor and will collaborate closely with a dedicated team of skilled engineers, fostering a dynamic feedback loop where you provide and receive high-level feedback.\n\n\nDuties and Responsibilities\n\nPCB prototype design in various materials including FR-4 and flexible substrates using KiCAD.\nSystem-level Testing and Simulation using MATLAB or Python.\nElectronic design according to FCC guidelines.\nElectronic analog filtering to increase signal-to-noise ratio.\nComponent selection, BOM creation, and sourcing of electronic components.\nSoldering, assembling, and installing electronic components using electronic testing equipment such as oscilloscope, signal generator, power supply, multi-meter, etc.\nAssures electronic product/prototype quality by designing testing methods.\nElectronic process and research documentation for knowledge transfer.\n3DCAD and 3D printing usage to support enclosure design around PCB.\nPreparation for PCB mass production and manufacturing.\nResearch and development of state-of-the-art bio-sensors and electronic components.\n\nContact\nPlease apply with your resume and transcript to hr@salyxmedical.com.\n\n\nWe believe that diversity, equity, and inclusion are the foundation for innovation and is an integral part of our business. We believe that success happens where new ideas can flourish - in an inclusive environment that is rich in diversity and a place where people from various backgrounds can work together. As an equal-opportunity employer, Salyx Medical Inc encourages applications from all qualified individuals, including candidates from underrepresented groups and communities. We invite all qualified candidates to apply online with their resume and cover letter."
    },
    {
      "key": "Qualifications:",
      "value": "Knowledge and Skills\n\nStrong communication and coordination skills\nPrevious experience as a mechanical engineer or with mechanical production an asset\nExperience in 3D design modeling and drafting\n3D printing knowledge\nProficient in CAD software such as (Fusion 360).\nElectronic design knowledge is a plus (Eagle.)\nPCB board design and soldering is a plus.\n\nAcademic Requirements\nCurrently enrolled in a Bachelor's Degree in Biomedical, Electrical, Electronics, or Mechatronics in their third year or above. This position is for students only as it is funded by the SWPP program.\n\nOther Requirements\nBeing a Canadian Citizen, Permanent Resident or have refugee status is required as this position is grant-funded by the Canadian Government."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}