{
  "title": "244939 - Software Baseband Developer Co-op - ID: 760283",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Work Duration: 8, 12, or 16 months (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms , and a 16-month employment period is registered as 4 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 8, 12, and/or 16 months.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4, 8, 12, or 16 months"
    },
    {
      "key": "Job Title:",
      "value": "Software Baseband Developer Co-op - ID: 760283"
    },
    {
      "key": "Job Location:",
      "value": "Ottawa"
    },
    {
      "key": "Region:",
      "value": "ON-National Capital Region"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "At this time, Ericsson Canada Inc. does not provide immigration assistance/sponsorship now or in the future for this position.\n\nStart date: May 5th, 2025\n\nLocation: Ottawa, ON. Hybrid, 60% in office min, as per requested by the team.\n\nDuration: 8, 12 or 16 are possible\n\nPlease upload your transcript when applying. (Use the \"Cover letter\" uploading tab)\n\nAbout this opportunity\n\nThe 5G Baseband software development team has multiple positions to fill. They all provide great learning opportunity in 5G wireless technology. There is lots of team support and student peers to work with, and there is plenty of interesting tools exposure too.\n\nThe available positions are as follows. It's also possible that types of work will change over time.\n\n5G software developer\n\nThis position involves developing, debugging and testing 5G features. The development is focused on baseband Layer 2 software.\nYou will be working with a software development team in Ericsson, getting full experience of cutting edge technology and sharpening your programming skills.\n\nTools developer\n\nThis position involves developing/debugging software tools which support developer's needs, such as command-line and web-based tools, 5G log analysis tools, trouble reporting tools, debug tools, software management tools, etc.\nTo give our interns a well-rounded Ericsson experience, a portion of your work term will involve working with a software development team on 5G related production and test software\n\nAutomated test developer\n\nThis position involves developing the infrastructure to support 5G automated testing and developing automated test cases to test new 5G software features. Areas where test development is focused include Layer 1, test framework and 5G features\nThis area offers interesting coding opportunities in the testing realm\n\nAI Developer Experience\n\nThis position involves improving the test development experience by leveraging AI which involves Gen AI powered tool functionality testing. This includes, but is not limited to, generating boilerplate code templates to streamline test creation, identifying inefficiencies in current processes, documenting/presenting findings and improving test automation workflows, exploring use cases for test development, and collaborating with the AI tools team to develop and test new functionalities.\nFurthermore, you will be experimenting with prompt engineering and fine-tuning AI models to optimize their application in test case generation\nIt is beneficial to be familiar with AI tools and frameworks such as OpenAI, and Codeium TensorFlow, as well as having knowledge of prompt engineering techniques to tailor AI models for test generation and debugging workflows\nThis is an excellent opportunity for students passionate about AI, software development, and improving developer workflows\n\nJoin our Team\n\nWhat you will do\n\nCollaborate with colleagues\nUse Agile ways of working\nWork with a team, and independently\nDevelop real time 5G base station software\nApplying AI/ML skills to development work\nAssist in the investigation of issues uncovered during testing\nDevelop/code automated 5G test cases\nDevelop/code automated test tools capabilities\nPerform software feature and/or integration testing in the lab on 5G lab equipment\nWork in 5G simulations testing signal processing, including in AI/ML\nDevelop command-line and web-based tools, to support software development\nGenerate test data for design validation\nDevelop test tools and/or test scripts\nTrouble shoot and help to resolve issues with the test environment"
    },
    {
      "key": "Qualifications:",
      "value": "You will bring\n\nSoftware development and debugging skills with an academic background in Computer Science, Software Engineering, Communications Engineering, Electrical Engineering or equivalent.\nWorking towards completion of a bachelors, masters, or doctoral degree.\nEntering any coop term (1st, 2nd, …).\nInterpersonal skills: Team player, independent, self-starter, organization skills, detail oriented and able to work in a dynamic environment.\nEffective English oral and written communications skills.\nGeneral knowledge of LTE and/or 5G wireless protocols are helpful.\nConcurrent programming languages, Perl, Python, Java, JavaScript, Typescript, Java SpringBoot framework, HTML/CS, C/C++.\nExperience with Linux, Gerrit, Github, Jenkins, Django, and Angular are all assets.\nHTTP & RESTful framework, Database Fundamentals (Hibernate & JPA in our implementation), Kubernetes & Docker.\n\nThese positions are based in Ottawa. We work in a hybrid work model with about three days a week in the office and two working at home, though this can vary somewhat.\n\nThis position reports to 5G Baseband line managers.\n\nWhy join Ericsson?\n\nAt Ericsson, you´ll have an outstanding opportunity. The chance to use your skills and imagination to push the boundaries of what´s possible. To build solutions never seen before to some of the world's toughest problems. You´ll be challenged, but you won't be alone. You´ll be joining a team of diverse innovators, all driven to go beyond the status quo to craft what comes next.\n\nWhat happens once you apply?\nClick Here to find all you need to know about what our typical hiring process looks like.\n\nEncouraging a diverse and inclusive organization is core to our values at Ericsson, that's why we nurture it in everything we do. We truly believe that by collaborating with people with different experiences we drive innovation, which is essential for our future growth. We encourage people from all backgrounds to apply and realize their full potential as part of our Ericsson team. Ericsson is proud to be an Equal Opportunity and Affirmative Action employer, learn more.\n\nIf you need assistance or to request an accommodation due to a disability, please contact Ericsson at hr.direct.mana@ericsson.com"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}