{
  "title": "244957 - AI Software Internship | Remote",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "AI Software Internship | Remote"
    },
    {
      "key": "Job Location:",
      "value": "Remote"
    },
    {
      "key": "Region:",
      "value": "Remote"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, fully remote"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Summer 2025 Positions\n\nFounded by technical leaders from Google, Intel, and Apple, backed by leading Silicon Valley investors Rivos Inc is an early-stage startup. We aim to integrate high-performance, power-efficient software and hardware designs for server applications such as heavy data crunching and analytics. Rivos has many positions open for chip architecture, microarchitecture, performance, logic, verification, physical implementation, software, and systems.\n\nAbout Rivos\nRivos, a high performance RISC-V System Startup targeting integrated system solutions for Enterprise.\n\nAI Software Internship\nInternships are open for AI Software development at a fast-moving startup.\n\nPotential Responsibilities\n\nBuild-up components of an AI Software Stack\nPort AI Software to run on a new H/W platform\nProfiling and tuning of AI applications\nImplement math operators used in AI\nBuild up infrastructure to validate AI models running on a new H/W platform"
    },
    {
      "key": "Qualifications:",
      "value": "Requirements\n\nCoursework or experience with C or C++\nCoursework or experience in operating systems or embedded software engineering\nCoursework or experience with Assembly Language Programming and Computer Architecture\nFamiliarity with Python\nExcellent skills in problem solving, written and verbal communication, excellent organization skills, and highly self-motivated.\nAbility to work well in a team and be productive under aggressive schedules.\nDesire to learn new skills and attack novel problems\n\n\nOptional Requirements\n\nExperience with Numpy, PyTorch, Tensorflow or Jax\nExperience with Rust\nExperience with CUDA, OpenCL, OpenGL, or SYCL\nCoursework or experience with compiler development\nCoursework or experience with Machine Learning algorithms\n\n\nEducation and Experience\n\nWorking towards a Bachelor's, Master's, or PhD in Computer Engineering, Software Engineering or Computer Science"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}