{
  "title": "244765 - X-Force Red Penetration Testing Intern - 4 month - Toronto",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "X-Force Red Penetration Testing Intern - 4 month - Toronto"
    },
    {
      "key": "Job Location:",
      "value": "Toronto"
    },
    {
      "key": "Region:",
      "value": "ON-Greater Toronto"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Introduction\n\nA career in IBM Consulting is rooted by long-term relationships and close collaboration with clients across the globe. IBM Consulting X- Force Services works with clients in providing trusted partnership to improve their security posture in an ever-changing threat landscape. We are in an era of advanced threats. These threats are persistent and continuously evolving. We are seeking highly talented candidates to fill client focused consulting led Security intern roles. You'll work with visionaries across multiple industries to improve X-Force in the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio; including Software and Red Hat. As part of IBM's X- Force Red Penetration Services team, you will work with subject matter experts and clients as they transform organizational security. We're driven by more than just providing security solutions for organizations. We want our clients to succeed. IBMer's can access our entire organization to develop original ideas that help clients create the world they imagine.\n\nYour role and responsibilities\n\nX-Force Red security consultants use the same tactics, tools, techniques and mindsets as attackers to help organizations identify vulnerabilities and misconfigurations before they result in a breach. If this interests you, IBM X-Force's team of veteran security consultants is looking for interns for the summer of 2025, and you may be the perfect fit!"
    },
    {
      "key": "Qualifications:",
      "value": "Required education\n\nHigh School Diploma/GED\n\nPreferred education\n\nBachelor's Degree\n\nRequired technical and professional expertise\n\nDemonstrated leadership and adaptability, with willingness to readily and voluntarily take ownership of highly challenging tasks and problems, even beyond the initial scope of responsibility\nThorough and analytical, with capability to apply logic to solve problems\nAbility to handle multiple tasks concurrently and meet deadlines, while maintaining focus despite conflicting demands\nDrive to overcome the most challenging or difficult obstacles and look for ways to improve results\nInitiative to actively seek new knowledge and improve skills\nEffective interpersonal skills with ability to collaborate and work effectively with individuals and teams, strengthening relationships to achieve win-win solutions\nAbility to communicate complex situations clearly and simply by listening actively and conveying difficult messages in a positive manner\nA passion for innovative ideas, coupled with the ability to understand and assimilate different points of view\nMust be available to work in-person starting May 2025 until August 2025 from IBM's Toronto location.\nTo be considered for this position, you must have the ability to work without a need for current or future Visa sponsorship, as IBM will not be providing Visa sponsorship for this position now or in the future.\n\nAt X-Force, we partner with Fortune 1000 clients to deliver real business value by:\n\nBringing together the world's largest consulting practice with industry-leading offensive security testing capabilities.\nTeaming on all phases of engagements to plan, build, and implement advanced security testing solutions.\nApplying IBM's global expertise and local capabilities through our unique global delivery network combined with our teams in over 170 countries.\n\nPreferred technical and professional experience\n\nUnderstanding of computer security fundamentals, such as OWASP Top 10 and penetration testing methodologies.\nKnowledge of networking and operating system internals (Windows, Linux).\nBasic scripting skills (Python, C#, Bash, PowerShell).\nKnowledge or experience in one or more of the following Security Domains: Network Penetration Testing, Application Penetration Testing, Red Teaming, Application Reverse Engineering, and Social Engineering.\nDemonstrated prior extracurricular experience in offensive security (cyber defense / capture the flag competitions, cybersecurity club involvement, blog posts, etc.)\n\nABOUT BUSINESS UNIT\n\nIBM Consulting is IBM's consulting and global professional services business, with market leading capabilities in business and technology transformation. With deep expertise in many industries, we offer strategy, experience, technology, and operations services to many of the most innovative and valuable companies in the world. Our people are focused on accelerating our clients' businesses through the power of collaboration. We believe in the power of technology responsibly used to help people, partners and the planet.\n\nYOUR LIFE @ IBM\n\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n\nBeing an IBMer means you'll be able to learn and develop yourself and your career, you'll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n\nAre you ready to be an IBMer?\n\nABOUT IBM\n\nIBM's greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we're also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it's time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nOTHER RELEVANT JOB DETAILS\n\nMust have the ability to work in Canada without sponsorship.\n\nThis role will involve working with technology that is covered by Export Regulations sanctions. If you are a Foreign National from any of the following US sanctioned countries (Cuba, Iran, North Korea, Syria, and the Crimea, Luhansk, Donetsk, Kherson, and Zaporizhia regions of Ukraine) on a work permit, you are not eligible for employment in this position."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}