{
  "title": "245418 - Co-Op Student - Data Engineering & Analytics",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "WORK DURATION: 12 MONTHS (A 12 month employment period is registered as 3 separate, consecutive work terms). Please ONLY apply if you are available for 12 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four.\n\nNEED HELP TO RELOCATE? If you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section \"Co-operative Education Travel Awards for Work Terms outside Victoria\".\n\nRESOURCES FOR LIVING AND WORKING IN TORONTO:\n\nTourism\nStatistics\nReviews\nTransportation\nAccommodation - Rentals\nThings to do"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "12 Months Full Time (3 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Co-Op Student - Data Engineering & Analytics"
    },
    {
      "key": "Job Location:",
      "value": "Toronto"
    },
    {
      "key": "Region:",
      "value": "ON-Greater Toronto"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Job title: Co-Op Student - Data Engineering & Analytics\n\nEntity: Manufacturing and Supply - Sanofi Pasteur Limited\n\nLocation:Toronto Campus, 1755 Steeles Avenue West, Toronto, ON, Canada, M2R 3T4 (Onsite)\n\nDuration: 12 months: May 2025 - April 2026\n\nNote: Union candidates must be available 37.5 hours per week, Monday-Friday\n\n\n\nAbout the job\n\nLooking to launch your career at the cutting edge of healthcare? Join Sanofi for a chance to develop with mentoring and guidance from inspirational leaders while helping to make an impact on the lives of countless people worldwide. As o-Op Student - Data Engineering & Analytics in our MSAT Data Science & Digital - Viral & Bacterial Process & Product Department, you will learn to perform and support daily functions. This department supports manufacturing in the Toronto site with data management and analytics.\n\nWe are an innovative global healthcare company with one purpose: to chase the miracles of science to improve people's lives. We're also a company where you can flourish and grow your career, with countless opportunities to explore, make connections with people, and stretch the limits of what you thought was possible. Ready to get started?\n\nMain responsibilities:\n\nThis role will support the Data Science team with data contextualization, data engineering, and deployment of data analytics solutions in the dev/prod environment.\nDesign schemas and maintain relational databases including MySQL, MSSQL, Oracle, and SQLite.\nSupport the front-end implementation and maintenance of web-based dashboards and monitoring tools.\nSupport data analytics activities.\nDevelop and upgrade graphical user interfaces and scripts for data analytics and visualization and integrate codes with language-specific frameworks and environments.\nProvide technical support and software debugging to all users.\nPerform ETL activities (Extract, Transform, Load) such as data cleansing, manipulation, and integration to support process data warehouse project activities."
    },
    {
      "key": "Qualifications:",
      "value": "About you\n\nMust be currently enrolled as a student at an accredited university, in an accredited Co-Op program and have completed at least one year of study.\nEducation: Working towards a degree - Bachelors or Masters in the fields of Actuarial Science (Mathematics, Statistics, Bioinformatics) and Computer Science, Computer Engineering, Bioinformatics, and other relevant Engineering degrees\nMinimum GPA of 3.0 on a 4.0 scale or 8.0 on a 12.0 scale\nTechnical skills: Proficient in use of MS Office, including Excel, Outlook, PowerPoint, and Word\nWork Authorization: Must be legally entitled to work for Sanofi in Canada for the duration of the assignment.\nTechnical qualifications:\nProfessional programming experience in Python is a must\nUnderstanding of relational databases and SQL queries\nExperience with deploying data analytics/engineering solutions to cloud platforms (AWS)\nExperience with JavaScript and web frameworks such as Django is an asset\nKnowledge of data analytics concepts, and familiarity with Python libraries such as Pandas, NumPy, and Scikit-Learn\nSelected candidates will be required to learn and design interactive web applications (Power BI, Flask)\nAble to work independently and in collaboration with others\nStrong organizational skills, attention to detail, and analytical skills\nStrong written, verbal, and interpersonal communication skills\nDesire to work within a team environment\nStrong project management skills including organization, time management, and follow-up.\n\nWhy choose us?\n\nBring the miracles of science to life alongside a supportive, future-focused team.\nDiscover endless opportunities to grow your talent and drive your career, whether it's through a promotion or lateral move, at home or internationally.\nEnjoy a thoughtful, well-crafted rewards package that recognizes your contribution and amplifies your impact.\n\nPursue Progress. Discover Extraordinary.\n\nProgress doesn't happen without people - people from different backgrounds, in different locations, doing different roles, all united by one thing: a desire to make miracles happen. You can be one of those people. Chasing change, embracing new ideas and exploring all the opportunities we have to offer. Let's pursue progress. And let's discover extraordinary together.\n\nAt Sanofi, we provide equal opportunities to all regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or gender identity.\n\n\n\nWatch our ALL IN video and check out our Diversity Equity and Inclusion actions at Sanofi!"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}