{
  "title": "245097 - Ultrasound Research Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria\n\n\n4 OR 8 MONTH WORK TERM (8 MONTHS PREFERRED)\n\nWork Duration: 4 or 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms).\nNote for Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months or 8 Months, but 8 Months Preferred"
    },
    {
      "key": "Job Title:",
      "value": "Ultrasound Research Co-op"
    },
    {
      "key": "Job Location:",
      "value": "North Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "4000-4800 per month"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Ultrasound Research Co-op\n\nPosition Description:\nWe are looking for an Ultrasound Research Co-op to join our Research and Innovation team for an 8-month term (4-month term can be considered for an exceptional candidate).\n\nAs a Research Co-op, you will work side-by-side with the Research and Innovation team to develop our upcoming ultrasound-based imaging products. You do not need to have previous experience with ultrasound.\n\nYou will actively participate in industrial scientific research focused on state-of-the-art ultrasound imaging solutions. You will be working in a multidisciplinary team of scientists and engineers dedicated to advancing ultrasound technology. The ideal candidate is both scientifically minded and pragmatic, with a strong desire to work and grow in a fast-paced technology environment.\n\nResponsibilities:\n\nInnovate: Engage in cutting-edge research, implementing, and developing state-of-the-art ultrasound imaging solutions.\nCollaborate: Work closely with fellow scientists within the team who will mentor you and support your endeavors. Collaborate within and outside of DarkVision to achieve research objectives.\nDevelop: Software and algorithms for processing ultrasound data, leveraging both local and cloud-based resources.\nCommunicate: Prepare and deliver presentations and/or technical reports to different audiences.\n\nOpportunities to Learn:\n\nState-of-the art industrial ultrasound imaging methodologies\nClassical and modern signal/image processing technologies\nScientific computing and GPU programming\nCloud services such as AWS, Docker, and Kubernetes\nTeam collaboration methodologies such as Agile and Scrum\nExposure to various industrial asset inspection applications\nConverting ideas into intellectual property assets (e.g., patents)\n\nAbout DarkVision:\n\nDarkVision Technologies Inc. is a Canada-based tech company disrupting the industrial imaging market since 2013. We have created the world's most advanced acoustic-based imaging platform. We are packaging it into multiple new product lines, revolutionizing how our clients quantify and visualize the integrity of their critical assets.\n\nBacked by Koch Industries, one of the world's largest privately held companies, Darkvision's team of Mechanical, Skunkworks, Electrical, Software, and Machine Learning Engineers is rapidly expanding to meet the demand for the company's current and upcoming products. Our employees to work on cutting-edge technologies that blend science with real-world applications.\n\nBuilding on its commercial success in the downhole market, we are transitioning into a much larger organization and have recently expanded into a state-of-the-art 52,000 sq ft facility in North Vancouver, BC. We are expanding globally by opening offices in the US and Norway. We invite you to join our team for the exciting journey ahead as we become the global leader in industrial imaging.\n\nWhy DarkVision:\n\nHere are some of the reasons you'll like working at DarkVision:\n\nWell-Funded: We are backed by Koch Industries - North America's largest privately held company, and actively work with top-tier operators across North America.\n'A' Players: Our team is made up of talented, intelligent, and hardworking people. If you're an 'A' player, you'll enjoy the intellectually stimulating, challenging and respectfully competitive atmosphere\nCreativity valued: Our employees enjoy considerable freedom and are encouraged to take calculated risks, fostering a culture that values creativity and out-of-the-box ideas.\nSupportive mentorship: Many of our employees have participated in a co-op program themselves. We understand what it takes to ensure your success and personal development during a successful co-op term contributing to the company's achievements."
    },
    {
      "key": "Qualifications:",
      "value": "Basic Requirements:\n\nCurrently enrolled in a university undergraduate or graduate co-op program in: Engineering, Physics, Mathematics, Computer Science, or related field\nProgramming experience with Python and/or MATLAB\nStrong math and physics knowledge\nExcellent communication and presentations skills\nCollaborative and open-minded\n\nWhat will put you ahead:\n\nExperience with wave-physics-based applications: non-destructive testing, medical ultrasound, seismic imaging, radar, or sonar\nSignal and image processing knowledge\nExperience with scientific computing including GPU programming\n2D/3D visualization and rendering experience (e.g., ParaView, 3D Slicer etc.)\nExperience with ultrasound simulation software (e.g., CIVA, K-Wave, Field II)\nExperience with ultrasound imaging techniques (e.g., FMC, PWI, TFM)\nExperience with ultrasound research systems (e.g., Verasonics, SARUS)\nFamiliarity with industrial ultrasound scanners (e.g., OmniScan, Topaz)"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}