{
  "title": "244876 - QA Analyst Intern 8 or 12 months - Summer 2025 - Req #20753",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "WORK DURATION: 8 or 12 MONTHS (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 8 and/or 12 months.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 or 12 Months"
    },
    {
      "key": "Job Title:",
      "value": "QA Analyst Intern 8 or 12 months - Summer 2025 - Req #20753"
    },
    {
      "key": "Job Location:",
      "value": "Remote"
    },
    {
      "key": "Region:",
      "value": "Remote"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, fully remote"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5 - 40"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Job Description\n\nDayforce, a global leader in Human Capital Management (HCM) with headquarters in Toronto, Ontario, and Minneapolis, Minnesota, operates across North America, EMEA, and APJ regions. Our Cloud HCM platform, recognized for its unified database and continuous calculation engine, enhances efficiency, productivity, and compliance for global workforces. We are committed to \"Making Work Life Better™\" for employees, customers, and partners worldwide.\n\nAs an Intern at Dayforce, you'll gain real-world experience with meaningful responsibilities, access to development programs, and the chance to collaborate globally, bringing new ideas and optimizing processes across multiple business units.\n\nLocation: Virtual\n\nDuration: 8 or 12 Months (May 2025 - December 2025 or April 2026)\n\nAvailability: *Full-time availability of 37.5 - 40 hours weekly is required to be eligible for this opportunity.\n\nBenefits for Students:\n\nExperience working for one of the fastest growing Human Capital Management technology companies in the world Access to Dayforce's development programs and resources\nAbility to work with as well as create relationships with members across the globe\nAutonomy to bring forth new ideas and optimize existing structures within the organization\nMeaningful responsibilities, enabling you to obtain 'real-world' experience\nDynamic hands-on exposure to multiple business-units and stakeholders across Dayforce\n\nAbout the opportunity:\n\nHired person in this Internship position will closely work with the Development Team and will directly report to the Development Manager. The QA Analyst Intern will be primarily responsible for contributing to test activities including test case development and execution of the test cases throughout the Product development life cycle. This is an excellent opportunity to join a rapidly growing innovator in a technically challenging and rewarding role. By working with a team of software enthusiasts, you will develop analytical and technical expertise and gain valuable business and industry-related experience.\n\nWhat you'll get to do :\n\nParticipate in requirements review and understand new feature development\nDevelops, documents, and maintains test cases\nParticipate in testing and execution of test cases\nAssist in designing, implementation, and execution of test cases for new and existing features\nCollaborate with software developers and Product team on QA/Testing topics\nPerform platform testing to uncover flaws within the interface\nContribute to our quality projects, including automation of test cases\nInvestigate, report, and track product failures to resolution\nIdentify and escalate issues related to plan and quality"
    },
    {
      "key": "Qualifications:",
      "value": "Skills and experience we value:\n\nIn progress College or University degree course in computer science, electrical engineering, or any other technical field\nGood understanding of software development principles\nUnderstanding of Software Development Life Cycle and relevant quality assurance concepts\nStrong analytical and problem-solving skills\nStrong communication skills both verbal and written\nAbility to work in a team environment\n\nWhat would really make you stand out:\n\nKnowledge of SQL and understanding of relational database system\n\nWhat's in it for you\n\nDayforce is fueled by the diversity of our talented employees. We are an equal opportunity employer and consider and embrace ALL individuals and what makes them unique. We believe our employees should be happy and healthy, with peace of mind and a sense of fulfillment.\n\nWe encourage individuals to apply based on their passions.\n\nDayforce encourages personal and professional growth. We offer excellent time away from work programs, comprehensive wellness initiatives and recognition through competitive pay and benefits.\n\nWith a commitment to community impact, including volunteer days and our charity, Dayforce Cares we provide opportunities for you to thrive both in your career and personal life. Our focus is not just on your job but on supporting you to be the best version of yourself.\n\nFraudulent Recruiting\n\nBeware of fraudulent recruiting. Legitimate Dayforce contacts will use an @dayforce.com or @Ceridian.com email address. We do not request money, checks, equipment orders, or sensitive personal data during the recruitment process. If you have been asked for any of the above, or believe you have been contacted by someone posing as a Dayforce employee, please refer to our fraudulent recruiting statement."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}