{
  "title": "245469 - IoT Systems & Mobile App Test Engineer Co-op",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "IoT Systems & Mobile App Test Engineer Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Job Description\nEmbark on a journey with Barnacle Systems, an award-winning marine electronics innovator with a waterfront office in Victoria, BC. At the heart of our mission lies the ambition to \"re-invent how people check on their boats\", safeguarding recreational and government vessels alike. As we stride forward in our venture, we're also deeply committed to environmental protection, taking the lead against the risks posed by abandoned boats. As part of our vibrant team, you'll step into a world where every voice is cherished,\nand every perspective contributes to the tide of innovation.\n\nJump into experiences that include:\nTesting cutting-edge mobile apps across both Apple and Android ecosystems.\nDelving deep with hands-on testing of our innovative circuit boards.\nNavigating the complexities of computer networks, broadening your troubleshooting horizons.\nCollaborating in a diverse and supportive atmosphere alongside dedicated software, electrical, and\nmechanical engineers.\nAt Barnacle, we are convinced that a mosaic of backgrounds and ideas is the secret to truly groundbreaking solutions. So, if you're someone who's curious, detail-oriented, and ready to bring your unique insights to a tight-knit team, then we're excited to set sail with you on this journey of innovation and growth."
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications\nA genuine passion for design and prioritizing an excellent user experience.\nCompletion of at least one year in an engineering program.\nA collaborative mindset, enthusiastic about working cohesively within a team of diverse professionals.\nOpen-mindedness to let your experience with Barnacle Systems guide your decision on a future career path, be it in software, computer, electrical, or mechanical engineering."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}