{
  "title": "244854 - Software Developer in Test Intern 8 months - Summer 2025 - Req #20744",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Work Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Software Developer in Test Intern 8 months - Summer 2025 - Req #20744"
    },
    {
      "key": "Job Location:",
      "value": "Remote"
    },
    {
      "key": "Region:",
      "value": "Remote"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, fully remote"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "Hiring Min Rate 28.2 CAD - Hiring Max Rate 32.3 CAD"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5 - 40 hours weekly"
    },
    {
      "key": "Number of Positions:",
      "value": "2"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Dayforce, a global leader in Human Capital Management (HCM) with headquarters in Toronto, Ontario, and Minneapolis, Minnesota, operates across North America, EMEA, and APJ regions. Our Cloud HCM platform, recognized for its unified database and continuous calculation engine, enhances efficiency, productivity, and compliance for global workforces. We are committed to \"Making Work Life Better™\" for employees, customers, and partners worldwide.\n\nAs an Intern at Dayforce, you'll gain real-world experience with meaningful responsibilities, access to development programs, and the chance to collaborate globally, bringing new ideas and optimizing processes across multiple business units.\n\nDuration: 8 Months (May 2025 - December 2025)\n\nLocation: Virtual\n\nAvailability: *Full-time availability of 37.5 - 40 hours weekly is required to be eligible for this opportunity.\n\nBenefits for Students:\n\nExperience working for one of the fastest growing Human Capital Management technology companies in the world Access to Dayforce's development programs and resources\nAbility to work with as well as create relationships with members across the globe\nAutonomy to bring forth new ideas and optimize existing structures within the organization\nMeaningful responsibilities, enabling you to obtain 'real-world' experience\nDynamic hands-on exposure to multiple business-units and stakeholders across Dayforce\n\nAbout the opportunity:\n\nThis role involves working cross-functionally to design, implement, and support new and existing features. Primarily focused on software development in testing, the individual will begin with manual QA reporting, and accessibility, before transitioning to automation testing. They will gradually take on development user stories, contributing to both QA and development initiatives.\n\n\nWhat you'll get to do:\n\nActively participate in continuous application improvements by developing and maintaining automated tests.\nCoordinate with team members, including developers, QA analysts, and product owners, to produce stable, maintainable, and reliable automated tests.\nEnsure automated tests effectively cover new product features and associated requirements.\nAnalyze test results and improve automated test coverage to maintain and enhance product quality.\nEnhance and implement automation framework code to expand automated test coverage.\nAdapt to new methodologies and technologies to improve automated testing processes.\nDevelop expertise in functional and technical aspects of the product across all areas.\nAttend team meetings, update timesheets, complete training courses, and maintain the scrum board.\nPerform manual QA tasks, including QA reporting, accessibility, and tax forms.\nTransition to contributing to automated testing for QA reporting, accessibility, and tax forms.\nGradually take on development user stories and expand responsibilities.\nGain exposure to the release process by taking on the scrum master role, if time allows."
    },
    {
      "key": "Qualifications:",
      "value": "Skills and Experience we value:\n\nUniversity degree in Computer Science or a related field.\nExperience in enterprise software development.\nProficiency in Object-Oriented Programming using C# and/or Java.\nStrong experience in writing maintainable code and creating automated test scripts with tools like Selenium, Cucumber, and JMeter.\nKnowledge of SQL and a solid understanding of relational database systems.\nStrong communication skills, both verbal and written.\nAbility to work effectively in a team environment.\nExperience working in an Agile development environment with a solid understanding of the development process.\nExperience with API testing.\n\nWhat would make you really stand out:\n\nSelenium and Specflow\nAgile\nExperience working in HCM\nExperience with performance testing tools and processes\n\nWhat's in it for you\n\nDayforce is fueled by the diversity of our talented employees. We are an equal opportunity employer and consider and embrace ALL individuals and what makes them unique. We believe our employees should be happy and healthy, with peace of mind and a sense of fulfillment.\n\nWe encourage individuals to apply based on their passions.\n\nDayforce encourages personal and professional growth. We offer excellent time away from work programs, comprehensive wellness initiatives and recognition through competitive pay and benefits.\n\nWith a commitment to community impact, including volunteer days and our charity, Dayforce Cares we provide opportunities for you to thrive both in your career and personal life. Our focus is not just on your job but on supporting you to be the best version of yourself.\n\nFraudulent Recruiting\n\nBeware of fraudulent recruiting. Legitimate Dayforce contacts will use an @dayforce.com or @Ceridian.com email address. We do not request money, checks, equipment orders, or sensitive personal data during the recruitment process. If you have been asked for any of the above, or believe you have been contacted by someone posing as a Dayforce employee, please refer to our fraudulent recruiting statement found here: https://www.dayforce.com/be-aware-of-recruiting-fraud"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}