{
  "title": "245236 - QA Automation, Co-Op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria\n\n\n8 OR 12 MONTH WORK TERM\n\nWe are only considering students who are able to commit to a 8 or 12 month Co-Op. Please include this in your cover letter.\n\nWork Duration: 8 or 12 months (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms).\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 or 12 Months"
    },
    {
      "key": "Job Title:",
      "value": "QA Automation, Co-Op"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "At Motorola Solutions we are helping solve some of the biggest challenges around safety and physical security by developing advanced artificial intelligence (AI) technologies and products that are used to help keep people, businesses, and cities around the world safer. Motorola Solution's designs, develops, and manufactures advanced AI, video analytics, network video management software and hardware, surveillance cameras, and access control solutions that help change the way people interact with their security systems.\n\nOur co-ops don't wash cars or do coffee runs. They also don't work on side projects. Our co-ops are treated like full team members and are given the opportunity to learn what being a developer is like in the real world. You'll have the opportunity to learn new technologies and best practices in coding, testing and automation.\n\nYou'll also have a lot of fun and make a lot of friends. For the duration of your work term, you will be a member of a multi-disciplinary engineering team responsible for the design and implementation of the next generation of Motorola's market-leading high-performance video solutions products.\n\nResponsibilities:\nAs a QA Tester you are responsible for improving our development efficiency and product quality through a strong skill set and great attitude towards software quality. You are successful within this role as you:\n\nReview and analyze product requirements and provide constructive feedback on clarity and testability\nCollaborate and work closely with feature developers on ensuring the quality of the feature through the development lifecycle\nPlan, design, document and perform tests for software and hardware products\nIdentify, reproduce, and report actual or potential product defects\nYour defect reports provide detailed configuration, reproduction steps, and descriptions for defect tracking, diagnostics, and resolution\nAs part of the product development team, you lead or assist other developers in the diagnosis and replication of product failures\nCreate and maintain documentation on test and development operations\nReview test automation reports and address failure points in the existing automation code"
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications:\nExperience you bring to the team includes:\n\nWorking towards a Bachelor's degree or equivalent qualifications in Electrical, Electro-Mechanical, Software Engineering, or Computer Science.\nYou are effective and enjoy working within teams of dedicated and passionate developers and QA testers.\nYou have experience in Python, Ruby, or another scripting or programming languages\nFamiliarity with and understanding of architectural and OO design patterns\nSelf-motivated with the ability to learn quickly,and independently and work within a team\nBeing comfortable with participating in group discussions about the task at hand\n\n\nIt would be of great benefit if you have:\n\nExperience with CI/CD pipelines\nExperience with Docker containers\nExperience in source control management tools\nExperience in software and/or hardware testing"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}