{
  "title": "244857 - Mobile Test Engineer Intern 4 months - Summer 2025 - Req #20760",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Mobile Test Engineer Intern 4 months - Summer 2025 - Req #20760"
    },
    {
      "key": "Job Location:",
      "value": "Remote"
    },
    {
      "key": "Region:",
      "value": "Remote"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, fully remote"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "Min Rate 28.20 CAD - Max Rate 32.30 CAD"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5 - 40 hours weekly"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Dayforce, a global leader in Human Capital Management (HCM) with headquarters in Toronto, Ontario, and Minneapolis, Minnesota, operates across North America, EMEA, and APJ regions. Our Cloud HCM platform, recognized for its unified database and continuous calculation engine, enhances efficiency, productivity, and compliance for global workforces. We are committed to \"Making Work Life Better™\" for employees, customers, and partners worldwide.\n\nAs an Intern at Dayforce, you'll gain real-world experience with meaningful responsibilities, access to development programs, and the chance to collaborate globally, bringing new ideas and optimizing processes across multiple business units.\n\nLocation: Virtual\n\nDuration: 4 Months (May 2025 - August 2025)\n\nAvailability: *Full-time availability of 37.5 - 40 hours weekly is required to be eligible for this opportunity.\n\nBenefits for Students:\n\nExperience working for one of the fastest growing Human Capital Management technology companies in the world Access to Dayforce's development programs and resources\nAbility to work with as well as create relationships with members across the globe\nAutonomy to bring forth new ideas and optimize existing structures within the organization\nMeaningful responsibilities, enabling you to obtain 'real-world' experience\nDynamic hands-on exposure to multiple business-units and stakeholders across Dayforce\n\nAbout the opportunity:\n\nWe're working on something big, and we need your help. Dayforce is launching our newest product, Flex Work, where we are redefining how the world thinks about work. Dayforce Flex Work is an on-demand marketplace that enables everyday people to take control of how they choose to work and earn money while helping our customers find more talent. This is your opportunity to join as a founding member of an innovative team and join our mobile team in developing an app from the ground up. On this team you will operate in a challenging, autonomous, and rewarding start-up environment with the resources of a proven and successful enterprise organization.\n\nWhat you'll get to do:\n\nWork with the mobile team to test Android & iOS apps and conducting defect tracking.\nIdentifying reproduction steps for reported issues by business team/users in production.\nPerform functional, usability, compatibility and acceptance testing.\nDevelops, documents, and maintains test cases.\nAssist in execution of test cases for new and existing features.\nParticipate in automating and execution of test cases using Appium."
    },
    {
      "key": "Qualifications:",
      "value": "Skills and experience we value:\n\nAbility to deal with multiple priorities and work in a fast-paced environment.\nComfortable with change and ambiguity.\nGood understanding of software development practices.\nSome experience with programming such as Java or Kotlin. (preferred)\n\nWhat's in it for you\n\nDayforce is fueled by the diversity of our talented employees. We are an equal opportunity employer and consider and embrace ALL individuals and what makes them unique. We believe our employees should be happy and healthy, with peace of mind and a sense of fulfillment.\n\nWe encourage individuals to apply based on their passions.\n\nDayforce encourages personal and professional growth. We offer excellent time away from work programs, comprehensive wellness initiatives and recognition through competitive pay and benefits.\n\nWith a commitment to community impact, including volunteer days and our charity, Dayforce Cares we provide opportunities for you to thrive both in your career and personal life. Our focus is not just on your job but on supporting you to be the best version of yourself.\n\nFraudulent Recruiting\n\nBeware of fraudulent recruiting. Legitimate Dayforce contacts will use an @dayforce.com or @Ceridian.com email address. We do not request money, checks, equipment orders, or sensitive personal data during the recruitment process. If you have been asked for any of the above, or believe you have been contacted by someone posing as a Dayforce employee, please refer to our fraudulent recruiting statement found here: https://www.dayforce.com/be-aware-of-recruiting-fraud"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}