{
  "title": "245188 - Security Analyst I - 4 Month Co-op/Internship (Summer 2025)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Security Analyst I - 4 Month Co-op/Internship (Summer 2025)"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "No"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$55,700-$66,120"
    },
    {
      "key": "Hours per Week:",
      "value": "35"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "End Date:",
      "value": "08/22/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Our employees are at the heart of everything we do. Together, we help people, businesses, and society prosper in good times and be resilient in bad times.\n\n\nOur employee promise represents Intact's commitment to you in exchange for living our Values, striving to do your best work, being open to change and investing in your career. In return, we promise to provide support, opportunities and performance-led financial rewards at a workplace where you can shape the future, win as a team and grow with us.\n\nAbout the role\n\nLaunching your career at Intact means joining a diverse community of experts that trust and value your skills in an industry that is constantly evolving. Here, you'll receive mentorship and coaching in a dynamic hands-on environment. You'll drive innovation and make a meaningful impact in our organization, for our customers, and across our communities. You'll grow personally and professionally with access to advanced learning platforms and make lasting connections near and far. Most importantly, you'll discover how exciting the \"real world\" can be.\n\n\nHere, your career will take off\n\nAt Intact, we're leading an insurance transformation to better protect people, businesses and society. We want future talent - like you - to help us lead the charge. Join our team as a Security Analyst I for the Summer 2025 term. In this role, you'll make a difference while building the skills and experience that will propel your career forward.\n\nWe are looking for 1 intern to join our Governance, Risk, and Compliance security team!\n\nWhat you'll do here:\n\nBe the first point of contact to handle the team's intake requests for cybersecurity risk and compliance related activities\nSupport and maintain the risk register, derogations, and third-party risk assessment-related activities\nWork closely with the team's Scrum Master or Product Owner and other stakeholders to prioritize and triage requests\nMaintain the repository for baseline documentation and standard operating procedures\nAssist the team's Business Analyst to prepare and report on Cybersecurity metrics and key indicators\nOversee documentation, implementation and testing for the organization's cybersecurity risk management tools\nAct as an expert in security incident response within the security monitoring team and on other security initiatives and projects.\nStay up to date with information security newsfeeds, techniques and trends, threat landscape, attacks techniques, detection methods, etc.\nMake recommendations to improve security monitoring and provide advisories to other teams and projects to improve the company's protection.\nExecutes periodical review procedures for IT security procedures by producing relevant reports and by following up with accountable stakeholders."
    },
    {
      "key": "Qualifications:",
      "value": "What you bring to the table:\n\nCurrently pursuing a Bachelor's (or Master's, if applicable) degree in Cybersecurity, Information Technology, Computer Science, Computer Engineering, or Software Engineering\nAvailable to work with us full-time, 35 hours per week, for the Summer 2025 Term (May to August)\nMust be an active student during your internship and/or returning to school in Fall 2025 following your internship\nPast internship experience in security is considered an asset\nExcellent oral and written communication skills (English and/or French preferred).\nAbility and desire to learn/adapt quickly to a changing environment\nKnowledge in security concepts such as, GRC (governance, risk, and compliance), risk assessments, mitre attacks, vulnerability, threat risk assessment, etc.\nExperience in Python, PowerShell Scripting, AWS, Azure, GCP, and/or OCI is considered an asset\nExperience with control testing or reviewing operating systems and databases, and/or incident response is considered an asset\nExperience using Microsoft Visio is considered an asset\nWorking towards one of these certifications would be a considerable asset: CISSP, CISA, CISM, CGEIT, CRISC, GSEC, GISP\n\nThe annual salary range of the successful candidate will typically be positioned between the following, taking into consideration a number of factors including prior experience, qualifications, anticipated contribution to role, location and internal equity: $55,680 - $66,120."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}