{
  "title": "244999 - Software Engineer Intern, Backend - Montreal",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Must be fluent in spoken and written English and have a working proficiency in French.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria\n\nResources for living and working in Montreal:\n\nTourism\nStatistics\nReviews\nTransportation\nAccommodation - Rentals\nThings to do"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Software Engineer Intern, Backend - Montreal"
    },
    {
      "key": "Job Location:",
      "value": "Montreal"
    },
    {
      "key": "Region:",
      "value": "QC-Montreal"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "At Lyft, our purpose is to serve and connect. To do this, we start with our own community by creating an open, inclusive, and diverse organization.\n\nWe care deeply about delivering the best transportation experience; this means the best experience for the passenger and the best experience for the driver. We believe this quality of service can only be achieved with a deep understanding of our world, our cities, our streets… how they evolve, how they breathe.\n\nInterns work side-by-side with top engineers in the industry while having autonomy from the get-go. They contribute to user-facing products and are able to see their work go live quickly. Lyft fosters a collaborative environment in the office, so there's always a sharp mind eager to hear about your next idea. So what's yours?\n\nResponsibilities:\n\nOwn your project, while checking in with other team members throughout the day with questions and updates\nYou leave the code in a better state than when you found it (progressive refactor)\nYou value reliability, ensured by testing (unit, integration and load tests)\nParticipate in code reviews to ensure code quality and distribute knowledge\nIntegrating and deploying according to the CI/CD practice\nGo home knowing that your work today is meaningfully improving the lives of every Lyft driver and every Lyft rider!"
    },
    {
      "key": "Qualifications:",
      "value": "Experience:\n\nCurrently pursuing a Bachelor's or Master's degree in Computer Science from a university in Canada, with a graduation date between December 2025 and Summer 2026 (required). For any candidates who are master's students who worked between their bachelor's and master's programs: candidates should also have less than 2 years of relevant full-time work experience.\nAvailable during Summer 2025 for the internship in Montreal\nStrong knowledge of CS fundamentals\nExcellent communication skills\nPassion for community, sustainability, and/or transportation\nAbility to thrive in a startup environment\nExperience with real-time technology problems\nContributions to open source projects\nExperience working with databases\nExperience solving real-time technology problems\nMust be fluent in spoken and written English and have a working proficiency in French\n\nBenefits:\n\nMental health benefits\nIn addition to holidays, interns receive 2 days paid time off and 3 days sick time off\n\nLyft proudly pursues and hires a diverse workforce. Lyft believes that every person has a right to equal employment opportunities without discrimination because of race, ancestry, place of origin, colour, ethnic origin, citizenship, creed, sex, sexual orientation, gender identity, gender expression, age, marital status, family status, disability, pardoned record of offences, or any other basis protected by applicable law or by Company policy. Lyft also strives for a healthy and safe workplace and strictly prohibits harassment of any kind. Accommodation for persons with disabilities will be provided upon request in accordance with applicable law during the application and hiring process. Please contact your recruiter now if you wish to make such a request.\n\nThis role will be in-office on a hybrid schedule - Team Members will be expected to work in the office 3 days per week on Mondays, Thursdays and a team-specific third day."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}