{
  "title": "245468 - Technical Operations and Software Platforms Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Work Duration: 4 or 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 4 and/or 8 months.\n\nNote for Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months or 8 Months"
    },
    {
      "key": "Job Title:",
      "value": "Technical Operations and Software Platforms Co-op"
    },
    {
      "key": "Job Location:",
      "value": "North Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$34.23 per hour"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "End Date:",
      "value": "08/29/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Please fill and submit the attached Co-op Questionnaire with your application.\n\nA career at ICBC is an opportunity to be part of a talented, diverse and inclusive team that is driven to serve its customers and community. Make the most of your skills and take the opportunity to grow and develop your career. ICBC is an equal opportunity employer, and invites applications from all qualified candidates. You can expect a competitive salary, comprehensive benefits and a challenging work environment. Drive your career with us.\n\n\nJob Title: Technical Operations and Software Platforms Co-op\nEmployment Type: Co-op Student\nLocation: North Vancouver\nHours of Work: 7.5 hr Day Shift (5 days M-F) (8 days per month or 2 days per week in office)\nPay: $34.23 per hour + 11.2% in lieu of vacation and stat\nDuration: 4 months with options to renew\n\n\nICBC is searching for a motivated student who is intrigued by all things technical. Our co-op opportunity will provide practical, hands on experience in one of the largest IT shops within British Columbia. This is your opportunity to gain exposure to complex enterprise level technology and software platforms. Our teams support over 650 applications from COTS ERP systems to home-grown specialty applications.\n\n\nPosition highlights\nWe have an opportunity for a Co-op with technical interests to join one of our Technical Operations or Software Platforms team and help support our clients across the province. This team supports a number of different infrastructure and software platforms.\nYou will be in the centre of an operational department assisting in sustaining our platforms in support of business change. This work will help you gain experience in:\n\nSystems administration and technical support\nIncident response and resolution\nLevel 2 problem and root cause analysis\nScripting and automating maintenance tasks\nConsulting with application development teams\nTechnical implementation and delivery\nAnalysis and automation of operational and project processes\nSystem monitoring and enhancements"
    },
    {
      "key": "Qualifications:",
      "value": "Position requirements\nExperience in the following technical skills would be an asset:\n\nDatabases (SQL Server, Oracle)\nData Science (Hadoop, Python, R)\nScripting technologies (e.g., PowerShell) or programming skills (Java or .Net)\nDirectory services (LDAP, AD)\nWindows 7/10, Windows Server 2012\nLinux (RedHat)\nAutomation technologies (Ansible, Jenkins, SVN, SCCM)\nMonitoring technologies (Splunk, Nagios, SCOM, Opnet)\nDirectory services (AD, LDAP) and Group Policy (GPO)\nKnowledge of Hybrid Cloud Platforms and multi-site operational support (e.g. Microsoft Azure and M365)\n\n\nThe following basic skills will be required:\n\nOrganized and delivery focused\nGood communication - written and verbal\nUnderstanding basic business processes and IT processes and functions (e.g., network, server, databases, storage, access management, patching, etc.)\nGreat attention to detail\nIT-related education\nSelf-motivated\nAble to work with minimal supervision"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}