{
  "title": "244917 - Co-op/Intern Student - Data Management Specialist (16 Months)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "16 MONTH WORK TERM\n\nWork Duration: 16 months (A 16 month employment period is registered as 4 separate, consecutive work terms). Please ONLY apply if you are available for 16 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "16 Months Full Time (4 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Co-op/Intern Student - Data Management Specialist (16 Months)"
    },
    {
      "key": "Job Location:",
      "value": "Calgary"
    },
    {
      "key": "Region:",
      "value": "AB-Calgary"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Date: Dec 23, 2024\n\nLocation: Calgary, AB, CA, T2A 7V2\n\nCompany: Spartan Controls Ltd.\n\nSpartan Controls is an employee-owned company and leading provider of data management, industrial automation, valves, measurement and control solutions for process industries in Western Canada and beyond. We are dedicated to providing exceptional sales, support and service experiences for our diverse customer base in industries such as mining, power, oil & gas, municipal, pulp & paper, and chemical.\n\nSpartan is committed to creating a sustainable modern world with innovative automation. Our focus is Customer Outcomes. By leveraging applied automation we assist customers improving their Safety, Reliability, Operations and Productivity.\n\nOur employee ownership model creates a unique culture of community, creativity, entrepreneurship, and a place to build your career. Spartan Controls provides an environment that not only encourages you to do your best, but also empowers you to do what it takes to create a solution, address a need, or respond to an issue.\n\nSummary\n\nJoin our innovative Digital Foundations team based in Calgary as a Data Management Specialist Co-op/Intern Student. Reporting to the Manager of Operations, you'll contribute to the installation, data connectivity, and system integration of industrial data software applications, providing valuable support to our customer-focused initiatives.\n\nRole and Responsibilities\n\nAs a Co-op/Intern Student, you will have the opportunity to:\n\nInstallation, data connectivity and system integration of the following software applications (AVEVA PI, Capstone DataPARC and Aspentech IP.21)\nTesting of existing software applications for on-premises, virtual and cloud-based deployment\nContribute to the creation of documentation for client use.\nCreation of operational displays and dashboards.\nCreating of Hierarchical templates for managing customer data.\nCollaborate with the broader Digital Foundations team to enhance internal processes.\nThe current expectation of all work being executed from the Spartan Controls office.\n\nThis 16-month opportunity provides hands-on experience in a dynamic and collaborative environment, allowing you to apply yourself to real-world projects and support. Join us in shaping the future of digital solutions at Spartan Controls!\n\nAs part our recruitment process, successful candidates will be required to pass a pre-employment security background check.\n\nSpartan recognizes that there are many ways in which candidates develop knowledge, abilities, and competencies throughout their careers. We encourage applications from candidates with a variety of backgrounds and we do consider qualifications and competencies that are equivalent to those specifically mentioned above.\n\nClose Date: January 19, 2025 (11:59 pm MST)\n\nRequisition ID: 1394"
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications and Skills\nCurrent Engineering or Technologist student, preferably in Computer Science, Software Engineering, Electrical Engineering, Instrumentation Technology.\nStudents enrolled in a post-secondary Co-op/Internship program, returning to school in September 2026 are preferred.\nSolid technical problem-solving skills.\nStrong communication and time management skills.\nFamiliarity with databases and process data historians (e.g. AVEVA PI), or visualization tools (e.g. Power BI) is advantageous - training will be provided.\nUnderstanding of industrial networks, servers, and work stations are an asset.\nA working knowledge of a programming language is beneficial however not required- please highlight this in your application.\nDemonstrated Customer Service in a professional environment is an asset.\nCollaborative team player and strong work principles.\nProficiency in MS Office programs (Word, Power Point, Excel)\nDetail oriented with an entrepreneurial work ethic."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}