{
  "title": "245184 - DCS FIRMWARE ENGINEER CO-OP",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "DCS FIRMWARE ENGINEER CO-OP"
    },
    {
      "key": "Job Location:",
      "value": "Burnaby"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$22.75-$34.50 per Hour"
    },
    {
      "key": "Hours per Week:",
      "value": "40"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "End Date:",
      "value": "08/22/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Job Description :\n\nAs a Storage Firmware Engineer Co-op, you will join a team of professionals in developing real-time firmware for state-of-art System-on-Chip (SoC) devices with embedded MIPS processors. Your responsibilities will include:\nDesign, develop, integrate, debug, and verify state of the art quality firmware for embedded SoC devices.\nLearn aspects of relevant technical specifications and incorporate those details into firmware designs and implementations.\nCollaborate with other firmware teams and interact with chip design, validation and application engineering teams on pre-silicon firmware development and post-silicon debug/troubleshooting.\nCreate and participate in design and code reviews.\nUtilize analyzers and firmware debug tools to troubleshoot difficult problems reported by internal test/development teams and by global customers.\nWrite comprehensive engineering design documentation and customer user guides.\nAssist in the execution and evolution of the development process."
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications:\n\nCourse-level or work experience with embedded firmware development.\nPractical experience and/or exposure to hardware systems and their interaction with embedded firmware.\nC language programming and aptitude for debugging embedded system issues.\nUniversity or intern-related exposure to RTOS constructs including threads, scheduling, synchronization, memory management.\nExcellent analytical, problem solving, and documentation skills.\nEffective communicator of technical ideas, both verbal and written.\nSelf-motivated and team-oriented individual with the ability and resourcefulness to achieve goals with minimal supervision."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}