{
  "title": "245506 - Application Development Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Work Duration: 4 or 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 4 and/or 8 months.\n\nNote for Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months or 8 Months"
    },
    {
      "key": "Job Title:",
      "value": "Application Development Co-op"
    },
    {
      "key": "Job Location:",
      "value": "North Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$34.23 per hour"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "End Date:",
      "value": "08/29/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Please fill and submit the attached Co-op Questionnaire with your application.\n\nA career at ICBC is an opportunity to be part of a talented, diverse and inclusive team that is driven to serve its customers and community. Make the most of your skills and take the opportunity to grow and develop your career. You can expect a competitive salary, comprehensive benefits and a challenging work environment. Drive your career with us. We welcome applications from all qualified job seekers. If you are a job seeker with a disability, please let us know so we can support you in delivering your best performance.\n\n\nJob Title: Application Development Co-op\nEmployment Type: Paid Co-op\nLocation: North Vancouver\nHours of Work: 7.5 hr Day Shift (5 days M-F) (8 days per month or 2 days per week in office)\nPay: $34.23 per hour + 11.2% in lieu of vacation and stat\nDuration: 4 months with options to renew\n\n\nPosition Highlights\nWorking as a member of ICBC's Software Development Lifecycle team, you will be developing and managing solutions used by our Insurance, Claims, or Driver Licensing lines of business. You will work with industry-leading technologies, including SAP, Guidewire's suite and other Java-based platforms and be part of a talented, diverse and inclusive team in an environment that promotes growth and development."
    },
    {
      "key": "Qualifications:",
      "value": "We are looking for a qualified co-op student who will:\n\nPlay a supporting role for development teams within IS Claims, Insurance, Driver Licensing or SDLC\nAnalyze P1 & P2 incidents of applications in production, and assist with post-incident reviews (PIR)\nGather and analyze user requirements for new application functionality\nDevelop web prototypes, system enhancements, big fixes or automation solutions\nCreate/update system documentation\nCreate/modify reporting solutions\nHave an ability to work cooperatively within a team environment and other departments to provide support for data integration, data analysis and data visualization\n\n\nPosition Requirements\nThe ideal candidate will have the following:\n\nGood understanding of client-server and web technologies\nGood understanding of Java, .NET/C# (UNIX would be a bonus), and SQL database queries\nGood understanding of React, Next.js, SQL & RESTful API design patterns\nExperience with cloud service providers such as AWS, Azure.\nGood understanding of standard web technologies and libraries (i.e., HTML, CSS, JavaScript and JQuery)\nGood understanding of quality assurance practices relating to software development\nExperience with version control tools (e.g. GitLab) or creating Git based CI/CD pipelines.\nAbility to work cooperatively within a team environment and other departments to provide support for data integration, data analysis and data visualization\nExcellent inter-personal skills and communication/presentation skills\nExcellent organizational and writing skills"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}