{
  "title": "245335 - Software Developer In Test - Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "WORK DURATION: 8 MONTHS (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Software Developer In Test - Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$24.00 To $30.00 Hourly"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Redbrick and Shift are headquartered on the traditional Coast Salish territory, and we respectfully acknowledge the Lekwungen and WSÁNEC People of this region. With gratitude, we live, work, and care for this beautiful land.\n\nShift, a Redbrick portfolio company, is a general-purpose browser built to help customers enhance their browsing experience with greater focus and better results. By customizing Chromium's\n\nopen-source browser to offer beautifully designed features and integrated apps, we're redefining the way you use your browser and truly helping you get what you really need on the web. Our Shift team is 45 people strong and works closely with Redbrick's shared People Operations, Finance, and Creative/Marketing teams.\n\n\"I was lucky enough to start Shift as a co-op and I'm thrilled to start my full time position very soon! The team members I work with are among the most creative, supportive, and fun people I've met. It's the perfect environment to transform ideas into action when you're surrounded with an abundance of resources and brilliant people. It has truly been a joy and I'm excited to launch my career at Shift!\"\n\n- Joanna, Shift\n\nWe are changing the way browsing happens, and building an exceptional team is our top priority. We cheerlead your goals and accomplishments and are invested in your future. In line with putting your health and safety first, we provide our team with the freedom and flexibility to work where they work best. Most of our team enjoys a blend of remote and in-office work. In-office time brings many perks, and we also place an emphasis on planning events and fun that all can enjoy.\n\nWhat does a day look like in my role?\n\nWe get it: You need to know what you're signing up for before you apply, right? This is what you need to know: As a Software Developer in Test Co-op, you'll be responsible for:\n\nTesting changes to our software to ensure a high level of quality.\nReproducing problems reported by our customers.\nProviding technical assistance to our customer success team.\nFixing bugs and implementing new test automation framework.\nReviewing code written by team members to maintain best practices and quality.\n\nHalfway through your co-op:\n\nYou have made several impactful code changes, they have been merged into the test suite.\nYou know our product well and can answer common technical questions about it.\nYou can test most changes and be confident you've identified any problems.\nYou've helped onboard new team members, sharing product and test automation knowledge to bring them up to speed.\nYour work-term project is well underway.\n\nAt the end of your co-op:\n\nYou are a fully contributing member of the development team.\nYou're the point person for tackling complex problems faced by the customer success team.\nYou've mastered our product and test suite, and are comfortable with the codebase.\nYour work-term project is complete."
    },
    {
      "key": "Qualifications:",
      "value": "What we would like to see in you.\n\nEvery Shift team member has three things in common: We're curious, hungry and good-humoured. We try our best to balance hard work with good, old-fashioned fun. As a Software Developer in Test Co-op with Shift, there are extra superpowers we're on the lookout for:\n\nKnowledge of or experience developing or testing at least one of:\nDesktop applications.\nDynamic web applications.\nHTTP APIs using JSON.\nKnowledge of some languages such as Java, C#, JavaScript or Python.\nComfortable in an Agile (Scrum or Kanban) environment.\nThoughtful about the end-user experience.\nManual or automated testing experience.\nGood knowledge of HTML, CSS, and web technology.\nGit and Github experience.\nExcellent written communication skills.\n\nSalary Range: $24.00 To $30.00 Hourly\n\nPlease note: This co-op is listed as ideally an 8-month co-op but we will consider a 4-month co-op with a 4-month work term to make up 8 months total.\n\nWhat next?\n\nIf you're picking up what we're putting down, applying is easy as 1, 2, 3.\n\nApply with your cover letter and resume and take this opportunity to tell us your story and why you'd be a good fit on our team. Please apply here.\nDownload Shift -- we want to hear what you think!\nBe sure to follow us on Facebook, Linkedin, and Instagram for all that is happening at Shift!\n\nShift and Redbrick are committed to having a diverse environment where everyone can be their true authentic selves. We value all differences as they are essential for a thriving, happy, and productive workplace. Come join us and help build a disruptive company where we are all proud to belong."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}