{
  "title": "245149 - Acoustical Engineering Intern",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Acoustical Engineering Intern"
    },
    {
      "key": "Job Location:",
      "value": "Burnaby"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "No"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "3500-4500 monthly"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5"
    },
    {
      "key": "Start Date:",
      "value": "05/01/2025"
    },
    {
      "key": "End Date:",
      "value": "12/31/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "ACOUSTICAL ENGINEERING INTERN CO-OP\n\nFrom hospitals, to tech offices, to highways and everything in between, the infrastructure that surrounds us needs acoustical design. We're in the business of ensuring that sound and vibration gets due consideration so it doesn't cause disturbance or detract from the intended function of sensitive spaces.\n\nBKL Consultants Ltd. (BKL) is currently seeking a co-op student who has a demonstrated interest in the field of acoustics. If you have taken some relevant courses in sound or vibration, or have relevant background or experience, we'd love to hear from you.\n\nWHAT YOU'LL DO/DUTIES AND RESPONSIBILITIES\nEach employee at BKL works on multiple different architectural and/or environmental projects. As an acoustical engineering intern, you will be working under a number of different acoustical consultants throughout the internship and will be exposed to acoustical work in various industries and sectors.\n\nWe will provide the training necessary for you to carry out various duties but we will also expect the student to research some aspects of the job independently, with guidance from other team members.\n\nIn any given day may consist of the following work:\n\n\nProgramming and setting up noise or vibration monitoring systems in the field;\n\nCarrying out exterior and interior noise calculations;\n\nPreparing proposals, memos, letters, and reports for routine types of projects;\n\nRefining systems for managing acoustical products, software, and instrumentation; and\n\nAssisting other engineers making other types of sound and vibration measurements in the field.\n\n\nMost work is expected to be office-based and at project sites in the Lower Mainland, but brief site visits to other locations in BC may be required.\n\nCO-OP AT BKL\nWant to know what your day might look like? Here's a blog about what it's like to be a co-op student at BKL.\n\nABOUT US\nAs British Columbia's premier acoustical consultancy since it opened its doors more than 50 years ago, BKL works with governments, facility owners, and consultants to provide accurate acoustics, noise, and vibration assessments and solutions. BKL's team of 17 acoustical engineers and scientists has more than 150 years of accumulated experience in acoustics. An extensive complement of specialized instrumentation and software supports the technical staff. Further details are provided on our web site at www.bkl.ca."
    },
    {
      "key": "Qualifications:",
      "value": "WHO YOU ARE/QUALIFICATIONS\n\nAn enthusiastic learner who takes pride and responsibility in their work\n\nGood verbal and written communication skills\n\nEnrolled in either engineering and/or science program\n\nAlready completed at least one or two co-op terms previously\n\nGood computing skills, specifically proficiency in Excel\n\nQuick learner - able to understand new programs quickly and to retain procedures necessary to utilize specialized instrumentation and computer software\n\nValid driver's licence"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "3"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "1"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}