{
  "title": "245034 - Software Development Engineer Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nLOCATION IS NOT IN VICTORIA\nIt is recommended that you speak to your ability to relocate for this position in your cover letter. If you are taking courses in / are from the job location, it is recommended that you mention this in your cover letter. Please do not apply for this position if you are not willing to relocate for the duration of the work term without expectation of remuneration.\n\nNEED HELP TO RELOCATE?\n\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Software Development Engineer Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Apera AI is seeking a talented co-op student to join our team as a Software Development Engineer. You will work closely with a small group of ambitious engineers and applied scientists who are dedicated to building the future of robotic perception using cutting-edge technologies in computer vision and machine learning.\n\nYour job will include:\n\nWorking with our engineers on developing the next generation robot calibration algorithms\nWorking closely with our software engineering team in an Agile environment\nDeveloping with Qt to add new features to the Apera VUE UI\nAdding or improving features to the Apera VUE backend, written in C++\nTesting and improving of Apera's camera and robot calibration routines and algorithms\nContributing to general software activities, such as participating in code review\nCreating robot programs showing upcoming Apera Vue features\nExperimenting with different hardware combinations to confirm system design parameters\nContributing to the general software development activities\n\nAbout Apera AI:\nApera AI helps manufacturers make their factories more flexible and productive. Robots enhanced with Vue robotic vision software have 4D Vision-the ability to see and handle objects with human-like capability. Challenging applications such as bin picking, sorting, packaging, and assembly are now open to fast, precise and reliable automation. Apera AI is led by an experienced team from high-growth companies focused on robotics, artificial intelligence, and advanced manufacturing."
    },
    {
      "key": "Qualifications:",
      "value": "About you:\nWe are looking for someone who is enthusiastic, driven, and eager to learn. You have a natural curiosity for problem-solving and a passion for applying scientific principles to real-world challenges. You thrive in a dynamic environment and are excited about the opportunity to make a meaningful contribution to our company.\n\nJob Requirements:\n\nStrong programming skills (data structures, algorithms, OO)\nStrong linear algebra fundamentals\nC++ development experience\n\nDesirable qualifications:\n\nExperience with working in Linux environment\nFamiliarity with computer vision algorithms (classical and ML)\nExperience with software debugging tools and technique\nFamiliarity with digital imaging and optics"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "1"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}