{
  "title": "245395 - Engineering Student, Security - Summer 2025",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "RESTRICTION TO ELIGIBILITY (CONTROLLED GOODS PROGRAM)\n\nThis opportunity is posted by a company subject to Canada's CGP (Controlled Goods Program). Security screening is required for employees, which includes the following:\n\nProof of citizenship\nProof of residence\nCriminal records check (Canada)\nCertificate of good conduct from each country where the individual has resided for six consecutive months or more\n\nWORK DURATION: 8 MONTHS (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four.\n\nNEED HELP TO RELOCATE? If you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section \"Co-operative Education Travel Awards for Work Terms outside Victoria\"."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Engineering Student, Security - Summer 2025"
    },
    {
      "key": "Job Location:",
      "value": "Richmond"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$23.00 - $26.00/hour"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Engineering Student, Security - Summer 2025\n\nJob category: Engineering\n\nRequisition number: ENGIN008365\n\nDescription\n\nBuilding the space between proven and possible, MDA Space (TSX:MDA) is a trusted mission partner to the global space industry. A robotics, satellite systems and geointelligence pioneer with a 55-year+ story of world firsts and more than 450 missions, MDA Space is a global leader in communications satellites, Earth and space observation, and space exploration and infrastructure.\n\nThe MDA Space team of more than 3,000 space experts in Canada, the US and the UK has the knowledge and know-how to turn an audacious customer vision into an achievable mission - bringing to bear a one-of-a-kind mix of experience, engineering excellence and wide-eyed wonder that's been in our DNA since day one. For those who dream big and push boundaries on the ground and in the stars to change the world for the better, we'll take you there.\n\nAre you ready to launch the next stage of your career in the new space economy? We would love to hear from you!\n\nOur mission is to turn data into insight. From detecting changes in fragile ecosystems to monitoring northern ice floes and shipping routes, our near-real time data of Earth observation and the environment makes our Geointelligence team a leader in geospatial imagery, ground stations, enterprise geospatial systems and defence programs.\n\nDetails\n\nWe're on the hunt for an Engineering Student, Security in our Systems Security Team at our Richmond office, starting May 2025.\n\nOverall the successful candidate would be treated similar to a new graduate joining our company, where tasks will be assigned relative to the level of schooling and experience achieved to date. This is an 8 month term Student opportunity. Longer terms are possible.\n\nAs a member of the Engineering team, you will work on our programs such as CHORUS, Canadian Surface Combatant (CSC), Square Kilometer Array (SKA) radio telescope, Aeronautical Navigation products, and Marine Insights products. Where you will work as part of a technical team to develop new capabilities, enhance existing capabilities and deliver solutions to our customers.\n\nAs our Engineering Student, Security you will work within the Engineering organization to support the definition of a secure systems delivery model for customers around the world. This is not an IT support job where you're on a help desk, instead you'll be part of team building a secure system for use in a technically demanding environment. This includes supporting the team as they design and architect the system, develop and manage security requirements, analysis of products and technologies to build the solution and the articulation of key technology trends regarding secure systems development. As part of a team, you will work with security subject matter experts who are working on the cutting edge of developing secure systems. Specific tasks include the following:\n\nResponsibilities:\n\nDeveloping security related artefacts supporting secure systems development;\n\nInvestigation and analysis of security tools for use in the development, assessment and test of secure systems;\n\nSupporting the development of the security design and architecture by mapping security mechanisms to customer problem statements;\n\nSupporting the development of security documents (e.g. specifications, test plans, reports); and\n\nWorking hands on in a lab and integration environment."
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications:\n\nEnrolled a Bachelor's degree in Engineering, Mathematics, Computer Science or other relevant field focusing on information security.\n\nA keen interest in information security and a desire to learn more on how we need to build systems that can be trusted.\n\nPreferred Qualifications:\n\nThe qualifications below are a big plus, however, are not required\n\nExperience working with information or human security concepts including tools such as Metasploit, Kali Linux, Snort, Wireshark;\n\nExperience in application, user, network, mobile or cloud security;\n\nExperience with social media security concepts;\n\nSecure software development standards;\n\nExperience with scripting languages in Linux and/or Windows environments;\n\nExperience with cloud or distributed networking environments;\n\nJava, C/C++, Python, Ruby, and/or SQL Language(s); and\n\nVirtualization Technologies.\n\nComments/Special Considerations:\n\nTo be qualified you must be able to obtain and hold security clearance at a Reliability Status level and pass a security assessment for the Controlled Goods Program.\n\nMDA is an equal opportunity employer prizing diversity and inclusion. We are committed to treating all employees and applicants for employment with respect and dignity. If you require assistance and/or reasonable accommodation due to a disability during the application or the recruiting process, please feel free to notify us.\n\nSalary:\n\nThe compensation range for this position is $23 - $26 hourly."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}