{
  "title": "245008 - Implementation Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Part Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Implementation Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Why work for Pani?\n\nAs an Implementation Specialist co-op student at Pani, you will play a crucial role in driving our success by collaborating across departments to implement digital twins of our customers' plants and deliver tailored use cases within Pani's proprietary software system. You will receive training and have the opportunity to develop a diverse set of highly sought-after skills, including process engineering, Python coding and scripting, as well as expertise in water treatment engineering and processes. We don't do 'co-op projects' at Pani; you will be completely part of the team.\n\nAbout You\n\nYou have a passion for engineering and enjoy the challenge of working on innovative projects with an equally talented group of co-workers who will both challenge and support you. You believe in lifelong learning and welcome the opportunity to constantly iterate and improve upon your skills. Fundamentally you want to use your talents and energy to better the world for others and contribute to the responsible management of global water and energy, and CO2 reduction."
    },
    {
      "key": "Qualifications:",
      "value": "What you bring to the team\n\n3rd or 4th year student in a technical field such as mechanical, chemical, process, software or environmental engineering or equivalent experience\n8 month minimum commitment (this is non negotiable)\nExperience coding with Python for scripting and automating simple tasks.\nFamiliarity with reading and interpreting Piping and Instrumentation Diagrams (P&ID), Process Flow Diagrams (PFD), Block Flow Diagrams (BFD), and SCADA systems.\nA strong drive to ask \"why\" questions, demonstrating a curious mindset and a desire to understand the work deeply.\nComfort in working directly with stakeholders, fostering collaborative relationships.\nProactive in seeking clarification when faced with ambiguity, ensuring a clear understanding of tasks.\nAn aptitude for identifying communication gaps and miscommunication, contributing to effective collaboration.\nHigh general intelligence and exceptional problem-solving abilities, capable of navigating complex challenges.\nExcellent organizational skills, particularly in process management, to enhance operational efficiency.\n\nResponsibilities\n\nReview and interpret P&IDs, process flow diagrams, and datasheet of equipment (pumps, blowers, sensors, etc.)\nPerform initial exploration, cleaning, and quality assessment of historical plant data\nUpdate and execute Python and terminal line scripts and commands throughout the plant onboarding process.\nWrite and debug Python automation scripts used throughout the plant onboarding process.\nUnderstand the design and control of water treatment plants and processes and apply this knowledge to set up key performance indicators (KPIs) and optimization models\nUse Pani's toolbox to configure KPIs and models, set up charts, and custom reports\nAnalyze sensor data from plants and identify errors or anomalies\nUse engineering analysis and software unit testing to verify your own work and check the work of others\nWork with the engineering and software development teams to develop and improve internal onboarding tools to make the onboarding process more efficient\n\nNice to Have\n\nPrevious experience working for a SaaS startup\nCandidates based in the Pacific time zone, particularly those local to Victoria, are strongly preferred."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}