{
  "title": "245339 - Support Engineering Intern (Summer 2025)",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Support Engineering Intern (Summer 2025)"
    },
    {
      "key": "Job Location:",
      "value": "Remote"
    },
    {
      "key": "Region:",
      "value": "Remote"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, fully remote"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$5,500 per month CDN"
    },
    {
      "key": "Start Date:",
      "value": "05/27/2025"
    },
    {
      "key": "End Date:",
      "value": "08/15/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Company Description\n\nDropbox is a special place where we are all seeking to fulfill our mission to design a more enlightened way of working. We're looking for innovative talent to join us on our journey. The words shared by our founders at the start of Dropbox still ring true today. Wouldn't it be great if our working environment-and the tools we use-were designed with people's actual needs in mind? Imagine if every minute at work were well spent-if we could focus and spend our time on the things that matter. This is possible, and Dropbox is connecting the dots. The nearly 3,000 Dropboxers around the world have helped make Dropbox a living workspace - the place where people come together and their ideas come to life. Our 700+ million global users have been some of our best salespeople, and they have helped us acquire customers with incredible efficiency. As a result, we reached a billion dollar revenue run rate faster than any software-as-a-service company in history. Dropbox is making the dream of a fulfilling and seamless work life a reality. We hope you'll join us on the journey.\n\nTeam Description\n\nOver the years at Dropbox, Emerging Talent has created a variety of internships, apprenticeships, and early-in-career full time opportunities to build pathways for exceptional early career professionals to succeed at Dropbox. Supported by a community of mentors, program graduates, and fellow participants, our Emerging Talent programs are the perfect place to start your career in tech.\n\nRole Description\n\nAs a Support Engineering intern, you will focus on driving enablement initiatives that deliver impactful technology and process enhancements for Customer Experience (CX). By collaborating with cross-functional teams, you will optimize workflows, develop automation, and manage technology ecosystem that powers efficient and exceptional customer support. Your work will be instrumental in scaling CX operations and elevating customer satisfaction, ensuring we continuously improve both the customer experience and support efficiency.\n\nIn our Virtual First work culture, you'll connect with with Dropboxers virtually and in-person to build the foundation of a strong professional network.\n\nFor Summer 2025, we offer two start dates culminating in a 12-week internship:\n\n5/27 - 8/15\n6/24 - 9/12\n\nResponsibilities\n\nPerform enablement tasks to optimize CX platforms, including ticketing systems, knowledge bases, AI tools, and communication tools.\nTroubleshoot system issues and ensure high availability and performance.\nDevelop AI-driven workflows to streamline customer interactions, such as smart routing, predictive case resolution, and automated escalation handling.\nCreate dashboards and generate reports to monitor CX performance metrics.\nAnalyze data to identify trends and opportunities for process improvement.\nWork with cross-functional teams to align tools and systems with their needs.\nProactively suggest and implement enhancements to CX systems and processes."
    },
    {
      "key": "Qualifications:",
      "value": "Basic Qualifications\n\nCurrently pursuing an undergraduate degree in Computer Science, Information Technology, Information Systems, Systems Engineering, or a related field with an expected graduation in 2027\nEnthusiastic about problem-solving, process improvement, technology enablement and comfortable working both independently and collaboratively with cross-functional teams.\nKnowledge of APIs, system integration, and workflow automation tools\nHave experience working in various programming languages and development environments or possess a working knowledge of at least one programming language.\nStrong analytical and problem-solving skills, with the ability to identify and implement AI-driven solutions.\nGood communication and collaboration skills to work effectively with cross-functional teams.\nAdaptable, innovative, and passionate about leveraging AI for customer success.\n\nPreferred Qualifications\n\nTechnical Skills:\n\nFamiliarity with coding in various languages (e.g., Python, JavaScript, Java, .NET, Ruby, etc.).\nBasic understanding of AI/ML technologies.\nExperience deploying AI technologies in customer support environments.\nBackground in data science, software engineering, or CX enablement with a focus on AI.\n\nEffective Communication:\n\nIn addition to technical skills, the capacity to articulate complex technical ideas in simple terms is essential. Ensuring that customers comprehend solutions and instructions is a key aspect of the role.\n\nCollaboration:\n\nThis internship involves working closely with diverse teams like Global Support, Launch Readiness, and Engineering, Product, and Design. The ability to navigate uncertainties and collaborate effectively to address complex issues benefits both customers and Dropbox.\n\nCompensation\n\nCanada Pay Range\n\n$5,500-$5,500 CAD\n\nThe rate listed above is the expected monthly rate for this role, subject to change.\n\nBenefits\n\nDropbox is committed to investing in the holistic health and wellbeing of all Dropboxers and their families.\nOur benefits and perks programs include:\nCompetitive medical, dental and vision coverage\nFlexible Time Off/Paid Time Off, paid holidays, Company-wide PTO days, Volunteer time off\nPerks Allowance to be used on what matters most to you, whether that's productivity, learning & development, wellness, co-working space\n\nAdditional benefits details are available upon request."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}