{
  "title": "245298 - Hardware Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months or 8 Months, but 8 Months Preferred"
    },
    {
      "key": "Job Title:",
      "value": "Hardware Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Territorial Acknowledgement\nSchneider Electric Victoria acknowledges that our people are privileged to live and work in the traditional territories of the Lkwungen, Malahat, Pacheedaht, Scia'new, T'Sou-ke and WSÁNEC peoples. Schneider Electric endeavors to continue to work with Indigenous First Nations to respectfully acknowledge history and mutual goals for prosperity.\n\nCompany Values and Vision\nGlobally, Schneider Electric was ranked as the world's most sustainable corporation in 2021. Locally, we design products that enable industries to realize their decarbonization objectives, making the world a better place to live. Schneider Electric strives to be a company that is driven by meaningful purpose and continuously creates an inclusive working environment. We want to be the most diverse, inclusive and equitable company - globally.\n\nIf you think this is corporate lip service, check out our Diversity and Inclusion webpage. Our aim is to enable empowered, happy employees because we feel this unlocks creativity, curiosity, and innovation. By joining Schneider Electric, your career possibilities are diverse with opportunities locally and globally, spanning the full spectrum of technical domains.\n\nIntroduction to Schneider Electric in Victoria, BC\n\nSchneider Electric is excited to offer an opportunity to join the Hedgehogs team in Victoria, BC Canada. The Hedgehogs are a multi-disciplinary scrum team that designs, builds, and supports the best power metering products in the world. As a member of the Hedgehogs, you would join a collaborative, energetic and passionate team with global reach. Each team member is valued for their unique talents, and we strongly believe that we achieve more together. We collectively strive for continuous improvement, personal growth and having fun!\n\nWe build advanced power metering products such as the ION9000 and PM8000 which are used by utilities and industries around the world. Our products help customers make the most of their energy and in turn, decarbonize the planet. Our products are prize-winners! The ION9000 took the honors for the 2021 Engineers' Choice award.\n\nDescription of the Position\n\nAs a Hedgehogs team member, your work is planned in 3-week sprints in alignment with business needs and in collaboration with team members, Scrum Master and Product Owner. Your sprint commitment will be maintained at a sustainable level, supported by your Scrum Master.\n\nYour primary responsibility is to address business risk introduced by the global part and material shortage. During a weekly sync with the Supply Chain team, top risks are identified and progress is discussed. Risk mitigation includes activities such as:\n\nfind equivalent components\nhardware test\npeer review\ndocumentation and product BOM update\ndiscuss release plan\n\n\nAdditionally, opportunities will arise in alignment with your expertise or areas of interest. During the sprint planning ceremony, you can ask to take these opportunities in the capacity that helps the team. The Hedgehogs team supports a broad range of products, so the future of our backlog is often difficult to predict. What is certain: the backlog will evolve to the needs to the business, meaning new and exciting challenges surface often. As a result, we value team members willing to take on a wide array of challenges."
    },
    {
      "key": "Qualifications:",
      "value": ".Potential scope items:\n\nAssemble and commission a test fixture that emulates a test fixture in production. This will be used by the Engineering department to test before production release, increasing the chance of success and enabling iterative development.\nDesign and build a power supply tester that will be used by the Hedgehogs during product development and support. The design will include elements of 3D modelling, circuit design, Labview, soldering, wiring, testing and commissioning.\nHelp determine the evolution of a test cart used in the Engineering lab. Choose parts, get quotes, assemble a BOM, test it in parts.\n\n\nLet us learn about you! Apply today."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}