{
  "title": "244764 - Engineering Co-op Student - Operations Engineering",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "12 MONTH WORK TERM\n\nWork Duration: 12 months (A 12 month employment period is registered as 3 separate, consecutive work terms). Please ONLY apply if you are available for 12 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "12 Months Full Time (3 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Engineering Co-op Student - Operations Engineering"
    },
    {
      "key": "Job Location:",
      "value": "Estevan"
    },
    {
      "key": "Region:",
      "value": "Saskatchewan"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "No"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Hours per Week:",
      "value": "40"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "End Date:",
      "value": "04/30/2026"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Job Overview:\n\nThis is an exciting 12 month co-op student opportunity to provide support to Kingston Midstream engineers responsible for the design and project management of capital, expense, and ARO projects relating to the upgrade, maintenance, and retirement of liquid pipelines and facilities. The co-op student will primarily focus on supporting the Operations Engineering team with the development and execution of upgrade, maintenance, retirement, electrical, and control projects.\n\nPosition Responsibilities\n\nSupport project managers with their work and complete assigned tasks which could include:\n\nPrepare scope, designs, justification, estimates, economics, alternatives analysis, and documentation to evaluate project feasibility and to obtain approval and funding for projects\nDraft regulatory applications or notifications to be submitted for regulatory approvals for projects\nPrepare detailed designs, specifications, and drawing packages and have them approved by stakeholders\nPrepare specifications and work with supply chain management to procure materials and services in accordance with the Company's standards, policies, and procedures\nDevelop and compile documents and procedures needed for the safe execution of work\nConduct field visits to conduct construction site inspections, scope projects, or assist with commissioning\nMaintain project schedules, monitor cost tracking, update project forecasts and estimated in-service dates, place projects in service, and complete project status reports\nReview quality control packages upon completion of construction for completion and accuracy\nResearch and summarize applicable codes, standards, and regulations on an assigned item\nProvide technical and non-technical support on operational and engineering issues\n\nPotential opportunities to lead projects under the direction of a project manager which could include:\n\nPlan and implement work in accordance with the Company's HSE policies, Company engineering and construction standards, regulatory requirements, and applicable legislation\nCoordinate the efforts of internal and external departments, consultants, and contractors, including those outside the incumbent's engineering discipline, to ensure that the project scope, schedule, and budget meet company objectives\n\nOffice environment with occasional day travel throughout the Kingston Midstream pipeline system."
    },
    {
      "key": "Qualifications:",
      "value": "Skills and Qualifications:\n\nEnrolled in an Engineering program at a qualified education institution\nStrong analytical, communication, interpersonal, organizational, and computer skills\nAbility to work and communicate with internal and external stakeholders, including both office and field staff\nPossession of a valid Class 5 driver's license and an acceptable driver's abstract is an asset\nCandidates should include a copy of their university transcript with their application\n\nKingston Midstream is committed to providing a flexible work practice to allow office employees to work both from the office and from a remote location. This position may work remotely Mondays and Fridays and in Kingston Midstream's office Tuesday to Thursday.\n\nWe thank all interested candidates; however, only qualified candidates will be contacted.\n\nApplication Requirements: Please upload with your resume\n\nResume\nCover letter\nAcademic Transcripts (un-official or official)"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "1"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}