{
  "title": "245013 - Software Engineering Co-op/Internship (Summer 2025)",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Software Engineering Co-op/Internship (Summer 2025)"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Use your technical and problem-solving skills to help support our business clients with the many applications that they use. The British Columbia Investment Management Corporation (BCI) is currently seeking a Software Engineer Co-op/Intern to support our Enterprise Solutions team and the team's internal clients for the Summer 2025 work term (May to August).\n\nWHAT YOU NEED TO KNOW\n\nBCI manages a globally diversified portfolio of assets valued at $250.4 billion and is one of Canada's largest institutional investors. We invest globally to support pension and other funds for more than 30 clients based in British Columbia. We are proud to have been chosen as one of Canada's Top 100 Employers and BC's Top Employers. These national and provincial competitions recognize employers who offer exceptional workplaces for their employees.\n\nThe Software Engineer Co-op/Intern will work within our Technology department. They will be responsible for assisting the team in planning and delivering complex information systems assignments to ensure assigned applications are operational, current, and aligned to the Corporation's business needs. This is a great opportunity for you to learn and apply your knowledge to support a wide variety of applications used by our business clients.\n\nWHO YOU WILL WORK WITH\n\nThe Technology department is responsible for developing technology solutions that contribute to the achievement of BCI's mission and long-term goals. The department manages the corporation's business applications and information technology infrastructure, providing support to a large group of financial professionals. The department is also responsible for authoring technology-related directives and conducting disaster recovery planning to minimize risk to the corporation's delivery of investment services.\n\nThe Enterprise Solutions team works with other Technology teams as well as internal client departments and vendors to create configure, implement, and administer a portfolio of vendor and web-based applications.\n\nWHAT YOU WILL BE DOING\n\nProvide analytical and programming support for the development of new applications, and enhancement of existing custom, hosted, and packaged applications\n\nPerform day to day resolution tasks for problems that arise on complex systems on a variety of platforms\n\nResearch complicated problems; works with business representatives in defining design specifications and technical solutions, providing appropriate systems and/or business solutions\n\nPresent system solutions to clients, both verbally and by means of documentation to gain consensus for application enhancements and problem fixes\n\nTranslate user requirements into technical specifications\n\nIdentify system inadequacies and efficiencies and recommend improvements\n\nEngage with vendors to address operational needs\n\nParticipate in the change control processes for software releases and application upgrades\n\nAssist in the progression of systems changes through the application environments ensuring proper testing and approvals\n\nDocuments changes to procedures, applications, and data stores using standard tools and templates\n\nConduct business analysis sessions with clients - translates business needs into technical specifications employing workflow diagrams, data analysis and joint application reviews\n\nDevelop support documentation such as operational support model and technical user guides.\n\nMaintain support documentation and content into the application Jira and Confluence space repository\n\nParticipate in Kanban/Scrum to coordinate user stories and tasks in support of product owners\n\nProvide or arrange training on new procedures and applications functionality\n\nSupport the team members in daily operational tasks and special projects or assignments\n\nWHAT WE OFFER\n\nCareer development and training provided by experienced IT professionals to help build current industry skills\n\nThe chance to do work that will challenge and stimulate you\n\nWork with a dynamic team in a fast-paced environment\n\nThe development of real-world skills at one of the largest institutional investors in Canada\n\nExposure to some of the most talented, approachable, and inspiring people in the industry\n\nThe ability to opt-in for access to Dialogue, a user-friendly app that offers virtual primary care, employee and family services, and mental health supports\n\nTime to connect with co-op students & interns at BCI - build your network and shared learning\n\nBCI investment professionals lead a monthly Investment Club to share industry knowledge with employees who work in other departments\n\n2 paid days per year for volunteering\n\nCompetitive pay: Mid / Back Office: $2,260.00 gross bi-weekly or $2,090.00 gross bi-weekly + vacation leave paid based on 6% of salary ($2,260.00 gross biweekly for those with (or working towards) a graduate degree or joining the Investment Strategy & Risk department and $2,090.00 gross biweekly for those with (or working towards) an undergraduate degree, diploma, or certificate)\n\nTravel: if coming to Victoria for this work term, BCI will provide a fixed-rate travel allowance based on your location\n\nThe Details\n\nWork term: 4 Months (May - August 2025)\n\nDepartment: Technology\n\nOffice Location: 750 Pandora Avenue, Victoria, BC\n\nSpend your off hours exploring beautiful Victoria and Vancouver Island\n\nAll co-ops/internships will need to be completed in person at our Victoria office with the option to work one day per week from home. Please note, some positions are not eligible for hybrid work."
    },
    {
      "key": "Qualifications:",
      "value": "REQUIRED SKILLS\n\nUniversity-level knowledge of related courses (e.g., computer science)\n\nAnalytical, problem solving and design experience, and expertise in the use of programming tools and techniques\n\nTechnical writing skills\n\nFamiliar with source control tools (e.g. Git)\n\nFamiliar with creating workflow diagrams and flowchart processes\n\nAbility to use Excel, PowerPoint, Word, and Outlook\n\nExperience supporting third-party products and hosted solutions is an asset\n\nFamiliar with Agile methodologies and processes is an asset\n\nKnowledge of finance and capital markets is desirable\n\nTeam player who has the drive to continue learning, excel, and grow in a team oriented and dynamic environment\n\nAbility to communicate clearly and concisely, both orally and in writing\n\nExhibit a high level of professionalism and excellent interpersonal skills\n\nStrong relationship-building and customer service abilities, proactive, results oriented and resourceful\n\nAbility to meet deadlines while maintaining accuracy, excellent product quality and attention to detail\n\nExhibit dedication to hard work, commitment to the highest ethical standards, and an eagerness to learn"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}