{
  "title": "244923 - May 2025 Engineering (Electric Division) Co-op (Multiple)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "WORK DURATION: 8, 12, OR 16 MONTHS (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms , and a 16-month employment period is registered as 4 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 8, 12, and/or 16 months.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four.\n\nNEED HELP TO RELOCATE? If you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section \"Co-operative Education Travel Awards for Work Terms outside Victoria\"."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "Min. 8 months, Max. 16 months"
    },
    {
      "key": "Job Title:",
      "value": "May 2025 Engineering (Electric Division) Co-op (Multiple)"
    },
    {
      "key": "Job Location:",
      "value": "Multiple (Calgary, Edmonton, Grande Prairie, Lloydminster, Slave Lake)"
    },
    {
      "key": "Region:",
      "value": "Various"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$28 - $36/hour, dependent upon previous work-term experience"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Your potential is here!\n\nDivision: ATCO Electric\n\nLocation: Multiple (Calgary, Edmonton, Grande Prairie, Lloydminster, Slave Lake)\n\nDuration: 8, 12 or 16 months\n\nSalary: $28 - $36/hour, dependent upon previous work-term experience\n\nStart Date: May 2025\n\nRelocation: Relocation assistance will be provided\n\nWhat We Offer:\n\nA culture based on caring, integrity, agility, collaboration, safety, and belonging\nSalary increases every semester plus 6% vacation pay\nOngoing support from engineering mentors toward your professional growth.\nOpportunities to give back through ATCO's EPIC Program and team events\nWell-Being@ATCO Health & Wellness Program\nSo much more!\n\nYour career journey at ATCO has the potential to be full of new experiences, inspiring challenges, and growth without boundaries. Set your sights on how you want to grow and develop, and we'll be right there to support you along the way. At ATCO Electric, we've been energizing homes, farms and businesses across north and east-central Alberta for more than 85 years. We serve nearly 229,000 customers in 242 communities and our service area covers nearly two-thirds of Alberta. Engineering work makes what we do possible.\n\nWho you are:\n\nMust be enrolled in an Engineering co-op (or internship) program at a recognized Canadian university.\nHave Excellent computer skills and experience working with Microsoft Office Suite.\nAbility to communicate verbally and in writing clearly and concisely, using appropriate technical vocabulary.\nHold a valid Class 5 driver's license.\n\nTo apply:\n\nPlease clearly indicate which three departments you are most interested in and whether you are willing to relocate.\nPlease indicate on your resume how many months you are available for and that you are applying for the May 2025 Co-op Term.\nInclude your most recent transcript in your application.\nNote: Interviews will be scheduled for the week of January 20, 2025."
    },
    {
      "key": "Qualifications:",
      "value": "Positions are available in, but not limited to, the following engineering departments:\n\nDistribution Design Engineering\n\nDiscipline: Electrical, Civil Engineering || Location: Grande Prairie, Lloydminster\n\nDescription:\n\nPrepare designs using AutoCAD for projects compatible with pre-engineered standards, and regulations, and meeting customer requirements.\nCalculate structure loading & determine pole class and guy length requirements based on tangential and sheer loading & balancing of static forces.\nClearance calculations of overhead facilities\nSize electrical equipment, wire, cable, and appropriate over-current protective devices\nDevelop project cost and resource estimates.\nPrepare detailed material lists & ordering material.\n95% office based, 5% field based.\nHybrid Schedule.\n\nSoftware's Used:\n\nMicrosoft Office 365\nAutoCAD\n\nDistribution System Planning\n\nDiscipline: Electrical Engineering || Location: Edmonton\n\nDescription:\n\nOperate power system simulation software (CYME) for load flow analysis.\nCreation of Single Line Diagrams (SLDs) as needed for customer new extensions and system work.\nDevelops protection schemes, regulator settings, transformer sizes.\nreviews historical load and generation data and assists in the implementation of recent technologies.\nWork with Transmission Protection and Control group to revise 25kV breaker relay settings.\nDaily support as needed to Service staff with transformer upgrades, fuse coordination, equipment upgrades and replacements, contingency studies, and outage investigations.\n95% office based, 5% field based.\nHybrid Schedule.\n\nSoftware's Used:\n\nMicrosoft Office 365\nAutoCAD\nCYME\n\nElectrical Transmission Lines & Civil Engineering\n\nDiscipline: Electrical, Civil, Computer Engineering || Location: Calgary, Edmonton\n\nDescription:\n\nAssist engineers for overall engineering and design of overhead transmission line.\nPrepare drawings and design for a wide range of projects and standards including new electrical transmission line builds.\nAssist engineers with supporting asset management team, field maintenance crews, and right of way planning team.\n95% office based, 5% field based.\nHybrid Schedule.?\n\nSoftware's Used:?\n\nMicrosoft Office 365?\nAutoCAD?\nMicroStation\nPLS-CAD\n\nHVDC & FACTS\n\nDiscipline: Electrical, Computer Engineering || Location: Edmonton\n\nDescription:\n\nSupport the operations and maintenance of HVDC assets by assisting with outage analysis, technical support, and Alberta Reliability Standards compliance activities.\nBuild software tool to help streamline data management as it pertains to compliance activities.\n100% Office-based\nHybrid Schedule?\n\nSoftware's Used:??\n\nMicrosoft Suite\nPython\nPostgreSQL\nMicroStation\n\nLarge Distribution Design Engineering\n\nDiscipline: Electrical, Civil Engineering || Location: Edmonton\n\nDescription:\n\nProvide engineering and project management support of large-scale distribution powerline projects, including project estimation, procurement of detailed design packages, preparing material lists and orders, and project implementation\nDevelop project cost and resource estimates\nPrepare designs using AutoCAD with pre-engineered standards, regulations, and meeting customer requirements.\nCalculate structure loading & determine pole class and guy length requirements based on tangential and sheer loading & balancing of static forces.\nClearance calculations of overhead and underground facilities\nSize electrical equipment, wire, cable, and appropriate over-current protective devices\n90% office based, 10% field based.\nHybrid Schedule.\n\nSoftware's Used:\n\nMicrosoft Office 365\nPLS-CADD\nAutoCAD\n\nNetwork Connectivity\n\nDiscipline: Electrical, Engineering Physics, Mechanical || Location: Edmonton\n\nDescription:\n\nEntry level network modelling/facility mapping in the Hexagon G/Technology suite of applications.\nTroubleshoot and address issues within the electrically connected model in G/Technology.\nParticipate in data integrity and cleanup projects that involve research, analysis, problem solving, and the reconciliation of data from various sources to resolve issues with the existing Utility Network Model data.\nDevelop documentation for both existing and new work processes.\nRun daily validation tools as part of group QA/QC processes.\n95% Office-based, 5% Field-based.\nHybrid Schedule.\n\nSoftware's Used:\n\nMicrosoft Office\nHexagon G/Technology\n\nRenewables & Microgrids\n\nDiscipline: Electrical Engineering || Location: Edmonton\n\nDescription:\n\nPrepare designs and drawings with MicroStation for projects compatible with pre-engineered standards, regulations, and customer requirements.\nProvide engineering and project management support of renewables, battery systems and microgrids including design, procurement, implementation, and life cycle support.\nAssist in planning, design, site visit, vendor outreach of electric vehicle related projects, such as public facing EV charging, ATCO internal charging.\nMarkup preliminary and as-built drawing packages as required. Coordinate drawing packages with Electrical & Instrumentation, and other Engineering teams.\nUpdate weekly project list for budgeting, forecasting, and cost tracking.\n90% office based, 10% field based.\nHybrid Schedule.?\n\nSoftware's Used:?\n\nMicrosoft Office 365?\nAutoCAD?\nMicroStation\n\nTelecom Engineering\n\nDiscipline: Electrical, Computer, Communication Engineering || Location: Edmonton\n\nDescription:\n\nUse telecom network design software tool for IT infrastructure and planning telecom networks.\nDesigns projects to modernize and expand the utility-owned Telecom system through various project types and provides operational support as needed.\nProvides drafting, construction packages, and mapping support.\nMarks up preliminary and as-built drawing packages as required, and coordinates drawing packages with other Engineering staff.\nConducts data analysis in support of network planning activities.\n95% Office-based, 5% Field-based.?\nHybrid Schedule.?\n\nSoftware's Used:?\n\nMicrosoft Office 365?\nAutoCAD?\nKuwaiba\n\nWork Coordination\n\nDiscipline: in Electrical, Civil, Environmental or Geomatics Engineering || Location: Slave Lake\n\nDescription:\n\nEnsuring that project deliverables are achieved through supporting design, planning, scheduling, and warehouse where required.\nDevelop and maintain collaborative work relationships with team members with the ability to take direction and learn independently.\nResponsible for design of both small and medium size capital projects and system projects on the distribution system.\nInterfacing with customers, creating proposals, and assisting with route selection.\nObtains approvals, selects & orders material, develops design, completes design calculations, and composes Construction Packages.\nData entry and analysis, retrieving requested information, compiling documentation, and supporting company initiatives are some of this role's primary duties.\n\nPlease note that only those selected for interviews will be contacted.\n\nATCO Electric is part of ATCO Ltd. With approximately 6,000 employees and assets of $23 billion, ATCO is a diversified global holding corporation with investments in Structures & Logistics (workforce housing, innovative modular facilities, construction, site support services, and logistics and operations management), Energy Infrastructure (electricity generation, transmission and distribution; natural gas transmission, distribution and infrastructure development; energy storage and industrial water solutions; and electricity and natural gas retail sales), Transportation (ports and transportation logistics) and Commercial Real Estate. More information can be found at www.ATCO.com. ATCO is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, veteran status, sexual orientation, gender identity or any other characteristic protected by law."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}