{
  "title": "245312 - Integration Developer, Summer 2025 - Toronto or Vancouver (Co-op/Internship) - 8 Months",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Integration Developer, Summer 2025 - Toronto or Vancouver (Co-op/Internship) - 8 Months"
    },
    {
      "key": "Job Location:",
      "value": "Various"
    },
    {
      "key": "Region:",
      "value": "Various"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$23 to $25/hr"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "About QuadReal Property Group\n\nQuadReal Property Group is a global real estate investment, operating and development company headquartered in Vancouver, British Columbia. Its assets under management are $85 billion. From its foundation in Canada as a full-service real estate operating company, QuadReal has expanded its capabilities to invest in equity and debt in both the public and private markets. QuadReal invests directly, via programmatic partnerships and through operating platforms in which it holds an ownership interest.\n\nQuadReal seeks to deliver strong investment returns while creating sustainable environments that bring value to the people and communities it serves. Now and for generations to come.\n\nQuadReal: Excellence lives here.\n\nWe are committed to providing our Co-ops/Interns with a student experience that provides a supportive and engaging learning environment while developing skills and business acumen. Students will have the opportunity to participate in a variety of experiences including our Corporate Speaker Series, Fireside Chats, Volunteer opportunities and Networking events.\n\nEligibility Note: To qualify for a student (Co-op/Internship) opportunity, students must be enrolled in their academic studies at a post-secondary institution (university/college) and must be returning to school after completion of their work term with QuadReal. If you are a student registered in an official co-op program at your post-secondary institution and completion of a final work term is a mandatory component for you to graduate, you are eligible to apply with the understanding that you will leave QuadReal at the end of your work term or have the possibility to be considered for full-time opportunities.\n\nWe are seeking an enthusiastic and driven Co-op/Intern to join our Integration Team in Toronto or Vancouver. Reporting to the Director of Integration, you will actively contribute to the day-to-day operations and play a vital role in our ongoing efforts to streamline and enhance our IT environment. This internship offers a unique opportunity to gain hands-on experience in integration, working alongside our talented team to understand integration requirements, optimize existing systems, implement new solutions, and improve our processes and tools, and participate in implementation and integration testing.\n\nWhat We Offer:\n\nAn organization and leaders that support your development through meaningful work experience.\nA Student Mentorship Program designed to provide 1:1 support throughout your experience\nOpportunities to build your industry knowledge through Corporate Speaker Series & Fireside Chats\nGiving back to community with your peers and team members through volunteering events\nOpportunities to build long lasting industry and professional relationships\n\nWhat You Will Experience:\n\nIntegration Requirements:\n\nCollaborate with project stakeholders to gather and document integration requirements.\nAssist in translating business requirements into technical integration solutions.\n\nIntegration Support & Implementation:\n\nCollaborate with the integration development team to design and implement integration solutions, including configuring integrations, developing custom connectors, and scripting data transformations using Anypoint Studio.\nMonitor existing integrations, triage production issues, and recover automated integrations to ensure seamless business functionality\n\nDevOps Process Analysis and Improvement:\n\nWork with the DevOps team to analyze current integration processes.\nIdentify areas for improvement and help implement process enhancements to streamline integration workflows.\n\nAzure Integration Services:\n\nExplore Azure Integration Services to develop integrated solutions that connect on-premises and cloud-based applications and services. Analyze and implement Azure Integration Services as an alternative to MuleSoft for specific use cases\n\nAPI and Network Security:\n\nCreate and manage PGP and SSH keys to ensure encryption standards are met when integrating with other systems.\nWork closely with the infrastructure team to handle integration network requests, such as IP whitelisting and managing inbound and outbound connections from the cloud.\nManage API security policies and rules for all integration APIs.\n\nDocumentation:\n\nMaintain detailed documentation of integration processes, configurations, and best practices.\nAssist in creating user guides and knowledge base articles for team reference.\n\nCollaboration and Learning:\n\nCollaborate with cross-functional teams, including developers, architects, and business analysts.\nContinuously learn and stay updated on industry trends and best practices in integration technologies, particularly MuleSoft.\n\nThe expected hourly range for this role is $23 to $25.\n\nQuadReal Property Group will provide reasonable accommodation at any time throughout the hiring process for applicants with disabilities or for those needing job postings in an alternate format. If you require accommodation, please advise the Talent Acquisition team member you are working with and include the following: Job posting #, your name and your preferred method of contact."
    },
    {
      "key": "Qualifications:",
      "value": "What You Will Bring:\n\nCurrently enrolled in an academic program in Computer Science, Software Development, or Information Technology\nUnderstanding of Programming Languages and how to work with Application Programming Interfaces (APIs) is fundamental. This includes knowledge of RESTful APIs, SOAP APIs, GraphQL, and more\nFamiliarity with middleware and Enterprise Service Bus (ESB) technologies such as MuleSoft, Azure Data Factory or TIBCO is valuable\nProficiency in working with databases (SQL and NoSQL) is necessary as data often needs to be retrieved, manipulated, and stored\nFamiliarity with integration patterns like publish-subscribe, point-to-point, request-reply, and event-driven architectures\nEffective communication is crucial to understand business requirements and collaborate with cross-functional teams\nThe technology landscape is constantly evolving, so a willingness to learn and adapt to new tools and techniques is vital\n\nDon't have all of the above skills? Don't worry. We still want to hear from you!"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}