{
  "title": "244869 - Summer 2025 | JD Irving Engineering and Computer Science Co-op | Look inside for Multiple Jobs",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "CHECK INDIVIDUAL JOB POSTINGS\nPlease be sure to:\n\nCheck the employer's site for the actual application deadline date. It may not be the same date used in this posting.\n\nCheck the employer's site for the actual location of the position. It may not be in the same city as used for this posting.\n\nCheck the work duration of the position. Work terms may be offered for 4, 8, 12, or 16 months.\n\nKEEP A COPY: It is also recommended that you keep copies of any postings that you apply to as they may be removed from the employer's site once the job closes.\n\nPlease see each individual posting, as positions listed have differing durations.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads - If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Summer 2025 | JD Irving Engineering and Computer Science Co-op | Look inside for Multiple Jobs"
    },
    {
      "key": "Job Location:",
      "value": "Various Locations in Atlantic Canada"
    },
    {
      "key": "Region:",
      "value": "Various"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "6"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Company Overview\n\nThe belief that what people experience matters more than technology is part of our foundational core. We also believe that our ability as a team grows exponentially when we share success. These centering values - some of our non-negotiables - guide our decisions and inform how we show up daily. Join a team that aims to simplify the path forward and inspire commitment.\n\nWith over 380 employees centralized in Saint John, Fredericton, Dieppe and Halifax, we offer the opportunity to create real value by helping people and businesses work smarter. JDI IT supports the entire J.D. Irving Limited group of companies which means we offer opportunities and experiences across a wide breadth of IT areas, businesses and industries. As a member of the JDI IT team, you will be a key player in enabling the business to win by overcoming obstacles and \"getting it done\"!\n\nWe believe in the power of diverse teams and invest in continuous professional growth. We are seeking naturally curious change makers looking to join a collaborative and motivated team. Come help JDI IT Raise the Bar!\n\n\n\nAbout Us\nFounded in 1882, J.D. Irving, Limited (JDI) has operations in Canada and the United States and are a team of 20,000 dedicated employees. At J.D. Irving, Limited, you are part of a dynamic team of professionals who lead with integrity and are passionate about delivering results. With a culture that nurtures talent and creates an inclusive workplace, you can grow your career across our various operating divisions.\n\nWe are committed to creating accessible environments for our colleagues, candidates, and customers. Requests for accommodation due to a disability (which may be visible or invisible, temporary, or permanent) can be made at any stage of application and employment. We encourage candidates to make their accommodation needs known so that we can provide equitable opportunities.\n\nWorried you do not meet all the requirements? Studies have shown that many applicants apply only to job opportunities when they feel they meet 100% of the criteria. We promote an inclusive environment where everyone is appreciated, recognized, and empowered to contribute fully. If you are interested in this position but are worried you did not meet all the requirements, we would encourage you to still apply.\n\nWe appreciate your interest in our company however only those candidates selected for an interview will be contacted.\n\nPlease see individual links for each posting in the table below:\n\nPOSITION\tLOCATION\tJob ID #\nData Analyst Student/Intern - Summer 2025\tSaint John, NB\t1839\nSecurity Analyst Student/ Intern - Summer 2025\tFredericton, NB or Saint John, NB\t1925\nMechanical Engineering Student - Summer 2025\tSaint John, NB or Utopia, NB\t1816\nElectrical Engineering Student - Summer 2025\tSaint John, NB\t1843\nCivil Engineering Student - Summer 2025\tSaint John, NB\t1844\nMechanical Engineering Student - Summer 2025\tSussex, NB\t1143"
    },
    {
      "key": "POSITION",
      "value": "LOCATION"
    },
    {
      "key": "Data Analyst Student/Intern - Summer 2025",
      "value": "Saint John, NB"
    },
    {
      "key": "Security Analyst Student/ Intern - Summer 2025",
      "value": "Fredericton, NB or Saint John, NB"
    },
    {
      "key": "Mechanical Engineering Student - Summer 2025",
      "value": "Saint John, NB or Utopia, NB"
    },
    {
      "key": "Electrical Engineering Student - Summer 2025",
      "value": "Saint John, NB"
    },
    {
      "key": "Civil Engineering Student - Summer 2025",
      "value": "Saint John, NB"
    },
    {
      "key": "Mechanical Engineering Student - Summer 2025",
      "value": "Sussex, NB"
    },
    {
      "key": "",
      "value": ""
    },
    {
      "key": "",
      "value": ""
    },
    {
      "key": "",
      "value": ""
    },
    {
      "key": "Qualifications:",
      "value": "Please see each individual posting linked in the table above for required qualifications for each job."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}