{
  "title": "245156 - INFORMATION on CSIS SUMMER 2026 Computer Science / Engineering / Information Technology Opportunities",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "THIS POSTING IS TO PROVIDE INFORMATION ON HOW TO APPLY TO:\n\n245153 - CSIS SUMMER 2026 Computer Science / Engineering / Information Technology Opportunities\nInput JOB ID 245153 in the SEARCH POSTING block or Click \"Search job postings\" under the keyword search and select the K26 co-op work term TO APPLY ***\n\nWHO CAN APPLY\n\nCanadian citizens eligible for a Top Secret security clearance.\n\n\nSECURITY REQUIREMENTS\n\nCandidates must be able to obtain a Top Secret security clearance. This process involves a security interview, a polygraph, and a background investigation that includes credit and financial verifications.\n\n\n4, 8, 12 OR 16 MONTH WORK TERM\n\nWork Duration: 4, 8, 12, or 16 months (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms , and a 16-month employment period is registered as 4 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 4, 8, 12, and/or 16 months.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4, 8, 12, or 16 months"
    },
    {
      "key": "Job Title:",
      "value": "INFORMATION on CSIS SUMMER 2026 Computer Science / Engineering / Information Technology Opportunities"
    },
    {
      "key": "Job Location:",
      "value": "Various"
    },
    {
      "key": "Region:",
      "value": "Various"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "*** Input JOB ID 245153 in the SEARCH POSTING block or Click \"Search job postings\" under the keyword search and select the K26 co-op work term TO APPLY ***\n\nThe Canadian Security Intelligence Service (CSIS) is hiring Computer Science / Engineering students for the SUMMER 2026 work term. The job is posted in LIM as JOB ID 245153 - CSIS SUMMER 2026 Computer Science / Engineering / Information Technology Opportunities\nPosting closes February 14th, 2025\n\nIn order to view and apply for this position students must:\n\nSubmit a Co-op Jobs Access form for the SUMMER 2026 work term\nEngineering Students must meet the work term pre-requisites for SUMMER 2026"
    },
    {
      "key": "Qualifications:",
      "value": "*** Eligibility: JOB ID 245153***"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}