{
  "title": "245427 - Junior Software Developer (Co-op)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "ELIGIBILITY REQUIREMENTS:\n\nProof of Canadian Citizenship;\nThe Co-op student must be able to obtain reliability status security clearance and maintain it for the duration of the co-op term;\nProof of having lived in Canada for at least the past five years.\n\n\n8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 8 months.\n\nNote for Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Junior Software Developer (Co-op)"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "No"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5"
    },
    {
      "key": "Number of Positions:",
      "value": "2"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "About JEA\n\nJames Evans and Associates, Ltd. is a Victoria-based company that has been doing business in Canada and the United States for over 45 years. We have an excellent, well-established reputation in the Canadian and US pension industry. JEA offers SaaS and on-premises pension system administration solutions, along with pension system consulting services to a variety of clients with a diversity of needs. With over 45 years of history, JEA has proven we are both adaptable and reliable - and that, above all, we strive to form true partnerships with our clients, ensuring we develop, implement and support the \"best in class\" pension solutions for their organizations and members.\n\nThe successful applicant will join an Agile Scrum team that builds, maintains, and delivers JEA's products to our SaaS and on-premises clients utilizing the following tools and skills:\n\nJIRA\nBitbucket/Git\nSQL\nOracle PL/SQL\nOracle JDeveloper\nOracle BI Publisher\nJasperReports\nKatalon Studio\nREST APIs\nJava\nJavascript\nXML\n\nLocation\n\nJEA has offices in Victoria, BC, and Winnipeg, MB, as well as remote workers across Canada. We encourage applicants from all of Canada to apply.\n\nJEA welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.\n\nPerks and benefits\n\nOur Victoria office is near the Selkirk Trestle, close to the city center with great dining-out options and easy access to the Galloping Goose Trail\nOur Winnipeg office is located downtown in the middle of the Sports, Hospitality and Entertainment District, one block from the Winnipeg Jets' arena\nFlexible work location (hybrid home and office)\nCommuter allowance\nCasual dress\nA company that's committed to a work-life balance\nFriendly, easy-to-get-along-with team where open dialog and knowledge-sharing is encouraged and promoted\nFree snacks and drinks\nWe tend to hire former coops students on full time after graduation"
    },
    {
      "key": "Qualifications:",
      "value": "Skills and Experience\n\nApplicants should have strong analytical and technical skills and a love of learning.\nSoftware development experience, including working on a web development team, interpreting specifications, and testing application components either in school or work experience.\nWorking towards a degree or diploma in Computer Science, Software or Computer Engineering, or a related field.\nMust be eligible to work in Canada.\nMust be able to obtain and maintain a security clearance as a condition of employment; this includes having lived in Canada for at least the past five years.\nAttention to detail in oral and written communications and the ability to write for a technical audience. Robust analytical and problem-solving skills.\nThe ability to manage multiple priorities and consistently produce results within timelines.\nThe ability to develop and maintain positive working relationships with team members and others.\nKnowledge of software development life cycle and object-oriented development methodologies, including design principles, techniques and tools.\nExperience with current industry-standard software development technologies and development tools.\n\nOther Experiences\n\nExperience working on an Agile team.\nExperience with Katalon Studio.\nProficiency in Groovy scripting.\nFamiliarity with pension administration or financial system software.\nAn understanding of website UI and UX best practices.\nAn understanding of web usability and accessibility standards.\nPreference given to applicants with experience in:\nSQL\nOracle\nKatalon Studio\nKatalon Runtime Engine\nGroovy\nJava\nJunit\nREST APIs\nReact"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "1"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}