{
  "title": "245472 - Full Stack Software Developer - Innovation and Automation Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Work Duration: 4 or 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 4 and/or 8 months.\n\nNote for Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months or 8 Months"
    },
    {
      "key": "Job Title:",
      "value": "Full Stack Software Developer - Innovation and Automation Co-op"
    },
    {
      "key": "Job Location:",
      "value": "North Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$34.23 per hour"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "End Date:",
      "value": "08/29/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Please fill and submit the attached Co-op Questionnaire with your application.\n\nA career at ICBC is an opportunity to be part of a talented, diverse and inclusive team that is driven to serve its customers and community. Make the most of your skills and take the opportunity to grow and develop your career. You can expect a competitive salary, comprehensive benefits and a challenging work environment. Drive your career with us.\n\n\nJob Title: Full Stack Software Developer - Innovation and Automation Co-op\nEmployment Type: Paid Co-Op\nLocation: North Vancouver\nHours of Work: 7.5 hr Day Shift (5 days M-F)\nPay: $34.23 per hour + 11.2% in lieu of vacation and stat\nDuration: 4 months with options to renew\n\n\nPosition Highlights\nCo-op/Interns work on solving current business problems for our internal users, business partners, suppliers, and customers. You will be collaborating with an innovation team, applying design thinking and implementing cutting-edge technology. The ideal candidate will be organized, ambitious, self-motivated, and have good communication skills. The innovation and automation program will provide you an opportunity to learn new technologies, and experience a team culture centered on doing things differently, rather than providing a different flavor of the same thing."
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications:\n\nCandidates have completed or pursuing an undergraduate or graduate degree from a recognized post-secondary institution focused in computer science, engineering, business or related field.\nPossess one year of programming experience with one of the following: Python, C/C++, Java, .NET Core, JavaScript, Rust, Go, etc. (familiarity with R or Julia will be an asset)\nFamiliarity with web design principles and frameworks such as React JS/Native\nKnowledge of computer science fundamentals like object-oriented design, functional programming, data structures, and algorithms\nKnowledge/understanding of design thinking, lean, operational excellence methodology is an asset.\n\n\nResponsibilities:\n\nUse critical thinking and out of the box thinking to solve day-to-day business problems for contact centers, customers, operations, and business partners.\nWork with product owners in designing, building, testing, and implementing new solutions for internal and external stakeholders.\nResearch and assess the use of new technology and tools for adoption and integration with existing applications.\nBe independent, creative, and collaborate with a team in a rapid-delivery paced environment.\n\n\nThings you will be working on or learning:\n\nCloud - Azure, AWS\nAutomation - Blue Prism, Automation Anywhere, intelligent OCR\nChannels - Chatbots, Live chat, Mobile, SMS\nDevOps - Docker, Rancher, Kubernetes\nMachine Learning - Computer Vision, NLP, Speech Recognition, Sentiment"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}