{
  "title": "244819 - Software Developer",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8-MONTH WORK TERM\n\nWork Duration: 8 months (An 8-month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Software Developer"
    },
    {
      "key": "Job Location:",
      "value": "Remote"
    },
    {
      "key": "Region:",
      "value": "Remote"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, fully remote"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$4,000-5,000 per month"
    },
    {
      "key": "Hours per Week:",
      "value": "40hr/wk"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "End Date:",
      "value": "12/19/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "2"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "What does Improving Vancouver do?\n\n\nCo-Op Life at Improving Vancouver\nCo-Ops are a valuable part of Improving Vancouver's current projects and future plans. We are thrilled to share that one of our Development Managers, Jared LaRue, was awarded the UBC Science Co-op - Employer Recognition Awards 2022. This award was presented to the top 5% of all co-op supervisors (from a pool of 1800+ supervisors)!\n\nImproving is a 15+ year technology management and consulting services firm deeply rooted in our commitment to establishing trust. We live out our values of Excellence, Dedication, and Involvement by providing each of our 1500 members across 16 locations on two continents a variety of opportunities and programs to grow in a way that's befitting their unique talents and interests, while supporting each one's unique path in life.\n\nImproving Vancouver (formerly Bit Quill Technologies) was formed by a group of software developers who started building relationships in 2017 when we secured our first data and cloud customers. Fast forward to now and we still have those original relationships, and continue to build and strengthen strong relationships with our partners who range from established multi-nationals to unicorns. Technically, we live the entire database ecosystem wherever it resides, from architecture to infrastructure to low level connector. Together we will build a growth framework to keep you moving towards excellence, whether that's depth in a single stack, getting exposure to new problem solving techniques, or moving your personal career track forward.\n\nFor those of you feeling anxious about interviewing with Improving Vancouver, chill. Our interviewers aren't there to rake you over the coals, or knock you off your game with trick questions. In fact, they are smart and caring people who want to help you clarify your strengths in as close to a real-world context as we can make within the larger interview experience. Furthermore we value your opinions, insights and questions and encourage you to share them both in anonymous surveys or within the direct discussions.\n\nBy the end of your co-op term, you'll be able to do things such as: coding and testing parts of a feature; configuring environments and setting up test automation and frameworks; authoring both developer and end user documentation; provided with guidance in gaining domain knowledge in the constantly expanding world of database ecosystem and cloud, and in how we solve unique problems using a variety of technologies for industry leading (and some unicorn) clients.\n\nAs a Software Developer you'll be mentored in being able to:\nThe following describes some (but not all) of the activities you will do within the role:\n\nTake on development, testing or documentation tasks for your team with guidance.\nPerform code reviews and learn new techniques from the exercise.\nParticipate in design discussions and pick up new concepts as part of this.\nFollow all of Improving Vancouver's software development processes even though many may be new to you.\nComfortably identify most positive test cases and benefit from guidance for negative and more complex test cases.\nParticipate in your team's Agile ceremonies:\nRaising blockers in stand-up\nRaising improvement suggestions in retrospective\nBeing assigned tasks from the sprint board\nParticipate in planning poker during Sprint Planning and asking questions to ensure you understand the scope of each ticket.\nFeel empowered to ask your Team Lead, Development Manager, your team mates, cross company specialists or any other employess for assistance\nHelp a team member needing help, even if you may need guidance.\nPresent the work you and your team does across the company or with a client.\nParticipate in building relationships with others outside of your team through multiple social programs.\nCapture new learning in a confluence page or enhance an existing one to capture or update your learnings.\nHave meaningful 1:1 meetings with your Team Lead and/or Development Manager, building relationships by getting to know them personally. Be encouraged to share your thoughts on the project. Start to form an idea of where you want to learn and grow in your career although that may still be relatively unclear."
    },
    {
      "key": "Qualifications:",
      "value": "Things that would help you succeed here:\n\nEnrolment in a B. Sc. in Computer Science, Software Engineering, or equivalent program.\nSpeaking concisely and with a learning mindset about and document software design and technical concepts with colleagues\nA passion and desire to learn a breadth of topics in/around software development, including design, coding, refactoring, Agile and much more!\nExposure to Java, C++, C#, and/or Python.\nDevelopment experience on Windows and macOS, Linux a plus.\n\nThings we feel that aren't necessary but would be a cool bonus:\n\nExperience working with an IDE such as Visual Studio, Visual Studio Code, IntelliJ, and Eclipse.\nExperience with object-oriented programming.\nExperience working in a team-based setting.\nExperience writing tests, both unit and integration a plus.\nExperience using C++ memory management and performance analysis tools a plus.\nExperience with source control tools such as Perforce or Git a plus.\nExposure to SQL, databases and database connectivity a plus.\nExposure to Big Data and/or NoSQL experience is a plus.\nExposure to AWS, Azure, and/or GCP a plus.\n\nWhat else is in it for you?\n\nWeekly 1:1 meetings with your Team Lead and/or Development Manager to nurture your career growth\nAccess to hundreds of Improving courses online, covering diverse topics from learning about data domains to meditation\nMonthly optional in-person and virtual social events - come out and have fun!\nWeekly optional virtual \"Donut\" meetings to meet other team members and chat about anything other than work\nA chance to be one of the random lunch lottery winners each week!\n\nStrong employee relationships are key to delivering to our partners as well as to creating a foundation for a truly welcoming and nurturing company culture. We have worked together to shape our work environment from the ground up, and value the culture that has resulted from it.\n\nWe are honoured to live and work on the traditional and unceded territories of the qiqéyt (Qayqayt) First Nation as well as all Coastal Salish Peoples including the Musqueam and Tsleil-Waututh."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "1"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}