{
  "title": "244208 - Generalist Software Engineer Co-op (203666)",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Generalist Software Engineer Co-op (203666)"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$65,000 - $70,000/year"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "We are a global team of creators, storytellers, technologists, experience originators, innovators and so much more. We believe amazing games and experiences start with teams as diverse as the players and communities we serve. At Electronic Arts, the only limit is your imagination.\n\nElectronic Arts is looking for students to join our world-class internship experience. Summer 2025 will be better than ever as we bring all interns together on-site for orientation week and prep students for the future ways of work by offering remote and hybrid opportunities depending on your location. For more information about our Early in Career programs, visit https://www.ea.com/careers/early-careers\n\nOur teams build meaningful relationships with hundreds of millions of players around the world who love our games. We aim to be the best at meeting players where they are and supporting them throughout their journey with EA. Our teams develop the strategic vision of our products, run outstanding multi-channel campaigns, build global engagement across all touch points, develop global insights, and propel sales and global publishing. We understand the dynamic global landscape so we can bring relevant content, promotions, and help to players anywhere.\n\nWhat You'll Do:\n\nYou will report to Producers, Development Directors and Technical Leads to lead the development of bug fixes, game changes, and new features into our games."
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications:\n\nYou are pursuing a Bachelor's degree in a related field\nYou have working knowledge of Java Or C++, and SQL, Python\nYou have knowledge of object-oriented design and implementation\nYou must be available for a full-time paid internship in the summer of 2025\n\nWe are only considering students who will be enrolled in an accredited degree program in the summer of 2025, slated to graduate no earlier than December 2025. Applicants must be legally authorized to work in the US on a full-time basis during the 12-week internship. Visa sponsorship is not available for this position.\n\nCOMPENSATION AND BENEFITS The base salary ranges listed below are for the defined geographic market pay zones in these states. If you reside outside of these locations, a recruiter will advise on the base salary range and benefits for your specific location. EA has listed the hourly pay ranges it in good faith expects to pay applicants for this role in the locations listed, as of the time of this posting. Salary offered will be determined based on numerous relevant business and candidate factors including, for example, degree type (e.g. Bachelor's, Master's, PhD), what stage you are in your degree journey (i.e. freshman, sophomore, etc.), qualifications, certifications, experience, skills, geographic location, and business or organizational needs.\n\nPAY RANGES\n\nBritish Columbia (depending on location e.g. Vancouver vs. Victoria)\n\n$65,000 - $70,000 CAD\n\nThe hourly pay is just one part of the overall compensation at EA. We also offer a package of benefits including 80 hours per year of sick time (prorated based on scheduled hours per week if less than full-time), 16 paid company holidays per year, medical insurance, and 401(k). Interns in California are also eligible for Voluntary Disability Insurance."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}