{
  "title": "245056 - Software Engineer Intern (Toronto)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria\n\nResources for living and working in Toronto:\n\nTourism\nStatistics\nReviews\nTransportation\nAccommodation - Rentals\nThings to do"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Software Engineer Intern (Toronto)"
    },
    {
      "key": "Job Location:",
      "value": "Toronto"
    },
    {
      "key": "Region:",
      "value": "ON-Greater Toronto"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Build the future of the AI Data Cloud. Join the Snowflake team.\n\nSnowflake started with a clear vision: develop a cloud data platform that is effective, affordable, and accessible to all data users. Snowflake developed an innovative new product with a built-for-the-cloud architecture that combines the power of data warehousing, the flexibility of big data platforms, and the elasticity of the cloud at a fraction of the cost of traditional solutions. We are now a global, world-class organization with offices in more than a dozen countries and serving many more.\n\nWe're looking for dedicated students who share our passion for ground-breaking technology and want to create a lasting future for you and Snowflake.\n\nWHAT WE OFFER:\n\nPaid, full-time internships in the heart of the software industry\n\nPost-internship career opportunities (full-time and/or additional internships)\n\nExposure to a fast-paced, fun and inclusive culture\n\nA chance to work with world-class experts on challenging projects\n\nOpportunity to provide meaningful contributions to a real system used by customers\n\nHigh level of access to supervisors (manager and mentor), detailed direction without micromanagement, feedback throughout your internship, and a final evaluation\n\nStuff that matters: treated as a member of the Snowflake team, included in company meetings/activities, flexible hours, casual dress code, accommodations to work from home, swag and much more\n\nWhen return to office in effect, catered lunches, access to gaming consoles, recreational games, happy hours, company outings, and more"
    },
    {
      "key": "Qualifications:",
      "value": "WHAT WE EXPECT:\n\nDesired class level: 3rd/4th year Undergraduates, Masters, or PhD\n\nDesired majors: Computer Science, Computer Engineering, Software Engineering, or related field\n\nRequired coursework: algorithms, data structures, and operating systems\n\nRecommended coursework: cloud computing, database systems, distributed systems, and real-time programming\n\nBonus experience: working experience, research or publications in databases or distributed systems, and contributions to open source\n\nWhen: Summer 2025 (April - September 2025)\n\nDuration: 12 week minimum, 12-16 weeks recommended\n\nExcellent programming skills in C++ or Java\n\nKnowledge of data structures and algorithms\n\nStrong problem solving and ability to learn quickly in a dynamic environment\n\nExperience with working as a part of a team\n\nDedication and passion for technology\n\nWHAT YOU WILL LEARN/GAIN:\n\nHow to build enterprise grade, reliable, and trustworthy software/services\n\nExposure to SQL or other database technologies\n\nUnderstanding of database internals, large-scale data processing, transaction processing, distributed systems, and data warehouse design\n\nImplementation, testing of features in query compilation, compiler design, query execution\n\nExperience working with cloud infrastructure, AWS, Azure, and/or Google Cloud in particular\n\nLearning about cutting edge database technology and research\n\nPOSSIBLE TEAMS/WORK FOCUS AREAS:\n\nData Applications Infrastructure, Data Marketplace, Data Privacy, Data Sharing\n\nHigh performance large-scale data processing\n\nLarge-scale distributed systems\n\nSoftware-as-a-Service platform\n\nSoftware frameworks for stability and performance testing\n\nEvery Snowflake employee is expected to follow the company's confidentiality and security standards for handling sensitive data. Snowflake employees must abide by the company's data security plan as an essential part of their duties. It is every employee's duty to keep customer information secure and confidential.\n\nSnowflake is growing fast, and we're scaling our team to help enable and accelerate our growth. We are looking for people who share our values, challenge ordinary thinking, and push the pace of innovation while building a future for themselves and Snowflake."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}