{
  "title": "245178 - Software Developer Co-Op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria\n\n\n8 OR 12 MONTH WORK TERM\n\nWork Duration: 8 or 12 months (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 8 and/or 12 months.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 or 12 Months"
    },
    {
      "key": "Job Title:",
      "value": "Software Developer Co-Op"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$38,000.00 - $58,000.00 per Year"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "At Motorola Solutions we are helping solve some of the biggest challenges around safety and physical security by developing advanced artificial intelligence (AI) technologies and products that are used to help keep people, businesses, and cities around the world safer. Avigilon, a Motorola Solutions company, designs, develops, and manufactures advanced AI, video analytics, network video management software and hardware, surveillance cameras, and access control solutions that help change the way people interact with their security systems.\n\nOur co-ops are treated like full team members and are given the opportunity to learn what being a developer is like in the real world. You'll have the opportunity to learn new technologies and best practices in coding, testing and automation.\n\nYou'll also have a lot of fun and make a lot of friends. For the duration of your work term, you will be a member of a multi-disciplinary engineering team responsible for the design and implementation of the next generation of Motorola's market-leading high-performance video solutions products.\n\nResponsibilities:\n\nDesigning, developing, testing, researching, and maintaining software solutions in C++ and .NET\nImplementing and maintaining CI/CD pipelines\nCollaborating with the Automation and Test team on identifying test cases for new features and regression testing\nFocusing on usability, responsiveness, scalability, testability, and best coding and design guidelines\nUtilizing strong communication skills to collaborate effectively with cross-functional teams"
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications:\n\nProgress towards a degree in Computer Engineering, Computer Science, or a related technical discipline\nExperience with high-level OOP language (preferably C++ and .NET)\nKnowledge of real-time, multithreaded operating systems, applications, and concepts\nA desire to learn, grow, and contribute\n\n\nPreference will be given to candidates with the following skills and experience:\n\nKnowledge working within a .NET Core framework\nExposure to Agile software development practices\nExperience working in Azure"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}