{
  "title": "245486 - Intern, Software Engineering",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria\n\nResources for living and working in the Greater Toronto Area:\n\nTourism\nStatistics\nReviews\nTransportation\nAccommodation - Rentals\nThings to do"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Intern, Software Engineering"
    },
    {
      "key": "Job Location:",
      "value": "North York"
    },
    {
      "key": "Region:",
      "value": "ON-Greater Toronto"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "End Date:",
      "value": "08/22/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Our Purpose\n\nWe work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team - one that makes better decisions, drives innovation and delivers better business results.\n\nTitle and Summary: Intern, Software Engineering\n\nStart and end date: May 5 - Aug 22, 2025 (No exceptions available).\n\nOverview\nMastercard works to connect and power a sustainable and inclusive global economy. We are a vehicle for commerce, a connection to financial systems for the previously excluded, a technology innovation lab, and the home of Priceless. We ensure every employee has an opportunity to be a part of something bigger and to change lives. We believe in connecting everyone to endless, priceless possibilities.\n\nAbout the Team\nMastercard software engineering teams are obsessed with security, reliability, performance, and are driven to deliver solutions that delight our customers. We are looking for talented software engineers to develop advanced technologies and applications that are revolutionizing payments. Software engineers at Mastercard build the systems that process transactions, analyze data, and detect fraud to gain insight into the direction of the economy on behalf of our customers. We are focused on building simple, safe, and smart solutions that instill trust in every interaction. Our industry expertise is enhanced by our commitment to being a force for good in the world and to doing well by doing good. Your summer experience will build on your business skills and contribute to the company's goals and objectives.\n\nInternship Program\nMastercard's summer internship program provides emerging talent with projects that will enhance skills as well as contribute to the department's goals and objectives. In this program, you will participate in:\n• Networking events, mentorship opportunities, and hearing from senior leaders\n• Volunteer and team building opportunities.\n• Formal performance assessments\n• End-of-summer presentations to peers and Mastercard leadership.\n\nRole Description\nAs a Software Engineer Intern, you will:\n\nWork as a member of a high-performing Agile team to design, build, test, and deploy new products and features\nWrite high-quality code with a focus on security, design, and maintainability.\nBe exposed to various phases of software development from design through rollout.\nNote: specific responsibilities and development tools/languages used will vary based on team placement."
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications\n\nCurrently enrolled in a bachelor's degree program majoring in Computer Science or a related field with a graduation date in Spring 2026 ONLY\nExposure to algorithms, data structures, and core computer science concepts\nProficiency in one or more programming languages such as Java, JavaScript, C#, Python, etc.\nExposure to automated tests to verify code correctness and expected behavior.\nKnowledge of source control management (e.g., git), deployment, and task management tools.\nStrong analytical and excellent problem-solving skills and familiar with the role of debugging tools and information which diagnose issues such as stack traces, memory profiling, code tracing, etc.\n\nMastercard is an inclusive equal opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. In the US or Canada, if you require accommodations or assistance to complete the online application process or during the recruitment process, please contact reasonable_accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.\n\nCorporate Security Responsibility\nAll activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and, therefore, it is expected that every person working for, or on behalf of, Mastercard is responsible for information security and must:\n\nAbide by Mastercard's security policies and practices;\nEnsure the confidentiality and integrity of the information being accessed;\nReport any suspected information security violation or breach, and\nComplete all periodic mandatory security trainings in accordance with Mastercard's guidelines."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}