{
  "title": "245356 - Co-op Game Content Developer & Scripter",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "This position is part of DigiBC's Work Placement Pilot Program, which supports post-secondary students by providing experiential learning opportunities in animation, video, games, visual effects, and XR. As a part of this program, participating students will benefit from customized orientation workshops, e-learning resources, mentoring support, and the opportunity to start building their own professional network in the creative technology industry.\n\nThis position is open to students who are Canadian Citizens, Permanent Residents, or Protected Person as defined by the Immigration and Refugee Protection Act.\n\n\nFUNDING RESTRICTION TO ELIGIBILITY\nThis co-op position is partially funded by the DigiBC Creative Technology Work Placement Pilot Project and you must meet the qualifications of this grant in order to qualify for this co-op position. Grant qualifications include:\n\nYou are a Canadian Citizen, a Permanent Resident or a Protected Person as defined by the Immigration and Refugee Protection Act;\nYou are registered or enrolled at a Canadian post-secondary education institution and are able to provide proof of full-time or part-time enrolment during placement; and\nYou are legally entitled to work in Canada\n\nInternational students do not qualify."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Co-op Game Content Developer & Scripter"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$3,600/month (for 1st and 2nd work term); $3,800/month (for 3rd & 4th work term)"
    },
    {
      "key": "Hours per Week:",
      "value": "35"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "About Codename:\n\nCodename Entertainment is an award-winning video game studio located in Victoria, BC. We're a passionate group of gamers who love making games and having fun in the process! We stream 20+ hours of content on Twitch each week, showcasing our games and creating an engaging and positive community for our players.\n\nAs a co-op student with us, you'll have the opportunity to contribute to the development of one of our games from day one, providing you with a hands-on learning experience of what it's like to work in the fast-paced world of indie gaming.\n\nWork Term:\n\n4-month work term for Spring/Summer 2025, with the possibility of extension\n\nWork Schedule:\n\nMonday to Friday, 35 hours per week\n\nWork Location:\n\nOnsite at our Victoria office\n\nSalary Range:\n\n$3,600/month (work terms 1 or 2)\n\n$3,800/month (work terms 3 or 4)\n\nJob Title: Co-op Game Content Developer & Scripter\n\nAbout the Role:\n\nAs a Co-op Game Content Developer & Scripter, you'll be a key contributing team member to our longest running live service game Bush Whacker 2. You'll be responsible for producing content and creating features within the game. You'll work with our JSON based scripting and action system to create interesting interactive experiences for our players. You'll be working on laying down world areas within the game, including terrain, doodads, characters, and quests."
    },
    {
      "key": "Qualifications:",
      "value": "Qualifications:\n\nAs a qualified candidate…\n\nYou have experience with game programming in an object oriented programing language\n\nYou're highly creative and have a desire to create interesting game content\n\nYou're a self-starter with the ability to work with minimal direction\n\nYou have strong conceptual, production, and communication skills\n\nYou're logical and have strong problem-solving skills\n\nYou're passionate about games! (Bonus points if you've played one of our games!)\n\nAdditionally, any examples of level creation or other game content creation are considered a big plus and we welcome you to include them in your application.\n\nFunding:\n\nThis co-op position is partially funded by the DigiBC Creative Technology Work Placement Pilot Project (https://wpp.digibc.org), which supports post-secondary students by providing experiential learning opportunities in animation, video, games, visual effects, and XR. As a part of this program, participating students will benefit from customized orientation workshops, e-learning resources, mentoring support, and the opportunity to start building their own professional network in the creative technology industry.\n\nYou must meet the qualifications of this grant in order to qualify for this co-op position. Grant qualifications include:\n\nYou are a Canadian Citizen, a Permanent Resident or a Protected Person as defined by the Immigration and Refugee Protection Act;\n\nYou are registered or enrolled at a Canadian post-secondary education institution and are able to provide proof of full-time or part-time enrolment during placement; and\n\nYou are legally entitled to work in Canada\n\nInternational students do not qualify.\n\nWhat to Include in your Application:\n\nTell us about your love for gaming, what you've been working on, and why you would be a good fit for this role by including the following in your application:\n\nCover letter\n\nResume\n\nTranscript\n\nPortfolio of creative projects"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}