{
  "title": "244815 - Environmental Sustainability Coordinator Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "4 OR 8 MONTH WORK TERM\n\nWork Duration: 4 or 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 4 and/or 8 months.\n\nNote for Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months or 8 Months"
    },
    {
      "key": "Job Title:",
      "value": "Environmental Sustainability Coordinator Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Richmond or Comox"
    },
    {
      "key": "Region:",
      "value": "Various"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$27.50 - $30.61"
    },
    {
      "key": "Hours per Week:",
      "value": "35"
    },
    {
      "key": "Start Date:",
      "value": "05/01/2025"
    },
    {
      "key": "End Date:",
      "value": "08/29/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "ENVIRONMENTAL SUSTAINABILITY COORDINATOR CO-OP\n\n4 or 8 Months\n\nRichmond or Comox, BC\n\nThe Opportunity\n\nBC Ferries is seeking an Environmental Sustainability Coordinator to support the Environmental Sustainability team to deliver the Company's environmental management program. As the Environmental Sustainability Coordinator, you will lead a project that demonstrat"
    }
  ]
}