{
  "title": "244935 - Data Science & Advanced Analytics Intern/Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE? If you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section \"Co-operative Education Travel Awards for Work Terms outside Victoria\".\n\nRESOURCES FOR LIVING AND WORKING IN TORONTO:\n\nTourism\nStatistics\nReviews\nTransportation\nAccommodation - Rentals\nThings to do"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Data Science & Advanced Analytics Intern/Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Toronto"
    },
    {
      "key": "Region:",
      "value": "ON-Greater Toronto"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$46,000 - $46,000 CAD"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Work Location: Toronto, Ontario, Canada\n\nHours: 37.5\n\nPay Details: $46,000 - $46,000 CAD\n\nTD is committed to providing fair and equitable compensation opportunities to all colleagues. Growth opportunities and skill development are defining features of the colleague experience at TD. Our compensation policies and practices have been designed to allow colleagues to progress through the salary range over time as they progress in their role. The base pay actually offered may vary based upon the candidate's skills and experience, job-related knowledge, geographic location, and other specific business and organizational needs.\n\nAs a candidate, you are encouraged to ask compensation related questions and have an open dialogue with your recruiter who can provide you more specific details for this role.\n\nCOMPANY OVERVIEW\n\nTell us your story. Don't go unnoticed. Explain why you're a winning candidate. Think \"TD\" if you crave meaningful work and embrace change like we do. We are a trusted North American leader that cares about people and inspires them to grow and move forward.\n\nStay current and competitive. Carve out a career for yourself. Grow with us. Here's our story\n\nBuilding a World-Class Team at TD\n\nWe can't afford to be boring. Neither can you. The scale and scope of what TD does may surprise you. The rapid pace of change makes it a business imperative for us to be smart and open-minded in the way we think about technology. TD's technology and business teams become more intertwined as new opportunities present themselves. This new era in banking does not equal boring. Not at TD, anyway.\n\nOur Leaders are committed to people development, career advancement and value diversity and inclusion.\n\nJOB DESCRIPTION\n\nProvide technical expertise across a broad range of data analysis functions including data modeling, visualization, data profiling, data origin and lineage, report design, and other specialized data management functions. The Data Scientist & Advanced Analytics Coop/Intern will perform a variety of activities, which may include:\n\nApply machine learning methods to conduct data-driven research, identify opportunities, and make tangible recommendations to senior management.\nSupport business partners to identify opportunities for process optimization and informed decision-making and build innovative solutions.\nWork with structured and unstructured data and prepare data sets for machine learning through integration, cleaning, feature engineering, scaling and transforming data\nBuild production-scale solutions and work with deployment teams to integrate in business operations\nLeverage visualization methods to represent results and communicate outcomes to technical and non-technical audiences"
    },
    {
      "key": "Qualifications:",
      "value": "JOB REQUIREMENTS\n\nCurrently enrolled in either a recognized undergraduate degree majoring in Computer Science, Physics, Mathematics, Statistics, Engineering, Data Analytics or related, with the intent of going back to school at the start of your work term.\nStrong statistical and analytical skills and interest are necessary.\nExcellent verbal and written communication with the ability to work collaboratively and effectively in a team environment.\nExperience in Python, SQL and/or other data-related programming languages.\nExperience with visualizations and building dashboards in Tableau is considered an asset.\nKnowledge/experience with machine learning is considered an asset.\nExperience with Data Management, Analytics, and Project Management is a plus.\n\nADDITIONAL INFORMATION\n\nThis position is a 4-month work term and will commence May 5th - August 29th, 2025.\nApplications must include a transcript, cover letter (one letter-sized page or less) and a resume (maximum of 2 pages).\nWe welcome all applications; however, we will only contact qualified candidates chosen for an interview. Thank you for your interest.\nTD requires employees to reside in the country where the role is located, irrespective of remote working arrangements\nTD is committed to providing you with the best candidate experience and internship in these unique circumstances. As such, work location and start dates are subject to change.\n\nHOURS: Monday-Friday, standard business hours.\n\nINCLUSIVENESS\n\nAt TD, we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. We are dedicated to building a workforce that reflects the diversity of our customers and communities in which we live and serve. If you require an accommodation for the recruitment/interview process (including alternate formats of materials, or accessible meeting rooms or other accommodation), please let us know and we will work with you to meet your needs.\n\nWho We Are\n\nTD is one of the world's leading global financial institutions and is the fifth largest bank in North America by branches/stores. Every day, we deliver legendary customer experiences to over 27 million households and businesses in Canada, the United States and around the world. More than 95,000 TD colleagues bring their skills, talent, and creativity to the Bank, those we serve, and the economies we support. We are guided by our vision to Be the Better Bank and our purpose to enrich the lives of our customers, communities and colleagues.\n\nTD is deeply committed to being a leader in customer experience, that is why we believe that all colleagues, no matter where they work, are customer facing. As we build our business and deliver on our strategy, we are innovating to enhance the customer experience and build capabilities to shape the future of banking. Whether you've got years of banking experience or are just starting your career in financial services, we can help you realize your potential. Through regular leadership and development conversations to mentorship and training programs, we're here to support you towards your goals. As an organization, we keep growing - and so will you.\n\nOur Total Rewards Package\n\nOur Total Rewards package reflects the investments we make in our colleagues to help them and their families achieve their financial, physical, and mental well-being goals. Total Rewards at TD includes a base salary, variable compensation, and several other key plans such as health and well-being benefits, savings and retirement programs, paid time off, banking benefits and discounts, career development, and reward and recognition programs. Learn more\n\nAdditional Information:\nWe're delighted that you're considering building a career with TD. Through regular development conversations, training programs, and a competitive benefits plan, we're committed to providing the support our colleagues need to thrive both at work and at home.\n\nPlease be advised that this job opportunity is subject to provincial regulation for employment purposes. It is imperative to acknowledge that each province or territory within the jurisdiction of Canada may have its own set of regulations, requirements.\n\nColleague Development\nIf you're interested in a specific career path or are looking to build certain skills, we want to help you succeed. You'll have regular career, development, and performance conversations with your manager, as well as access to an online learning platform and a variety of mentoring programs to help you unlock future opportunities. Whether you have a passion for helping customers and want to expand your experience, or you want to coach and inspire your colleagues, there are many different career paths within our organization at TD - and we're committed to helping you identify opportunities that support your goals.\n\nTraining & Onboarding\nWe will provide training and onboarding sessions to ensure that you've got everything you need to succeed in your new role.\n\nInterview Process\nWe'll reach out to candidates of interest to schedule an interview. We do our best to communicate outcomes to all applicants by email or phone call.\n\nAccommodation\nYour accessibility is important to us. Please let us know if you'd like accommodations (including accessible meeting rooms, captioning for virtual interviews, etc.) to help us remove barriers so that you can participate throughout the interview process.\n\nWe look forward to hearing from you!"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}