{
  "title": "245296 - Co-op Opportunities with SAP Canada (Apply ASAP)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "CHECK INDIVIDUAL JOB POSTINGS\nPlease be sure to:\n\nCheck the employer's site for the actual application deadline date. It may not be the same date used in this posting.\nCheck the employer's site for the actual location of the position. It may not be in the same city as used for this posting.\nCheck the work duration of the position. Work terms may be offered for 4, 8, 12, or 16 months.\nKEEP A COPY: It is also recommended that you keep copies of any postings that you apply to as they may be removed from the employer's site once the job closes.\n\n8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNote For Commerce Students: Only students who have completed the core (i.e. that have completed their 3rd year) may be eligible for back-to-back work terms.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Co-op Opportunities with SAP Canada (Apply ASAP)"
    },
    {
      "key": "Job Location:",
      "value": "Various"
    },
    {
      "key": "Region:",
      "value": "Various"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "9"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "About SAP\nAs the market leader in enterprise application software, we're helping companies of all sizes and in all industries run better by redefining ERP and creating networks of intelligent enterprises that provide transparency, resiliency, and sustainability across supply chains. Our end-to-end suite of applications and services enables our customers to operate profitably, adapt continuously, and make a difference worldwide.\n\nWe help the world run better\nOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.\n\nAbout the SAP Internship Experience Program\nThe SAP Internship Experience Program is SAP's global, strategic, paid internship program that provides university students with opportunities to find purpose in their careers.\n\nThree reasons to intern at SAP\n\nCulture of collaboration: meet with mentors, make new friends across the globe and create a thriving personal network.\nProject-driven experience: gain cross-functional skills from our virtual and in-person learning sessions, diverse subject matter experts, and project deliverables.\nGain visibility: with SAP Internship Experience Program in your title, you'll have a global network of SAP leaders, entrepreneurs and career development opportunities at your fingertips."
    },
    {
      "key": "Qualifications:",
      "value": "SAP open positions\n\n\nCHECK INDIVIDUAL JOB POSTINGS\nPlease be sure to:\n\nApply as soon as possible since the employer is reviewing the applications as they come in.\nCheck the employer's site for the actual application deadline date. It may not be the same date used in this posting.\nCheck the employer's site for the actual location of the position. It may not be in the same city as used for this posting.\nCheck the work duration of the position. Work terms may be offered for 4, 8, 12, or 16 months.\n\nSPECIAL NOTES:\n\nSAP job opportunities are changing all the time so it's worthwhile to look regularly.\nSuitable opportunities for a wide variety of students' field of studies\nKeep copies of any postings that you apply to as they may be removed from the employer's site once the job closes. You will need this information for interview preparation if you are shortlisted.\n\n\nWhat you bring\n\nWe're looking for someone who takes initiative, perseveres, and stay curious. You like to work on meaningful innovative projects and are energized by lifelong learning.\n\n\nWe build breakthroughs together\nSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.\n\nWe win with inclusion\nSAP's culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone - regardless of background - feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\n\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team.\n\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.\n\nEOE AA M/F/Vet/Disability:\nQualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\n\nSAP believes the value of pay transparency contributes towards an honest and supportive culture and is a significant step toward demonstrating SAP's commitment to pay equity. SAP provides the hourly base salary rate range applicable for the posted role. The targeted range for this position is 24-40 CAD. The actual amount to be offered to the successful candidates will be within that range, dependent upon the key aspects of each case which may include education, skills, experience, scope of the role, location, etc. as determined through the selection process. SAP offers limited benefits for employees hired into hourly or like roles subject to appliable plan/policy terms. A summary of benefits and eligibility requirements can be found by clicking this link."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}