{
  "title": "245397 - Engineering Student, Systems Engineering - Space Missions - Summer 2025",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "RESTRICTION TO ELIGIBILITY (CONTROLLED GOODS PROGRAM)\n\nThis opportunity is posted by a company subject to Canada's CGP (Controlled Goods Program). Security screening is required for employees, which includes the following:\n\nProof of citizenship\nProof of residence\nCriminal records check (Canada)\nCertificate of good conduct from each country where the individual has resided for six consecutive months or more\n\nWORK DURATION: 8 MONTHS (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each additional work term above the mandatory four.\n\nNEED HELP TO RELOCATE? If you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section \"Co-operative Education Travel Awards for Work Terms outside Victoria\"."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Engineering Student, Systems Engineering - Space Missions - Summer 2025"
    },
    {
      "key": "Job Location:",
      "value": "Richmond"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$23.00 - $26.00/hour"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Engineering Student, Systems Engineering - Space Missions - Summer 2025\n\nJob category: Engineering\n\nRequisition number: ENGIN008366\n\nDescription\n\nBuilding the space between proven and possible, MDA Space (TSX:MDA) is a trusted mission partner to the global space industry. A robotics, satellite systems and geointelligence pioneer with a 55-year+ story of world firsts and more than 450 missions, MDA Space is a global leader in communications satellites, Earth and space observation, and space exploration and infrastructure.\n\nThe MDA Space team of more than 3,000 space experts in Canada, the US and the UK has the knowledge and know-how to turn an audacious customer vision into an achievable mission - bringing to bear a one-of-a-kind mix of experience, engineering excellence and wide-eyed wonder that's been in our DNA since day one. For those who dream big and push boundaries on the ground and in the stars to change the world for the better, we'll take you there.\n\nAre you ready to launch the next stage of your career in the new space economy? We would love to hear from you!\n\nDetails\n\nWe're on the hunt for a Systems Engineering Co-op - Space Missions in our Geointelligence Engineering Team at our Richmond office.\n\nAs a member of the Engineering team you will work on a program such as CHORUS, a satellite constellation using Synthetic Apperture Radar to derive worldwide insights about our planet. CHORUS builds on the strong heritage of the RADARSAT program and brings forward innovative new technologies and operations concepts to deliver a significantly enhanced capability. You will work as part of a world-leading team to develop new capabilities, enhance existing capabilities and deliver solutions to our customers.\n\nOverall the successful candidate would be treated similar to a new graduate joining our company, where tasks will be assigned relative to the level of schooling and experience achieved to date.\n\nResponsibilities:\n\nAs a Systems Engineering Co-op - Space Missions, you may have a wide range of responsibilities that may include:\n\nworking with stakeholders to understand their needs and requirements;\n\ntransforming high level requirements into lower level feature requirements;\n\ndevising solutions for creating and delivering these features;\n\nsupporting work planning, cost estimates and proposal writing;\n\nperforming technical engineering tasks, such as operational analyses and trade-off studies, to define system design and subsystem details;\n\ndeveloping operations procedures, scripts, tools and other products for on-orbit commissioning and routine operations of the mission;\n\nconducting spacecraft and mission operations validation testing, as well as mission control exercise and rehearsal activities;\n\ndeveloping and maintaining various system budgets (uplink, downlink, power, etc); and\n\ndeveloping and maintaining various system models in Excel, Matlab, Python, SysML etc."
    },
    {
      "key": "Qualifications:",
      "value": "Requirements:\n\n8 months availability\n\nhave familiarity with the following software tools:\n\nMS Excel, for the purposes of engineering analyses\n\nMS Office\n\nhave excellent verbal and written communication skills\n\nbe a self-starter with the ability to perform in a dynamic working environment\n\npossess excellent problem solving skills\n\nhave a team-friendly attitude and willingness to learn\n\nWhile not mandatory, candidates will benefit from any of the following:\n\nExperience in scripting and/or programming\n\nFamiliarity with mission modelling tools such as AGI's Systems Tool Kit (STK), MATLAB, etc\n\nFamiliarity with Requirements Management tools such as DOORS\n\nFamiliarity with satellite remote sensing or earth observation; or\n\nFamiliarity with orbital mechanics, satellite communications, spacecraft design and operation considerations.\n\nExperience:\n\nInterested candidates should be working towards a Bachelor's degree or post-graduate degree in Space Systems, Electrical or Computer Engineering. Ideal candidates are in 3rd or 4th year of their studies and part of a university Cubesat team.\n\nComments/Special Considerations:\n\nSuccessful candidates must obtain and hold security clearance at the reliability status level, and pass security assessment for the Controlled Goods Program (CGP).\n\nMDA is an equal opportunity employer prizing diversity and inclusion. We are committed to treating all employees and applicants for employment with respect and dignity. If you require assistance and/or reasonable accommodation due to a disability during the application or the recruiting process, please feel free to notify us.\n\nSalary:\n\nThe compensation range for this position is $23 - $26 hourly."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}