{
  "title": "245015 - Technology Specialist Co-op/Internship (Summer 2025)",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Technology Specialist Co-op/Internship (Summer 2025)"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Use your passion for technology and computer skills in a fast-growing company where you can have an impact. The British Columbia Investment Management Corporation (BCI) is currently seeking a Technology Specialist co-op student/intern for the Summer 2025 work term (May to August) to support the Customer Support Services (Technology Help Desk) and IT Service Management teams in improving their business processes and workflows.\n\nWHAT YOU NEED TO KNOW\n\nBCI manages a globally diversified portfolio of assets valued at $250.4 billion and is one of Canada's largest institutional investors. We invest globally to support pension and other funds for more than 30 clients based in British Columbia. We are proud to have been chosen as one of Canada's Top 100 Employers and BC's Top Employers. These national and provincial competitions recognize employers who offer exceptional workplaces for their employees.\n\nThe Technology Specialist co-op student/intern will work within our Technology Department. This is a great opportunity for you to learn and apply your knowledge to support and implement technology improvement initiatives driven by Customer Support Services Team.\n\nWHO YOU WILL WORK WITH\n\nThe Technology department is responsible for developing technology solutions that contribute to the achievement of BCI's mission and long-term goals. The department manages the Corporation's business applications and information technology infrastructure, providing support to a large group of financial professionals. The department is also responsible for authoring technology-related directives and conducting disaster recovery planning to minimize risk to the Corporation's delivery of investment services.\n\nWHAT YOU WILL BE DOING\n\nEvaluate IT processes identifying areas where the targeted process metrics are not reached, and holding regular benchmarking, maturity assessments and reviews\n\nDocument business processes and create playbooks/procedures that will be applied to the ServiceNow technology Knowledgebase in support of continuous improvement and/or projects\n\nSubmit requests to assist with continuous improvement activities\n\nDefine specific initiatives aimed at improving IT services and processes, based on the results of service reviews and process evaluations\n\nVerify if improvement initiatives are proceeding according to plan, and to introduce corrective measures where necessary\n\nMeasure, report and communicate on IT service improvement initiatives\n\nCollaborate with Technology Service Desk Team on day-to-day operations\n\nWHAT WE OFFER\n\nExcellent career development and training by helping the candidate to understand the tools, the data and the methodologies applied by BCI Technology Department to support enterprise level technology and practice industry standard.\n\nWork with a dynamic team in a fast-paced environment\n\nThe development of real-world skills at one of the largest institutional investors in Canada\n\nExposure to some of the most talented, approachable, and inspiring people in the industry\n\nThe ability to opt-in for access to Dialogue, a user-friendly app that offers virtual primary care, employee and family services, and mental health supports\n\nTime to connect with co-op students & interns at BCI - build your network and shared learning\n\n2 paid days per year for volunteering\n\nBCI investment professionals lead a monthly Investment Club to share industry knowledge with employees who work in other departments\n\nTravel: if coming to Victoria for this work term, BCI will provide a fixed-rate travel allowance based on your location\n\nCompetitive pay: Mid / Back Office: $2,260.00 gross bi-weekly or $2,090.00 gross bi-weekly + vacation leave paid based on 6% of salary ($2,260.00 gross biweekly for those with (or working towards) a graduate degree or joining the Investment Strategy & Risk department and $2,090.00 gross biweekly for those with (or working towards) an undergraduate degree, diploma, or certificate)\n\nTHE DETAILS\n\nWork term: Summer 2025 (May to August)\n\nDepartment: Technology\n\nOffice Location: 750 Pandora Avenue, Victoria, BC\n\nSpend your off hours exploring beautiful Victoria and Vancouver Island\n\nAll co-ops/internships will need to be completed in person at our Victoria office with the option to work one day per week from home. Please note, some positions are not eligible for hybrid work."
    },
    {
      "key": "Qualifications:",
      "value": "REQUIRED SKILLS\n\nBachelor's degree or diploma in Computer Science or a related field\n\nAbility to work effectively in a fast-paced, multi-project environment with multiple stakeholders\n\nBasic knowledge of IT service management practices including request management, incident management and knowledge management\n\nExcellent customer-service, listening, communication skills and problem-solving skills\n\nExcellent interpersonal and collaboration skills, and the ability to work with technical and non-technical stakeholder groups\n\nStrong written communication skills and the ability to develop documentation for internal audiences at multiple levels of the organization\n\nUnderstanding the importance of writing procedures to guide a specific set of steps for end users\n\nStrong ability to listen and check for understanding through meeting minutes and requirements, process diagrams, etc.\n\nBaseline understanding of MS Windows, Active Directory and Azure infrastructures\n\nStrong Office 365 skills\n\nAbility to use Excel, PowerPoint, Word, and Outlook\n\nExperience with ServiceNow and JIRA is an asset"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}