{
  "title": "245217 - Software Engineer I - Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Software Engineer I - Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Company Overview\nAbout Planview\nPlanview has one mission: to build the future of connected work, from ideas to impact.\n\nAs the global leader in work and resource management, Planview helps organizations accelerate the achievement of what matters most, supporting our customers from need to speed, from passion to progress, and from overhead to optimization. We provide the industry's most comprehensive solutions designed for strategic planning, portfolio and resource management, Lean and Agile delivery, product portfolio management, capability, and technology management (enterprise architecture), innovation management, and collaborative work and project management. Our connected platform of solutions underpins the business and digital transformations of more than 4,500 customers globally, including 59 of the Fortune 100.\n\nAt Planview, our people connections drive our innovation and success. Our global team of 1400+ work remotely and across our offices including Austin, Vancouver, Hod HaSharon, Bangalore, Sydney, and Stockholm. We're proud of our world-class, connected culture built on our shared values, that supports our teams to be successful from anywhere.\n\nLearn more about our portfolio at planview.com, and connect with us on LinkedIn, Instagram, and X.\n\nThe Opportunity\nDo you want to gain valuable real-world experience to apply what you learn in your academic classes? Are you interested in finding out what career paths are available to you? If you answered 'yes', then you've come to the right place.\n\nAs a co-op student with Planview, you will get the opportunity to gain meaningful, paid work experience to support your academic learning. You will be supported in further developing your skills and have the chance to learn more about software development in a SaaS organization. ?\n\nWe're looking for Software Engineer 1 on our VIZ Core?team in Vancouver, BC for an 8-month co-op term.\n\nSoftware Engineer 1 on the VIZ?team will be challenged with a wide variety of technologies and responsibilities that will give you valuable skills for your career as a Software Engineer. You'll contribute directly to projects that help organizations interpret and harness their workflow data-giving you a fantastic opportunity to apply what you've learned in the classroom to real-world challenges.\n\nPlease note that only students currently enrolled in an applicable co-op program at BCIT, UBC, UVic, or SFU will be considered for this role. You must apply through your co-op office/university job board (along with academic transcript) and complete the application.\n\nWhat you'll do:\n\nWork with senior engineers to design and refine data processing architectures that integrate with external tools\n\nAssist in analyzing problems, defining requirements, and proposing solutions that align with our product objectives\n\nContribute to a culture of continuous improvement by providing thoughtful feedback on code, design, and processes\n\nLearn and apply cloud architecture and data processing best practices, expanding your knowledge base every step of the way using modern technologies such as Spark, MongoDB, PostgreSQL and Redshift\n\nDevelop highly scalable and resilient cloud applications in AWS using Java Springboot\n\nImprove our CI/CD pipeline in GitHub Workflows\n\nCollaborate in an environment that values innovation and teamwork, where your ideas and efforts will make a real impact\n\nParticipate in peer reviews for code reviews and design reviews.\n\nAnalyze, reproduce, and resolve technical and application problems.\n\nDevelop and maintain our automation tools and various test scenarios?\n\nBenefits at Planview\nWhat you'll get:\nAs a co-op student with Planview you'll get:\n\nExpected Salary Range for this role: $3500 to $4700 per month\nWeekly office lunches, lunch and learns, and social events\nUnplugged Days: additional time way away from work to recharge\n\nIf you are looking for a place to gain practical experience, develop your professional skills, and build the future of connected work, apply today!\n\nEqual Employment Opportunity at Planview\nPlanview is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, marital status, disability, gender identity or Veteran status."
    },
    {
      "key": "Qualifications:",
      "value": "What You'll Bring\nSkills and experience you'll have:\n\nExposure to software development in any modern object-oriented programming language such as Java/C++/C#\n\nBasic knowledge of computer science fundamentals, data structures, algorithms, distributed systems, problem solving and asynchronous architectures\n\nAbility to collaborate and communicate effectively in a team environment\n\nSelf-motivated with the ability to work proactively and seek guidance when needed\n\n\nNice to haves:\n\nExperience with Test-Driven Development?\n\nInterest in big data technologies (e.g., Spark, Apache Kafka)\n\nExperience with CI/CD tooling such as GitHub Actions, Jenkins?\n\nNetwork communications development (e.g. REST, HTTP)?\n\nExperience with Java (v17), Scala, or other JVM languages\n\nFamiliarity with storage tools (e.g., PostgreSQL, MongoDB)\n\nSome knowledge of containers and orchestration (e.g., Docker, Kubernetes)\n\nPrevious experience working on distributed teams (even for academic group projects)"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}