{
  "title": "245517 - Co-op Software Developer",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Co-op Software Developer"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "we are seeking a\n\nCO-OP SOFTWARE DEVELOPER\n\nWE BUILD SOLUTIONS THAT HELP SAVE LIVES\n\nZetron, a Codan company, is a trusted provider of communication products and solutions that help our customers protect, inform, and save lives. Whether they are conducting a search and rescue, containing a fire, maintaining safety, or providing security at a profile event, Zetron makes sure the customer can be heard over the mountain, throughout the city, or across the globe. We invite you to join our mission at our Canadian Head Office located near beautiful downtown Victoria in the newly restored Press Building with modern office space built for collaboration!\n\n\n\nTHE ROLE:\n\nThis is a minimum 4-month co-op based in Victoria, BC, with the strong likelihood for extension to 8 months.\n\nAt Zetron, we hire co-op students not only because we want to invest in developers, but also because it is an investment in our business. Did you know that 40% of our Engineering staff are UVic alumni?\n\nWe are recruiting for a Co-op Software Developer who can join our Agile team of Software Engineers as they develop the next generation of Zetron radio systems. We develop our radio systems entirely in-house, including the hardware, firmware, software, and user interface. Our software stack consists primarily of C and C++ running on an embedded Linux platform. We also develop applications with Java, C#, Windows Presentation Foundation (WPF) and .NET Framework and automated tests with PyTest (Python).\n\nAs a Zetron staff member, you won't be tasked with an isolated project. We will train you to be a fully functioning member of our Software team, participating in full-cycle Agile development. Throughout the course of your co-op term, you will:\n\nWork in an Agile/Scrum environment.\nWrite production code on large development project for use in mission critical systems.\nLearn Domain Driven Design and Message Bus Architecture.\nLearn advanced techniques in concurrent programming.\nLearn real-time programming techniques in a resource constrained environment."
    },
    {
      "key": "Qualifications:",
      "value": "ABOUT YOU:\n\nWe are looking for an ambitious co-op student, excited to take part in all aspects of the software development cycle who:\n\nHas a strong knowledge of embedded and object-oriented programming.\nIs familiar with software development tools (IDE, source control, unit and automated testing).\nUses strong communication and collaboration skills.\nLoves to identify and resolve problems.\nHas proven organizational, time management and prioritizing skills.\nIs eager to learn, grow, and be challenged by experienced developers.\n\nAPPLICATION INSTRUCTIONS:\n\nApplications can be submitted to: mailto:Jennifer.Beasley@zetron.com\n\nPlease include resume, cover letter, and transcript without any links (plain text is fine) to any websites\n\nin your application package. Only successful applicants will be contacted for interviews. Thank you!"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}