{
  "title": "245480 - Look Development Intern",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "DigiBC Work Placement Pilot Program This position is part of DigiBC's Work Placement Pilot Program, which supports post-secondary students by providing experiential learning opportunities in animation, video, games, visual effects, and XR. As a part of this program, participating students will benefit from customized orientation workshops, e-learning resources, mentoring support, and the opportunity to start building their own professional network in the creative technology industry. This position is open to students who are Canadian Citizens, Permanent Residents, or Protected Person as defined by the Immigration and Refugee Protection Act.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Look Development Intern"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$25/hr"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Job ID 10110358\nLocation Vancouver, Canada\nBusiness Walt Disney Animation Studios\n\n\nJob Summary:\n\nThe Internship Program\n\nHave you wondered how your skills and talents could translate into the world of Animation? Our internship program dives into the craft, technology and operations behind our animated films while developing your skills and connecting you to industry mentors. You'll learn what it means to be a part of a collaborative team and how your unique talents can grow within our studio. Find yourself immersed in hands-on projects and learning guided by our artists, technologists and production leaders.\n\nWalt Disney Animation Studios Summer Internship Program is a 12 week paid experience designed for students studying art, animation, computer graphics, and film. This role will be based onsite at our Vancouver studio.\n\nFor our 2025 programs, we are committed to providing mentorship and development. Walt Disney Animation Studios' production internship program provides emerging talent with an immersive view of Animation through educational seminars on craft and filmmaking, and individual and collective projects.\n\nThe Look Development Internship\n\nLook Development Artists focus on creating the materials, textures, and grooms that define the look of 3D characters and environments. We are looking for artists that have a great eye and exceptional critical thinking skills with regards to image deconstruction.\n\nHow to Apply:\n\nCreate or update your profile and apply online\nResume with month and year of expected graduation date\nPortfolio in PDF and/or website (don't forget to include your password, if applicable)\n\nDeadline for applications is Feb 28th, 2025 at 11:59 PM PST. v"
    },
    {
      "key": "Qualifications:",
      "value": "Reels/portfolios/demonstrated skills should include:\n\nExperience manipulating materials to achieve a specific Art Direction\nAbility to interpret and execute key aesthetic elements from visual development artwork into an asset\nDemonstrated ability to physically paint\nStrong problem solving skills\nAbility to work in a collaborative environment\nProficiency with Maya, Photoshop, Mari, Substance, or equivalent 3D and 2D tools - This is a plus\nExperience with procedural instancing or groom is a plus\nUnderstanding of shaders and physically based rendering a plus\nExperience/Enthusiasm to scripting a plus\nKnowledge of UNIX/Linux environment a plus\n\nAm I Eligible?\n\nAt the time of application, must be either enrolled in an accredited college/university or within 6 months of graduation.\nThis internship will be based in Vancouver, B.C. for 12 weeks May-August 2025. Interns must be available for the duration of a 12-week assignment.\nApplicants must be 18 years of age or older.\nOpen to B.C. residents only who currently have the right to work in Canada."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "Yes"
    }
  ]
}