{
  "title": "245530 - Estimating Engineer",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Estimating Engineer"
    },
    {
      "key": "Job Location:",
      "value": "Richmond"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Start Date:",
      "value": "04/28/2025"
    },
    {
      "key": "End Date:",
      "value": "08/29/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Requisition ID: 2025-6681\n\nOverview\n\nWork and train with the industry's finest professionals! Flatiron's Intern Program provides challenging and rewarding work opportunities for college students majoring in Civil Engineering and Construction Management.\n\nAs an Estimating Intern, you will be given the opportunity to apply your academic training and skills in a real-world setting at any number of project locations. In addition, you will assist the estimating team by assisting in preparing the estimate for assigned construction discipline.\n\nIn performing any number or combination of the following tasks, you shall support published corporate policies, set a productive and consistent work example, and be responsible to follow up on all tasks assigned.\n\nWhat you will be doing\n\nAids in reviewing proposal specifications, drawings, attend pre-bid meetings, etc. to help determine scope of work and required contents of estimate.\nAssists in reviewing historical data from purchase orders, subcontracts, productivity analysis reports, etc. into unit and person-hour figures.\nSupports estimating team by helping to prepare discipline estimates by calculating complete takeoff of scope of work. Assists in calculating material quantity requirements from engineering drawing dimensions.\nConsults with clients, vendors, or other individuals to discuss and formulate estimates and resolve issues.\nAssists with design review options and recommends best solution based on cost, engineering quality, or availability of materials.\nPartners with estimating team to prepare and conduct project hand-off meetings between pursuit team and project management team.\nResearches and recommends vendors and subcontractors for designated scopes of work to achieve pursuit and cost goals.\nMaintains knowledge of Company's values and strategic plan.\nSupport published corporate policies.\nPerform additional assignments per management's direction."
    },
    {
      "key": "Qualifications:",
      "value": "What we are looking for\n\nEstimating interns/co-ops are required to be currently enrolled in Engineering, Construction Management or a similar program at an accredited technical college or university.\nThis will be a 4 month co-op in our Richmond office starting April 28, 2025 and ending August 29, 2025\n\nWhy work for us\n\nSome of the benefits you may be eligible for as an employee are:\n\nComprehensive compensation package and paid time off program\nIndustry leading 401(k)/RRSP\nMedical/Extended Health Care, Dental, Vison and/or Provincial Medical\nWellness benefits & Employee Assistance Program\nTuition Reimbursement Program\n\nWe are an EEO/AA/ADA/Veterans employer.\n\nSalary Max\n\nCAD $24.00/Hr."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}