{
  "title": "245233 - Engineering & Opportunities | Ontario Power Generation | Look Inside for Multiple Jobs",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "CHECK INDIVIDUAL JOB POSTINGS\n\nPlease be sure to:\n\nCheck the employer's site for the actual application deadline date. It may not be the same date used in this posting.\nCheck the employer's site for the actual location of the position. It may not be in the same city as used for this posting.\nCheck the work duration of the position. Work terms may be offered for 4, 8, 12, or 16 months.\nKEEP A COPY: It is also recommended that you keep copies of any postings that you apply to as they may be removed from the employer's site once the job closes.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria\n\nLocation Resources for Toronto\n\nTourism\nStatistics\nReviews\nTransportation\nAccommodation - Rentals\nThings to do"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months or 8 Months"
    },
    {
      "key": "Job Title:",
      "value": "Engineering & Opportunities | Ontario Power Generation | Look Inside for Multiple Jobs"
    },
    {
      "key": "Job Location:",
      "value": "Various"
    },
    {
      "key": "Region:",
      "value": "Various"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$34.01/hr"
    },
    {
      "key": "Number of Positions:",
      "value": "3"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Electrify your career and help build a brighter tomorrow.\n\nEvery generation has a challenge that defines them. At OPG, we are calling on all innovators, disruptors, thought leaders and change-makers. Join us to electrify life in one generation and build a sustainable future powered by our electricity, our ideas, and our people. Join OPG and make history.\n\nWhether you work in the skilled trades or are a business professional, a career at OPG is an opportunity to electrify your life on -- and off -- the job.\n\nACCOMMODATIONS\nOPG is committed to fostering an inclusive, equitable, and accessible environment where all employees feel valued, respected, and supported. If you require accommodation during the application or interview process, please advise us as soon as possible so appropriate arrangements can be made.\n\nIf you require information in a format that is accessible to you, please contact AODA@opg.com\n\nJOB OVERVIEW\nOntario Power Generation (OPG) is looking for a dynamic,strategic, and results-driven professionals to join our team in the role of Engineering & Applied Science Internship program located in Niagara, Ontario.\n\nAs Ontario's largest clean energy generator, OPG is committed to providing challenging opportunities in a work environment where safety is a fundamental value. Students will gain meaningful hands-on work experience that will complement their academic studies and offer insight into potential career paths. Students will be able to apply their knowledge, broaden their skills and make a valuable contribution to an organization that is vital to Ontario's success.\n\nAs a Professional Engineering Year Internship student, you will be teamed with a staff engineer to assist in their assigned work program. You will be given the opportunity to contribute to the success of our business by undertaking technically challenging projects or tasks with coaching and mentoring from staff who are highly experienced in the power generation industry.\n\nThe compensation rate for these positions starts at $34.01 per hour and will be commensurate with education & experience.\n\nThis is an exciting opportunity to work in an environment where you will contribute to OPG's public outreach, engagement, and education efforts as part of the company's commitment to growing its social license.\n\nKEY ACCOUNTABILITIES\n\nWork with a multi-disciplined team of engineering and technical specialists to support the generation of the various systems\nContribute to the overall objective of achieving an integrated environment dedicated to the safe and reliable operation of OPG's plants.\nAssist with developing and executing projects in compliance with the nuclear industry's demanding set of regulations and standards using established project management processes.\nMaintaining written documented processes and procedures to reflect improved operating methods and additions to all supported systems.\n\nQUALIFICATIONS\n\nStructural engineering courses and experience (Civil position)\nSound fundamental knowledge of engineering principles\nSuperior analytical and problem-solving skills\nAptitude in numerical analysis\nWillingness to learn, take initiative and trouble-shoot\nExcellent verbal, written and inter-personal communication skills\nProject management experience\nOrganizational and leadership skills\nAbility to work well both independently and in a team environment.\n\nWhat Makes a Career at OPG Different\nAs Ontario's largest clean energy generator, we're building, expanding, and innovating the equipment and technology that keeps Ontario powered with clean, reliable energy.\n\nAt OPG, our values are our strengths.They are fundamental truths about our organization that don't change:\nSafety- it's our business\nIntegrity- always lead with integrity\nExcellence- never satisfied with good enough\nInclusion- working together for powerful outcomes\nInnovation- creativity accelerates possibility.\n\nHere's why OPG might just be the ideal workplace for you:\n\nExceptional range of opportunities province-wide\nLong-term career growth and development opportunities\nElectricity is vital to the province and OPG's clean electricity is helping decarbonize other sectors.\n\nOur promise to you:\n\nWe care about the safety and the well-being of our employees. It is our utmost priority.\nA supportive work environment where you can be your best every day.\nOpportunities to stretch and develop.\nOffer different ways for you to give back to communities where we operate.\nPartner with Indigenous communities and support local businesses.\nWe support employment equity, diversity, and inclusion.\n\nAre you ready to start a career that has the power to electrify life on and off the job? Apply now."
    },
    {
      "key": "Qualifications:",
      "value": "Job Title\n\n\t\n\nDuration\n\n\n\n\nSummer 2025 Student - Co-op - Clarington, Durham, Toronto, ON\n\n\t\n\n4 or 8 Months\n\n\n\n\nSummer 2025 Student - Co-op - Thunder Bay, ON\n\n\t\n\n4 or 8 Months\n\n\n\n\nSummer 2025 Student - Co-op - Niagara Falls, ON\n\n\t\n\n4 or 8 Months\n\n\n\n\nSummer 2025 Student - Co-op (Environmental Management OR Electrical Engineering) - Renfrew, ON\n\n\t\n\n4 or 8 Months\n\n\n\n\nSummer 2025 Student - Co-op - Lennox, ON\n\n\t\n\n4 or 8 Months"
    },
    {
      "key": "Job Title",
      "value": "Duration"
    },
    {
      "key": "Summer 2025 Student - Co-op - Clarington, Durham, Toronto, ON",
      "value": "4 or 8 Months"
    },
    {
      "key": "Summer 2025 Student - Co-op - Thunder Bay, ON",
      "value": "4 or 8 Months"
    },
    {
      "key": "Summer 2025 Student - Co-op - Niagara Falls, ON",
      "value": "4 or 8 Months"
    },
    {
      "key": "Summer 2025 Student - Co-op (Environmental Management OR Electrical Engineering) - Renfrew, ON",
      "value": "4 or 8 Months"
    },
    {
      "key": "Summer 2025 Student - Co-op - Lennox, ON",
      "value": "4 or 8 Months"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "3"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}