{
  "title": "245129 - Summer 2025 Co-Op Student: Full Stack Developer (8 Months)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms)\n\nPlease ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Summer 2025 Co-Op Student: Full Stack Developer (8 Months)"
    },
    {
      "key": "Job Location:",
      "value": "Victoria, BC"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$25 / hr"
    },
    {
      "key": "Hours per Week:",
      "value": "40"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "End Date:",
      "value": "01/05/2026"
    },
    {
      "key": "Number of Positions:",
      "value": "3"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "We are seeking a hard-working Full Stack Developer looking to kick-start their career through joining our growing and dynamic team. This is a great opportunity to work under the mentorship of our Project and Program Manager to assist and support the development team in all design-related tasks.\n\nAt CGI, our strength is built on our ability to work together. Our diverse set of backgrounds offer different perspectives and new ways of thinking. It encourages lively discussions, inspires thought leadership, and helps us build better solutions for our people and clients. We are seeking someone who thrives in this setting and is inspired to craft meaningful solutions through true collaboration.\n\nStart Date: May 5th, 2025 (8 or 12 Months)\nLocation: Vancouver or Victoria - Hybrid\n\nPerks of Being a CGI Co-op:\n• Participate in monthly socials to meet co-ops across the country.\n• Access professional development workshops hosted by domain experts on topics ranging from how to be a top consultant, how to apply the agile methodology, data & analytics and more!\n\n\nlearn more about CGI and hear from our Co-ops and New Grads\n\n\nYour future duties and responsibilities\n• To join and contribute to a cross-functional software development team.\n• Develop API services and web applications as per the client specifications using coding standards and standard methodologies.\n• Perform unit testing and defect fixes.\n• Participate in project planning meetings along with all relevant agile ceremonies.\n• Co-ordinate with business analysts and testing teams for delivery.\n• Work standard and additional overtime hours to meet project outputs and pager support.\n\nBC Wage Range Disclaimer\nCGI is required by law in some jurisdictions to include a reasonable estimate of the compensation range for this role. The determination of this range includes various factors including but not limited to skill set level, geographic market, experience and training, and licensure and certifications. Compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range in British Columbia is $25.00 / hour."
    },
    {
      "key": "Qualifications:",
      "value": "Required qualifications to be successful in this role\n\nWhat We're Looking for:\n• Willing to be a player of many hats\n• Takes accountability for results and exhibits a \"can do\" demeanor.\n• Has an appetite to continuously evolve and improve, address difficult problems and seek/give constant feedback.\n• Demonstrates flexibility and is able to move forward without having all of the answers.\n• Champions a high-performance environment and contributes to an inclusive work environment.\n\nYour Qualifications:\n• Must be part of an accredited Co-op Program\n• Experience with Java and/or .NET and familiarity with all stages of the SDLC lifecycle.\n• Familiarity with JavaScript frameworks such as Angular, VUE and React.\n• Currently enrolled in Computer Science related program.\n• Ready to complete 8-month co-op term\n• Basic knowledge of relational databases and SQL.\n• Analytical conduct and good problem-solving skills.\n• Superb communication and interpersonal skills."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "Yes"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}