{
  "title": "245336 - Software Engineering Intern, Go To Market (Summer 2025)",
  "details": [
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Software Engineering Intern, Go To Market (Summer 2025)"
    },
    {
      "key": "Job Location:",
      "value": "Remote"
    },
    {
      "key": "Region:",
      "value": "Remote"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, fully remote"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$5,500 - $6,500/month CDN"
    },
    {
      "key": "Start Date:",
      "value": "05/27/2025"
    },
    {
      "key": "End Date:",
      "value": "08/15/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Company Description\n\nDropbox is a special place where we are all seeking to fulfill our mission to design a more enlightened way of working. We're looking for innovative talent to join us on our journey. The words shared by our founders at the start of Dropbox still ring true today. Wouldn't it be great if our working environment-and the tools we use-were designed with people's actual needs in mind? Imagine if every minute at work were well spent-if we could focus and spend our time on the things that matter. This is possible, and Dropbox is connecting the dots. The nearly 3,000 Dropboxers around the world have helped make Dropbox a living workspace - the place where people come together and their ideas come to life. Our 700+ million global users have been some of our best salespeople, and they have helped us acquire customers with incredible efficiency. As a result, we reached a billion dollar revenue run rate faster than any software-as-a-service company in history. Dropbox is making the dream of a fulfilling and seamless work life a reality. We hope you'll join us on the journey.\n\nTeam Description\n\nOver the years at Dropbox, Emerging Talent has created a variety of internships, apprenticeships, and early-in-career full time opportunities to build pathways for exceptional early career professionals to succeed at Dropbox. Supported by a community of mentors, program graduates, and fellow participants, our Emerging Talent programs are the perfect place to start your career in tech.\n\nRole Description\n\nDropbox's Go To Market (GTM) Technology team is looking for a Software Engineering Intern to supporting building best-in-class support experiences that delight our customers. As a Software Engineering Intern, you will be working closely with stakeholders across our Global Customer Organization helping create and improve self-serve customer experiences. You'll work side-by-side with a dedicated, experienced Dropboxer as your mentor, have ownership of a high-impact project, and receive regular and effective feedback on your work. We'll also help you connect with fellow interns, establish mentors, and build the foundation of a strong professional network. Our goal is to create a robust and impactful learning experience. You can expect to apply your coursework and further develop your experience across the GTM Engineering team.\n\nFor Summer 2025, we offer two start dates culminating in a 12-week internship:\n\n5/27 - 8/15\n6/24 - 9/12\n\nResponsibilities\n\nAs a GTM Engineering intern, you'll be involved in a full-stack project focusing on areas such as:\n\nEnhancing the Customer Experience team's ability to understand and resolve users' issues.\nInfluencing the user interaction with Dropbox through our support website.\nIntegrating support ticketing with internal systems for seamless operations.\nAdvocating for secure and scalable internal development practices.\nDeveloping tools to empower users in diagnosing and resolving issues independently."
    },
    {
      "key": "Qualifications:",
      "value": "Requirements\n\nCurrently pursuing a BS in Computer Science or related technical field involving coding (e.g., physics or mathematics), or equivalent technical experience, graduating in Winter 2025 or Spring of 2026\n\nExperience writing or shipping software (Python and/or JavaScript) as part of coursework, personal projects, internships, coding competitions or research\n\nPassion to learn, problem solve, and challenge the status quo\n\nCompensation\n\nCanada Pay Range\n\n$5,500-$6,500 CAD\n\nBenefits\n\nDropbox is committed to investing in the holistic health and wellbeing of all Dropboxers and their families. Our benefits and perks programs include, but are not limited to:\n\nCompetitive medical, dental and vision coverage*\nRetirement savings through a defined contribution pension or savings plan**\nFlexible PTO/Paid Time Off policy in addition to statutory holidays, allowing you time to unplug, unwind, and refresh\nIncome Protection Plans: Life and disability insurance*\nBusiness Travel Protection: Travel medical and accident insurance*\nPerks Allowance to be used on what matters most to you, whether that's wellness, learning and development, food & groceries, and much more\nParental benefits including: Parental Leave, Fertility Benefits, Adoptions and Surrogacy support, and Lactation support\n\nMental health and wellness benefits\n\nAdditional benefits details are available upon request.\n\n*Where group plans are not available, allowances may be provided\n\n**Benefit, amount, and type are dependent on geographical location, based upon applicable law or company policy"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}