{
  "title": "245440 - Data Scientist - 4 Month Co-op/Internship (Calgary)",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "NEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "4 Months (12-18 weeks) Full Time (1 Work Term)"
    },
    {
      "key": "Job Title:",
      "value": "Data Scientist - 4 Month Co-op/Internship (Calgary)"
    },
    {
      "key": "Job Location:",
      "value": "Calgary"
    },
    {
      "key": "Region:",
      "value": "AB-Calgary"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Hours per Week:",
      "value": "35"
    },
    {
      "key": "Start Date:",
      "value": "05/05/2025"
    },
    {
      "key": "End Date:",
      "value": "08/22/2025"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Job Id: R144217\n\nOur employees are at the heart of everything we do. Together, we help people, businesses, and society prosper in good times and be resilient in bad times.\n\n\nOur employee promise represents Intact's commitment to you in exchange for living our Values, striving to do your best work, being open to change and investing in your career. In return, we promise to provide support, opportunities and performance-led financial rewards at a workplace where you can shape the future, win as a team and grow with us.\n\nAbout the role\n\nAs a Data Science Co-op/Intern, you will take on stimulating projects that offer opportunities to learn and grow as part of a multidisciplinary team with a mandate to develop and roll out innovative products. CLICK HERE to watch a video on how the #intactlab #datascience team is helping to transform the way millions of Canadians protect the things they love.to watch a video on how the #intactlab #datascience team is helping to transform the way millions of Canadians protect the things they love. As an Intern or Co-op student joining our innovation lab, you'll be surrounded by a diverse team of experts who are transforming the insurance experience for millions of Canadians. Think machine learning, data science, AI, geomatics, climate and agility - it's all in a day's work at Intact Lab.\n\nWhat you'll do here:\n\nTransform complex data sets into meaningful insights, conclusions and recommendations\nParticipate in developing completely new and innovative solutions, using machine learning, AI and statistical approaches\nGet experience working with different types of data including geospatial, telematics, text data and image data\nBe on the lookout for new approaches and opportunities to integrate them into the solutions you design"
    },
    {
      "key": "Qualifications:",
      "value": "What you bring to the table:\n\nCurrently pursuing a Bachelor's, Master's or PhD, in artificial intelligence, data science, computer science, Earth sciences, mathematics, statistics or a related field\nAvailable to work with us 35 hours per week for Summer 2025 (May 5 to August 22)\nAvailable to work from the office 2 days a week (and 3 from home)\nMust be returning to school in Fall 2025 or Winter 2026 following your internship\nPractical experience in data science, machine Learning or deep learning\nPractical experience with Python programming language\nKnowledge of computer vision or natural language processing (NLP) (an asset)\nUnderstanding of data science approaches in financial services (an asset)\n\nYour career starts here. Apply today!\n\nWe can't wait to learn more about you. When you complete your application, remember to include your resume and University/College transcript. We hire co-ops every semester (Winter, Summer and Fall)!\n\nWe're accepting applications now through January 24. All submissions will be reviewed during this time, as well as after the posting closes.\n\nWhat we offer\n\n\nOur hybrid work model provides the balance between working from home and enjoying meaningful in-person interactions.\nWorking here means you'll be empowered to be and do your best every day. Here is some of what you can expect as a permanent member of our team:\nA financial rewards program that recognizes your success\nAn industry leading Employee Share Purchase Plan; we match 50% of net shares purchased\nAn extensive flex pension and benefits package, with access to virtual healthcare\nFlexible work arrangements\nPossibility to purchase up to 5 extra days off per year\nAn annual wellness account that promotes an active and healthy lifestyle\nAccess to tools and resources to support physical and mental health, embracing change and connecting with colleagues\nA dynamic workplace learning ecosystem complete with learning journeys, interactive online content, and inspiring programs\nInclusive employee-led networks to educate, inspire, amplify voices, build relationships and provide development opportunities\nInspiring leaders and colleagues who will lift you up and help you grow\nA Community Impact program, because what you care about is a part of what makes you different. And how you contribute to your community should be just as unique.\n\nWe are an equal opportunity employer\n\n\nAt Intact, our Value of respect is founded on seeing diversity as a strength. We strive to create an accessible workplace where employees feel valued, included and encouraged to share their unique perspectives.\n\n\nWe encourage applications from individuals who are members of equity-deserving groups, including but not limited to women, Indigenous peoples, persons with disabilities, Black people, and members of the 2SLGBTQI+ community.\n\n\nAs part of Intact's commitment to reconciliation, we acknowledge that we work, meet and travel across the land currently called Canada, originally inhabited by First Nations, Metis and Inuit people. This history extends through many centuries and continues to evolve today.\n\n\nWe have policies to ensure equal access and participation for people with disabilities, including providing workplace adjustments (accommodations). A copy of applicable policies is available on request.\n\n\nIf we can provide a specific adjustment to make the recruitment process more accessible for you, please let us know when we reach out about a job opportunity. We'll work with you to meet your needs.\n\n\nLearn more about our recruitment process and your candidate journey here."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}