{
  "title": "245005 - Product Engineer Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Product Engineer Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Richmond, BC"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "3750 - 4050 CAD per month"
    },
    {
      "key": "Hours per Week:",
      "value": "40"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "A bit about the company\n\nNETGEAR is a fast-paced, innovative and collaborative company that has earned a reputable status in the tech industry with our Wireless Mobile Hotspot division and Connected Home Products (Orbi, Nighthawk Routers). When you work at NETGEAR, you are part of a dynamic team committed to helping the world do more. We turn ideas into innovative networking products that connect people, power businesses and advance the way we live.\n\nDo you like to be challenged and have fun at the same time? Our Canadian facility is a R&D office focused on creating and building products that people want! Join our network and help us shape the future of connectivity.\n\nAs a company, we value our employees who are the most essential building blocks of our success. We strive to attract top talent and create a great workplace where people feel engaged, inspired, challenged, proud and respected.\n\nWhat you will get\n\nA flexible work environment, working in a Hybrid work model\nWhen in the office, we have a gym, lots of catered meals and comfortable spaces to engage with your fellow NETGEARians through games like foosball and ping pong or simply hanging out\nNumerous in-office and external social events including a Summer Party, Holiday party and celebrations every month\n\nNETGEAR is an equal opportunity employer and makes employment decisions on the basis of merit. We want to have the best available people in every job. Company policy prohibits unlawful discrimination based on race, colour, religious creed, sex, gender, gender identity, gender expression, marital status, registered domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition including genetic characteristics, sexual orientation or any other consideration made unlawful by federal, provincial, or local laws. It also prohibits unlawful discrimination based on the perception that anyone has any of those characteristics, or is associated with a person who has or is perceived as having any of those characteristics.\n\nDoes this sound like a role you would love? If it does and you match what we are looking for, we'll be in touch, otherwise we really want to thank you for applying and would like you to be on the lookout for other NETGEAR opportunities that fit your skills and experience."
    },
    {
      "key": "Qualifications:",
      "value": "The role and what you will do\n\nWorking on the team that leads the product development of LTE/5G/WiFi 5/WiFi 6E technologies.\nAssisting technical project managers on planning and implementing the development of new wireless products from initial design requirements through to production\nCollaborate with different functional teams including FW, SW, HW, RF and ME, External partners include ODM's and external subcontract suppliers\nWork with other departments such as Product Line Management, Operations, and Quality to ensure successful transfer to mass production and commercial launch\nWorking on maintaining MOL (Maintenance of Line for the existing products)\nInvolved in the entire product development process\n\nWhat you'll bring to the role\n\nUnderstanding of hardware and software of commercial products\nUnderstanding of SW development cycles and SQA processes is an asset\nAbility to understand and debug/resolve HW/SW issues is an asset\nAbility to work with customers on issue resolution, scheduling, etc.\nEffective organization and coordination skills; ability to get the job done\nStrong attention to detail and follow-through on outstanding issues and corrective actions\nExcellent interpersonal skills\nExcellent English verbal and written communications skills\n\nOur list of \"nice to haves\"\n\nWorking towards a BSc. in Computer Science or B.A. Sc. in Electrical Engineering\nPrevious project management experience\nPrior experience with LTE, 5G Qualcomm based products (Hotspots, Gateway, Modems)"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}