{
  "title": "244875 - Test Automation Developer Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8, 12 OR 16 MONTH WORK TERM\n\nWork Duration: 8, 12, or 16 months (An 8 month employment period is registered as 2 separate, consecutive work terms, and a 12 month employment period is registered as 3 separate, consecutive work terms , and a 16-month employment period is registered as 4 separate, consecutive work terms). Please state CLEARLY in your cover letter whether you are available for 8, 12, and/or 16 months.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Test Automation Developer Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Vancouver"
    },
    {
      "key": "Region:",
      "value": "BC-Greater Vancouver"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, partially remote (hybrid)"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "$47,000 - $57,000 prorated"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Test Automation Developer Co-op\n\nDepartment\nCambio Earth Systems\n\nJob Opportunity: Test Automation Developer Co-op\n\nDuration: 8 Months, 12 months or 16 months\n\nStart Date: May 5, 2025\n\nLocation: Vancouver, BC\n\nWork-Model: Hybrid\n\nAbout Us\n\nCambio Earth is an enterprise SaaS company headquartered in Vancouver, BC. With a foundation of more than 20 years as part of BGC Engineering, Cambio Earth is charting a new course, grounded in deep earth science expertise, with a mission to transform climate resiliency for critical infrastructure (think: pipelines, railways, roads, highways, mines, dams, levees and other assets). We do that by unlocking real-time earth science intelligence through advanced geospatial data integration, distributed services and microservices, machine learning, and some sweet analytics and visualization tools.\n\n\nGoing back to our mission, the climate is changing, and the exact implications remain unclear for infrastructure operators, governments, and communities. What we know is that the frequency of geohazards such as floods, landslides, rockfalls, earthquakes, wildfires and hurricanes is increasing and threatens the integrity of critical infrastructure. We are looking for like-minded individuals who want to work on a highly scalable, cutting edge, distributed application that helps protect people, essential services, and the environment to join our team.\n\nThe Role\n\nThe Test Automation Developer Co-op will be a part of Cambio Earth's software development team working alongside engineers and geoscientists to develop safety critical software applications. Apply your software development knowledge to help Cambio Earth test applications that warn our clients about potential geological hazards and risks. As a Test Automation Developer Co-op, you will have opportunities to develop and maintain test automation framework in an Agile CI/CD environment. This opportunity is located in Vancouver, BC and is a hybrid position. The start date of this position is May 5, 2025.\n\n\nResponsibilities\n\nDesign, implement, and maintain automated scripts using Selenium with SpecFlow (BDD) and C#\nCreate detailed test plans and test cases in accordance with the business requirements\nConvert manual test cases into automated test scripts following page object model and data-driven approach\nExecute, monitor, debug and fix failing E2E tests\nHelp to prioritize work based on the business needs for each sprint\nPerform code review and provide feedback to improve code quality\nPerform manual testing when required and file bug reports following appropriate QA practices\nWork closely with the QA team, software developers, product owners, DevOps and UI\n\n\nCambio Earth Systems is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. If you need assistance or accommodation with your application, please contact us."
    },
    {
      "key": "Qualifications:",
      "value": "Required Education, Experience & Competencies\n\nComputer Science or Engineering student in 3rd or 4th year\nExperience with at least one modern programming language such as C#, Java or equivalent\nBasic understanding of databases such as MS SQL, MySQL\nGood understanding of the Software Development Life Cycle\nDetail oriented, ability to work independently and is self-motivated\nAbility and the desire to learn QA tools and QA functions\n\nExcellent verbal and written communication skills"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}