{
  "title": "245006 - Software Co-op",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "8 MONTH WORK TERM\n\nWork Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Software Co-op"
    },
    {
      "key": "Job Location:",
      "value": "Victoria"
    },
    {
      "key": "Region:",
      "value": "BC-Victoria (Capital Region)"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Why work for Pani / What will you do here?\n\nAs a co-op student in the software development department, you will directly contribute to Pani's success by coding and releasing new features, fixes, and improvements to Pani's customer facing SaaS product and back-end processing systems. You will develop and use highly desirable technical skills including Python, REST APIs, JavaScript, HTML, CSS, React, Amazon Web Services, Relational Databases, Time Series Data, Distributed Systems and Processing, and more.\n\nYou will be a core member of the software development team working directly with other team members and stakeholders in our software development life cycle; we don't do 'co-op projects' at Pani. You will end your workday feeling amazing in that your efforts are directly contributing Pani's environmental mission to globally reduce greenhouse gasses."
    },
    {
      "key": "Qualifications:",
      "value": "Desired Qualifications and Education\n\nThe successful candidate will be a strong communicator and problem solver that has previous web based development experience from prior work terms, school, or hobby projects. We are looking for a 3rd or 4th year software engineering, computer science, or equivalent student.\n8 month minimum commitment (this is non negotiable)\nStudent on Vancouver Island or the lower mainland.\nWhile this is a mostly remote position, successful candidate must be able to attend in person team building and strategy sessions roughly every couple of months in Victoria, BC.\nExperience coding in Python.\n\nNice to have:\n\nExperience developing REST APIs in Python via a framework like Flask, Django, or FastAPI\nExperience with front end development and fundamentals (HTML, CSS, JavaScript)\nNice to have: mobile/tablet compatibility (Responsive design, touch interactions)\nExperience with a modern JavaScript framework (preferably React)\nExperience working with Git version control.\nNice-to-have is tangential experience with engineering/math (through join majors or electives, etc), as our product is engineering-heavy.\n\nSofter Skills:\n\nDriven to ask 'why' questions about work they are given\nStrong verbal communicator comfortable working directly with stakeholders\nAsks for clarification when they don't have full understanding\nHigh general intelligence and problem solving abilities"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}