{
  "title": "244843 - Software Developer Intern 8 months - Summer 2025 - Req #20743",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Work Duration: 8 months (An 8 month employment period is registered as 2 separate, consecutive work terms). Please ONLY apply if you are available for 8 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four."
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "8 Months Full Time (2 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "Software Developer Intern 8 months - Summer 2025 - Req #20743"
    },
    {
      "key": "Job Location:",
      "value": "Remote"
    },
    {
      "key": "Region:",
      "value": "Remote"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "Yes, fully remote"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Salary/Wage:",
      "value": "Hiring Min Rate 28.2 CAD - Hiring Max Rate 32.3 CAD"
    },
    {
      "key": "Hours per Week:",
      "value": "37.5 - 40 hours weekly"
    },
    {
      "key": "Number of Positions:",
      "value": "10"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Dayforce, a global leader in Human Capital Management (HCM) with headquarters in Toronto, Ontario, and Minneapolis, Minnesota, operates across North America, EMEA, and APJ regions. Our Cloud HCM platform, recognized for its unified database and continuous calculation engine, enhances efficiency, productivity, and compliance for global workforces. We are committed to \"Making Work Life Better™\" for employees, customers, and partners worldwide.\n\nAs an Intern at Dayforce, you'll gain real-world experience with meaningful responsibilities, access to development programs, and the chance to collaborate globally, bringing new ideas and optimizing processes across multiple business units.\n\nLocation: Virtual\n\nDuration: 8 Months (May 2025 - December 2025)\n\nAvailability: *Full-time availability of 37.5 - 40 hours weekly is required to be eligible for this opportunity.\n\nBenefits for Students:\n\nExperience working for one of the fastest growing Human Capital Management technology companies in the world Access to Dayforce's development programs and resources\nAbility to work with as well as create relationships with members across the globe\nAutonomy to bring forth new ideas and optimize existing structures within the organization\nMeaningful responsibilities, enabling you to obtain 'real-world' experience\nDynamic hands-on exposure to multiple business-units and stakeholders across Dayforce\n\nAbout the opportunity:\n\nThe Software Developer Intern will closely work with developers in the team and will directly report to the Development Manager. Intern will be primarily responsible for contributing to software development activities including development and testing of deliverables throughout the development life cycle. This is an excellent opportunity to join a rapidly growing innovator in a technically challenging and rewarding role. By working with a team of software enthusiasts, you will develop deep technical expertise and gain valuable business and industry-related experience.\n\nWhat you'll get to do:\n\nWork cross functionally with the development team to build robust, reliable, and scalable solutions.\nDevelop a great product experience, while leveraging the latest technologies\nWork on maintaining and supporting the newly built modules.\nWork with other team members to take ownership and responsibility for development tasks and make them happen.\nActively participate in the development of quality products and processes to deliver industry leading cloud based HCM solution.\nInvestigate, report, and track product failures to resolution.\nIdentify and escalate issues related to planning and quality.\nDesign, develop, maintain, and enhance systems and tools for use by development, Test Engineers and QA\nContribute to creation, extension, and communication of test automation best practices.\nPerform source code analysis to determine quality gaps and communicate high risk areas.\nAssist in assessing product quality and release readiness.\nFacilitate creation and execution of automated test suites.\nParticipating in design and architectural discussions\nHelp ensure new code moves easily through our deployment pipeline."
    },
    {
      "key": "Qualifications:",
      "value": "Skills and experience we value:\n\nSmart and driven student who is passionate about learning new technologies and building high quality cloud applications\nStrong academic performance in courses regarding programming languages, algorithms and data structures, computer organization, and discrete mathematics.\nDisciplined self-starter, capable of working independently or in close collaboration within an agile development team\nExcellent communication and collaboration skills\nStrong coding skills in a modern object-oriented language (e.g., C#, Java, C++, Python, Powershell)\nWorking knowledge of modern web technologies including JavaScript, Dojo, React, Angular, Ember, Backbone, jQuery, HTML, CSS 3, SVG, JSON, etc. from professional or academic projects\nExperience with .NET framework\nExperience working with any of the following testing tools: Selenium, FitNesse, or SpecFlow\nWorking knowledge of modern relational databases architecture and SQL language through professional or academic projects\nHave a passion for solving hard problems and know how to have fun!\n\nWhat would really make you stand out:\n\nExperience in applying design patterns, writing unit tests, and optimizing performance in application-level Typescript/JavaScript\nExperience with cloud platforms such as AWS, Azure, or Google Cloud.\nKnowledge of DevOps practices and tools (e.g., Docker, Kubernetes).\nExperience with VS or VSCode\nExperience working with SaaS Enterprise Software is a plus\nKnowledge of microservices (WebAPI, REST, JSON)\nKnowledge of Azure DevOps (CI/CD)\nKnowledge of SaaS architectures and workloads\nProficiency in using Visual Studio as IDE\nExperience writing automation tests\n\nWhat's in it for you\n\nDayforce is fueled by the diversity of our talented employees. We are an equal opportunity employer and consider and embrace ALL individuals and what makes them unique. We believe our employees should be happy and healthy, with peace of mind and a sense of fulfillment.\n\nWe encourage individuals to apply based on their passions.\n\nDayforce encourages personal and professional growth. We offer excellent time away from work programs, comprehensive wellness initiatives and recognition through competitive pay and benefits.\n\nWith a commitment to community impact, including volunteer days and our charity, Dayforce Cares we provide opportunities for you to thrive both in your career and personal life. Our focus is not just on your job but on supporting you to be the best version of yourself.\n\nFraudulent Recruiting\n\nBeware of fraudulent recruiting. Legitimate Dayforce contacts will use an @dayforce.com or @Ceridian.com email address. We do not request money, checks, equipment orders, or sensitive personal data during the recruitment process. If you have been asked for any of the above, or believe you have been contacted by someone posing as a Dayforce employee, please refer to our fraudulent recruiting statement found here: https://www.dayforce.com/be-aware-of-recruiting-fraud"
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "1"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}