{
  "title": "245213 - 2025 Co-Op - Environmental Engineering, CAMI Assembly Plant",
  "details": [
    {
      "key": "Special Job Requirements:",
      "value": "Work Duration: 16 months (A 16 month employment period is registered as 4 separate, consecutive work terms). Please ONLY apply if you are available for 16 months, and state your availability CLEARLY in your cover letter.\n\nNote For Engineering Undergraduate Students: Before applying to this posting, it is your responsibility to have completed the appropriate pre-requisite courses for this length of work term, and to understand how this length of work term affects your academics. Engineering undergrads -- If this means you will be registered in a 5th or higher work term, the full co-op tuition fee (equal to two installments) will be charged for each extra work term above the mandatory four.\n\nNEED HELP TO RELOCATE?\nIf you're traveling outside Victoria for a co-op work term, you may be eligible for a limited $1,000 travel stipend through the Strategic Framework Experiential Learning Fund (SF-ELF). For details, see the section Co-operative Education Travel Awards for Work Terms outside Victoria"
    },
    {
      "key": "Co-op Work Term:",
      "value": "2025 - Summer"
    },
    {
      "key": "Position Type (Disclaimer: not all types available in all programs):",
      "value": "Regular Co-op, Full Time"
    },
    {
      "key": "Co-op Work term Duration:",
      "value": "16 Months Full Time (4 Work Terms)"
    },
    {
      "key": "Job Title:",
      "value": "2025 Co-Op - Environmental Engineering, CAMI Assembly Plant"
    },
    {
      "key": "Job Location:",
      "value": "Ingersoll"
    },
    {
      "key": "Region:",
      "value": "ON-South Western Ontario"
    },
    {
      "key": "Are remote work arrangements possible for this co-op role?:",
      "value": "No, fully in-person/at work-site"
    },
    {
      "key": "Does this job require the student to be fully vaccinated for COVID-19?:",
      "value": "Unknown"
    },
    {
      "key": "Is this a contractor role?:",
      "value": "No"
    },
    {
      "key": "Number of Positions:",
      "value": "1"
    },
    {
      "key": "Work Abroad:",
      "value": "No"
    },
    {
      "key": "Job Description:",
      "value": "Work Arrangement:\n\nOnsite: This role is categorized as onsite. This means the successful candidate is expected to report to CAMI Assembly on a full-time basis\n\nAbout GM:\n\nAt General Motors we pride ourselves on designing, building and selling the world's best vehicles. We are seeking a new generation of visionaries to help launch bold engineering and business initiatives, and shape new directions for General Motors. As an intern or co-op student through our EXCEL (Exploring Careers through Experiential Learning) Program you will gain hands-on career specific experiences to maximize your real world potential.\n\nThe Role:\n\nGeneral Motors of Canada Company - CAMI Assembly Plant is inviting applications from Engineering & Science students for one (1) Environmental Engineering Internship position. The intern will be assigned to the above noted facility for the entire duration of the 16-month internship.\n\nGet the jump-start you need to get your career moving by gaining valuable professional experience within an automotive manufacturing environment.\n\nGeneral Motors of Canada CAMI Assembly Plant is Canada's first large-scale electric commercial vehicles manufacturing plant. In 2022, the plant was transformed into General Motors newest business - Chevrolet BrightDrop Zevo 600 and Zevo 400 models being built at GM CAMI Assembly Plant. https://www.gmenvolve.com/. In 2024, the new 400,000 sq.ft. battery module assembly facility was launched and supports the BrightDrop Zevo production as well as additional Ultium EVs built at other GM plants.\n\nThis is an opportunity for you to join a team that builds quality and cost competitive vehicles for our worldwide customers within a safe work environment. The GM CAMI Assembly Plant is a benchmark facility which includes as a three-time recipient of the ENERGY STAR certification, 2024 London Chamber of Commerce Environmental Leadership Award and WHC Gold Level Certification & 2018 WHC Gold Program Award recipient.\n\nThe Team:\n\nThe Environmental Operations Team consists of highly trained environmental professionals who serve as a first line resource for our manufacturing business partners. We are proficient at implementing robust environmental and sustainability practices into daily business decisions and operations to comply with applicable environmental laws and regulations while fostering community connection. We work collaboratively in the Sustainable Workplaces team with our service suppliers, community partners, regulatory agencies, environmental consultants, and legal counsel staff.\n\nThe preferred candidate will be a self-motivated, confident science or engineering student with strong problem solving, interpersonal and communication skills. The candidate will be required to work with minimal supervision and will be expected to continually improve the operation for their area. Candidate must have a valid driver's license.\n\nAs an environmental engineering intern, you will work closely with the facility environmental team developing an understanding of environmental compliance in automotive manufacturing operations. You will be a part of project implementation and continuous improvement of various water, waste, and air programs. We are committed to developing innovative solutions to various environmental challenges as we advance towards GM's vision of Zero Crashes, Zero Emissions, and Zero Congestions. It's never been a more exciting time to join the Sustainable Workplaces team!\n\nKey Responsibilities:\n\nWork cross functionally with diverse groups to create and implement best-in-class, sustainable solutions to improve environmental compliance and sustainability across the site.\nCoordinate industrial process wastewater and stormwater program in compliance with local by-laws and Ontario Ministry of the Environment Environmental Compliance Approvals permit (ECA).\nOversee industrial wastewater & stormwater management system (bioswales, detention ponds) sampling and 3rd party analytical program.\nSupport the development of action plans for treatment of non-compliant industrial wastewater conditions.\nProject Manager for various as assigned environmental engineering and facility projects.\nDevelop and coordinate plant sustainability community outreach activities and environmental awareness programs i.e., GM CAMI ecoSTEM, WHC Wildlife Habitat Certification program.\nPursue new opportunities to increase environmental profile in the community and within General Motors network.\nSupport the implementation of plant sustainability initiatives to meet GM Sustainability Goals reported through the annual GM Sustainability Report. https://www.gmsustainability.com\nOversee ISO 14001 Environmental Management System Internal Audit Program as per the International Organization for Standardization ISO 14001:2015 standard at CAMI Assembly and other GM facilities.\nIdentify and support process improvements to reduce environmental impacts of operational processes.\nCoordinate and support Zero Waste and Landfill Free plant waste management program initiatives and in compliance with applicable waste legislation.\nDevelop and analyze monthly environmental performance metrics (Plan Do Check Act PDCA continuous improvement process) and support corrective actions to ensure compliance to target objectives.\nConduct plant environmental inspections, coordinate follow-up activities and effectively maintain the GM CAMI problem solving reporting database.\nPerform other duties as required."
    },
    {
      "key": "Qualifications:",
      "value": "Required Qualifications:\n\nCurrently enrolled in an Environmental, Chemical, Civil or Materials Engineering degree; Environmental Science or Sustainable Chemistry degree Co-Op program\nIn your 3rd year of study, and must be eligible to work full-time (40 hours per week) in Canada for 16 months work term (4 consecutive semesters)\nStrong organizational, problem solving, and analytical skills\nHighly adaptable with ability to work independently with minimal supervision and in a team environment\nSelf-motivated and confident to continually improve the operation of their area\nMust have a valid full G Canadian driver's license\n\nDesired Skills:\n\nOutstanding leadership, interpersonal, and relationship management skills with the ability to effectively collaborate with varying levels of the organization.\nExcellent written and verbal communication skills with the ability to distill complex subjects to a wider audience.\n\nWhat will give you a Competitive Edge (Preferred Qualifications):\n\nPast experience in an industrial and/or manufacturing environment\nKnowledge and understanding of ISO 14001 standard and environmental legislation\n\nSponsorship: GM DOES NOT PROVIDE IMMIGRATION-RELATED SPONSORSHIP FOR THIS ROLE IF YOU WILL NEED IMMIGRATION SPONSORSHIP (e.g., H-1B, TN, STEM OPT, etc.) NOW OR IN THE FUTURE.\n\nAbout GM\n\nOur vision is a world with Zero Crashes, Zero Emissions and Zero Congestion and we embrace the responsibility to lead the change that will make our world better, safer and more equitable for all.\n\nWhy Join Us\n\nWe aspire to be the most inclusive company in the world. We believe we all must make a choice every day - individually and collectively - to drive meaningful change through our words, our deeds and our culture. Our Work Appropriately philosophy supports our foundation of inclusion and provides employees the flexibility to work where they can have the greatest impact on achieving our goals, dependent on role needs. Every day, we want every employee, no matter their background, ethnicity, preferences, or location, to feel they belong to one General Motors team.\n\nDiversity Information\n\nGeneral Motors is committed to being a workplace that is not only free of discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that workforce diversity creates an environment in which our employees can thrive and develop better products for our customers. We understand and embrace the variety through which people gain experiences whether through professional, personal, educational, or volunteer opportunities.\n\nWe encourage interested candidates to review the key responsibilities and qualifications and apply for any positions that match your skills and capabilities.\n\nEqual Employment Opportunity Statement\n\nAccommodation is available for applicants with disabilities. Should you be contacted by General Motors of Canada, please advise if you require accommodation. General Motors of Canada values diversity and is an equal opportunity employer."
    },
    {
      "key": "For relevant employers as defined by the BC Criminal Review Act: Will this position require a co-op student to complete a Criminal Records check?:",
      "value": "No"
    },
    {
      "key": "Minimum Academic Year Completed:",
      "value": "2"
    },
    {
      "key": "Minimum Work terms Completed:",
      "value": "0"
    },
    {
      "key": "Are there any restrictions that would hinder hiring of non-Canadian students with a valid work permit?:",
      "value": "No"
    }
  ]
}